#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_MiniPoint

#include "Basic.hpp"


namespace SDK::Params
{

// Function AC_MiniPoint.AC_MiniPoint_C.ExecuteUbergraph_AC_MiniPoint
// 0x0058 (0x0058 - 0x0000)
struct AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Point_C*                            CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMINIMAP_UMG_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMINIMAP_UMG_C*                         CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMINIMAP_UMG_C*>                 CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMINIMAP_UMG_C*                         CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint) == 0x000008, "Wrong alignment on AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint");
static_assert(sizeof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint) == 0x000058, "Wrong size on AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, EntryPoint) == 0x000000, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::EntryPoint' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_Create_ReturnValue) == 0x000008, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000010, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_Array_Get_Item) == 0x000020, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000030, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'AC_MiniPoint_C_ExecuteUbergraph_AC_MiniPoint::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

}

