#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_MiniPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_MiniPoint.AC_MiniPoint_C
// 0x0048 (0x00F8 - 0x00B0)
class UAC_MiniPoint_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTexture2D*                             Icon_Texture;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Point_C*                            WB_Point;                                          // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x00C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Details;                                           // 0x00E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_AC_MiniPoint(int32 EntryPoint);
	void ReceiveBeginPlay();
	void AddPOI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AC_MiniPoint_C">();
	}
	static class UAC_MiniPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_MiniPoint_C>();
	}
};
static_assert(alignof(UAC_MiniPoint_C) == 0x000008, "Wrong alignment on UAC_MiniPoint_C");
static_assert(sizeof(UAC_MiniPoint_C) == 0x0000F8, "Wrong size on UAC_MiniPoint_C");
static_assert(offsetof(UAC_MiniPoint_C, UberGraphFrame) == 0x0000B0, "Member 'UAC_MiniPoint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAC_MiniPoint_C, Icon_Texture) == 0x0000B8, "Member 'UAC_MiniPoint_C::Icon_Texture' has a wrong offset!");
static_assert(offsetof(UAC_MiniPoint_C, WB_Point) == 0x0000C0, "Member 'UAC_MiniPoint_C::WB_Point' has a wrong offset!");
static_assert(offsetof(UAC_MiniPoint_C, Name_0) == 0x0000C8, "Member 'UAC_MiniPoint_C::Name_0' has a wrong offset!");
static_assert(offsetof(UAC_MiniPoint_C, Details) == 0x0000E0, "Member 'UAC_MiniPoint_C::Details' has a wrong offset!");

}

