#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AIBulletMaster_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AIBulletMaster_BP.AIBulletMaster_BP_C
// 0x0020 (0x0240 - 0x0220)
class AAIBulletMaster_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AIBulletMaster_BP(int32 EntryPoint);
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AIBulletMaster_BP_C">();
	}
	static class AAIBulletMaster_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAIBulletMaster_BP_C>();
	}
};
static_assert(alignof(AAIBulletMaster_BP_C) == 0x000008, "Wrong alignment on AAIBulletMaster_BP_C");
static_assert(sizeof(AAIBulletMaster_BP_C) == 0x000240, "Wrong size on AAIBulletMaster_BP_C");
static_assert(offsetof(AAIBulletMaster_BP_C, UberGraphFrame) == 0x000220, "Member 'AAIBulletMaster_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AAIBulletMaster_BP_C, Sphere) == 0x000228, "Member 'AAIBulletMaster_BP_C::Sphere' has a wrong offset!");
static_assert(offsetof(AAIBulletMaster_BP_C, ProjectileMovement) == 0x000230, "Member 'AAIBulletMaster_BP_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(AAIBulletMaster_BP_C, Sound) == 0x000238, "Member 'AAIBulletMaster_BP_C::Sound' has a wrong offset!");

}

