#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AlarmBell_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PickUpMaster_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AlarmBell_BP.AlarmBell_BP_C
// 0x0018 (0x0340 - 0x0328)
class AAlarmBell_BP_C final : public APickUpMaster_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_AlarmBell_BP_C;                     // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        alarm_siren_loop_03_Cue;                           // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ElectricMeter_2;                                // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AlarmBell_BP(int32 EntryPoint);
	void 关闭位置提示();
	void 警报声淡入();
	void 互动结束不销毁();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AlarmBell_BP_C">();
	}
	static class AAlarmBell_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAlarmBell_BP_C>();
	}
};
static_assert(alignof(AAlarmBell_BP_C) == 0x000008, "Wrong alignment on AAlarmBell_BP_C");
static_assert(sizeof(AAlarmBell_BP_C) == 0x000340, "Wrong size on AAlarmBell_BP_C");
static_assert(offsetof(AAlarmBell_BP_C, UberGraphFrame_AlarmBell_BP_C) == 0x000328, "Member 'AAlarmBell_BP_C::UberGraphFrame_AlarmBell_BP_C' has a wrong offset!");
static_assert(offsetof(AAlarmBell_BP_C, alarm_siren_loop_03_Cue) == 0x000330, "Member 'AAlarmBell_BP_C::alarm_siren_loop_03_Cue' has a wrong offset!");
static_assert(offsetof(AAlarmBell_BP_C, SM_ElectricMeter_2) == 0x000338, "Member 'AAlarmBell_BP_C::SM_ElectricMeter_2' has a wrong offset!");

}

