#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmmoSelect_BP

#include "Basic.hpp"

#include "WeaponType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AmmoSelect_BP.AmmoSelect_BP_C.ExecuteUbergraph_AmmoSelect_BP
// 0x00B0 (0x00B0 - 0x0000)
struct AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   ___byte_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ___Class_Variable;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ___Class_Variable_1;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ___Class_Variable_2;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ___Class_Variable_3;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ___Class_Variable_4;                               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class UClass*                                 K2Node_Select_Default;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP) == 0x000010, "Wrong alignment on AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP");
static_assert(sizeof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP) == 0x0000B0, "Wrong size on AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, EntryPoint) == 0x000000, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___byte_Variable) == 0x000004, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___byte_Variable' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___Class_Variable) == 0x000008, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___Class_Variable' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___Class_Variable_1) == 0x000010, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___Class_Variable_1' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___Class_Variable_2) == 0x000018, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___Class_Variable_2' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___Class_Variable_3) == 0x000020, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___Class_Variable_3' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, ___Class_Variable_4) == 0x000028, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::___Class_Variable_4' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000030, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, K2Node_DynamicCast_AsPlayer_BP) == 0x000048, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000060, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, K2Node_Select_Default) == 0x000090, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000098, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000A0, "Member 'AmmoSelect_BP_C_ExecuteUbergraph_AmmoSelect_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");

}

