#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AN_SpawnActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AN_SpawnActor.AN_SpawnActor_C.Received_Notify
// 0x0080 (0x0080 - 0x0000)
struct AN_SpawnActor_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0xF];                                       // 0x0011(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AUseMeshes_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AN_SpawnActor_C_Received_Notify) == 0x000010, "Wrong alignment on AN_SpawnActor_C_Received_Notify");
static_assert(sizeof(AN_SpawnActor_C_Received_Notify) == 0x000080, "Wrong size on AN_SpawnActor_C_Received_Notify");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, MeshComp) == 0x000000, "Member 'AN_SpawnActor_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, Animation_0) == 0x000008, "Member 'AN_SpawnActor_C_Received_Notify::Animation_0' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AN_SpawnActor_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_GetSocketTransform_ReturnValue) == 0x000020, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000058, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000060, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_FinishSpawningActor_ReturnValue) == 0x000068, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(AN_SpawnActor_C_Received_Notify, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000070, "Member 'AN_SpawnActor_C_Received_Notify::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

}

