#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttackStop

#include "Basic.hpp"


namespace SDK::Params
{

// Function AttackStop.AttackStop_C.Received_Notify
// 0x0050 (0x0050 - 0x0000)
struct AttackStop_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AGhost_GrandMa_BP_C*                    K2Node_DynamicCast_AsGhost_Grand_Ma_BP;            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Entity_Pawn_C*                      K2Node_DynamicCast_AsBP_Entity_Pawn;               // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AttackStop_C_Received_Notify) == 0x000008, "Wrong alignment on AttackStop_C_Received_Notify");
static_assert(sizeof(AttackStop_C_Received_Notify) == 0x000050, "Wrong size on AttackStop_C_Received_Notify");
static_assert(offsetof(AttackStop_C_Received_Notify, MeshComp) == 0x000000, "Member 'AttackStop_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, Animation) == 0x000008, "Member 'AttackStop_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, ReturnValue) == 0x000010, "Member 'AttackStop_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'AttackStop_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_AsZombie_BP) == 0x000020, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'AttackStop_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_AsGhost_Grand_Ma_BP) == 0x000030, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_AsGhost_Grand_Ma_BP' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_AsBP_Entity_Pawn) == 0x000040, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_AsBP_Entity_Pawn' has a wrong offset!");
static_assert(offsetof(AttackStop_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'AttackStop_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

