#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backpack_DragObject_UMG

#include "Basic.hpp"

#include "InventoryData_Struct_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Backpack_DragObject_UMG.Backpack_DragObject_UMG_C
// 0x0110 (0x0370 - 0x0260)
class UBackpack_DragObject_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hover_2;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover_1;                                           // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Hover;                                             // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Border_29;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_136;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_87;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                选中白色描边; // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FInventoryData_Struct                  InventoryData;                                     // 0x02B0(0x0098)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UInventorySystem_Component_C*           背包组件; // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBackpack_DragObject_UMG_C*             ItemDragUMG;                                       // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBackpack_Details_C*                    DetailsUMG;                                        // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWidget*                                物品主界面; // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         数量; // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Backpack_DragObject_UMG(int32 EntryPoint);
	void Destruct();
	void Construct();
	void RefreshData(const struct FInventoryData_Struct& InventoryData_0);
	void 更改成空格子();
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragCancelled(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	void UseObject();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void 创建UI(class UWidget** 创建的UI);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Backpack_DragObject_UMG_C">();
	}
	static class UBackpack_DragObject_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackpack_DragObject_UMG_C>();
	}
};
static_assert(alignof(UBackpack_DragObject_UMG_C) == 0x000008, "Wrong alignment on UBackpack_DragObject_UMG_C");
static_assert(sizeof(UBackpack_DragObject_UMG_C) == 0x000370, "Wrong size on UBackpack_DragObject_UMG_C");
static_assert(offsetof(UBackpack_DragObject_UMG_C, UberGraphFrame) == 0x000260, "Member 'UBackpack_DragObject_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Hover_2) == 0x000268, "Member 'UBackpack_DragObject_UMG_C::Hover_2' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Hover_1) == 0x000270, "Member 'UBackpack_DragObject_UMG_C::Hover_1' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Hover) == 0x000278, "Member 'UBackpack_DragObject_UMG_C::Hover' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Border) == 0x000280, "Member 'UBackpack_DragObject_UMG_C::Border' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Border_1) == 0x000288, "Member 'UBackpack_DragObject_UMG_C::Border_1' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Border_29) == 0x000290, "Member 'UBackpack_DragObject_UMG_C::Border_29' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, Image_136) == 0x000298, "Member 'UBackpack_DragObject_UMG_C::Image_136' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, TextBlock_87) == 0x0002A0, "Member 'UBackpack_DragObject_UMG_C::TextBlock_87' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, 选中白色描边) == 0x0002A8, "Member 'UBackpack_DragObject_UMG_C::选中白色描边' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, InventoryData) == 0x0002B0, "Member 'UBackpack_DragObject_UMG_C::InventoryData' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, 背包组件) == 0x000348, "Member 'UBackpack_DragObject_UMG_C::背包组件' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, ItemDragUMG) == 0x000350, "Member 'UBackpack_DragObject_UMG_C::ItemDragUMG' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, DetailsUMG) == 0x000358, "Member 'UBackpack_DragObject_UMG_C::DetailsUMG' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, 物品主界面) == 0x000360, "Member 'UBackpack_DragObject_UMG_C::物品主界面' has a wrong offset!");
static_assert(offsetof(UBackpack_DragObject_UMG_C, 数量) == 0x000368, "Member 'UBackpack_DragObject_UMG_C::数量' has a wrong offset!");

}

