#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backroom_AK74_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Weapon_Master_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Backroom_AK74_BP.Backroom_AK74_BP_C
// 0x0028 (0x04A8 - 0x0480)
class ABackroom_AK74_BP_C final : public AWeapon_Master_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Backroom_AK74_BP_C;                 // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Bullet2;                                           // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bullet1;                                           // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAK74_Anim_C*                           As_AK74_Anim;                                      // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Backroom_AK74_BP(int32 EntryPoint);
	void 开始换弹();
	void ReceiveBeginPlay();
	void 武器子弹空仓动画();
	void 播放射击();
	void 是否是空仓状态(bool 空仓换弹);
	void 停止蒙太奇();
	void CheckMagazine();
	void CheckChamber();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Backroom_AK74_BP_C">();
	}
	static class ABackroom_AK74_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABackroom_AK74_BP_C>();
	}
};
static_assert(alignof(ABackroom_AK74_BP_C) == 0x000008, "Wrong alignment on ABackroom_AK74_BP_C");
static_assert(sizeof(ABackroom_AK74_BP_C) == 0x0004A8, "Wrong size on ABackroom_AK74_BP_C");
static_assert(offsetof(ABackroom_AK74_BP_C, UberGraphFrame_Backroom_AK74_BP_C) == 0x000480, "Member 'ABackroom_AK74_BP_C::UberGraphFrame_Backroom_AK74_BP_C' has a wrong offset!");
static_assert(offsetof(ABackroom_AK74_BP_C, Bullet2) == 0x000488, "Member 'ABackroom_AK74_BP_C::Bullet2' has a wrong offset!");
static_assert(offsetof(ABackroom_AK74_BP_C, Bullet1) == 0x000490, "Member 'ABackroom_AK74_BP_C::Bullet1' has a wrong offset!");
static_assert(offsetof(ABackroom_AK74_BP_C, Montage_to_Play) == 0x000498, "Member 'ABackroom_AK74_BP_C::Montage_to_Play' has a wrong offset!");
static_assert(offsetof(ABackroom_AK74_BP_C, As_AK74_Anim) == 0x0004A0, "Member 'ABackroom_AK74_BP_C::As_AK74_Anim' has a wrong offset!");

}

