#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backpack_Details

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Backpack_Details.Backpack_Details_C.ExecuteUbergraph_Backpack_Details
// 0x00B0 (0x00B0 - 0x0000)
struct Backpack_Details_C_ExecuteUbergraph_Backpack_Details final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent___;                             // 0x0058(0x0018)()
	class FText                                   K2Node_CustomEvent____1;                           // 0x0070(0x0018)()
	class FText                                   K2Node_CustomEvent____2;                           // 0x0088(0x0018)()
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00A4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details) == 0x000008, "Wrong alignment on Backpack_Details_C_ExecuteUbergraph_Backpack_Details");
static_assert(sizeof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details) == 0x0000B0, "Wrong size on Backpack_Details_C_ExecuteUbergraph_Backpack_Details");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, EntryPoint) == 0x000000, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::EntryPoint' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, K2Node_Event_MyGeometry) == 0x000004, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000040, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_BreakVector2D_X) == 0x000050, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_BreakVector2D_Y) == 0x000054, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, K2Node_CustomEvent___) == 0x000058, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::K2Node_CustomEvent___' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, K2Node_CustomEvent____1) == 0x000070, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::K2Node_CustomEvent____1' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, K2Node_CustomEvent____2) == 0x000088, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::K2Node_CustomEvent____2' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000A0, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_ExecuteUbergraph_Backpack_Details, CallFunc_MakeVector2D_ReturnValue) == 0x0000A4, "Member 'Backpack_Details_C_ExecuteUbergraph_Backpack_Details::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function Backpack_Details.Backpack_Details_C.设置文字
// 0x0048 (0x0048 - 0x0000)
struct Backpack_Details_C_设置文字 final
{
public:
	class FText                                   名称_0; // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   类别_0;                                          // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   描述_0; // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(Backpack_Details_C_设置文字) == 0x000008, "Wrong alignment on Backpack_Details_C_设置文字");
static_assert(sizeof(Backpack_Details_C_设置文字) == 0x000048, "Wrong size on Backpack_Details_C_设置文字");
static_assert(offsetof(Backpack_Details_C_设置文字, 名称_0) == 0x000000, "Member 'Backpack_Details_C_设置文字::名称_0' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_设置文字, 类别_0) == 0x000018, "Member 'Backpack_Details_C_设置文字::类别_0' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_设置文字, 描述_0) == 0x000030, "Member 'Backpack_Details_C_设置文字::描述_0' has a wrong offset!");

// Function Backpack_Details.Backpack_Details_C.Tick
// 0x003C (0x003C - 0x0000)
struct Backpack_Details_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_Details_C_Tick) == 0x000004, "Wrong alignment on Backpack_Details_C_Tick");
static_assert(sizeof(Backpack_Details_C_Tick) == 0x00003C, "Wrong size on Backpack_Details_C_Tick");
static_assert(offsetof(Backpack_Details_C_Tick, MyGeometry) == 0x000000, "Member 'Backpack_Details_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_Details_C_Tick, InDeltaTime) == 0x000038, "Member 'Backpack_Details_C_Tick::InDeltaTime' has a wrong offset!");

}

