#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackroomSpawner_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BackroomSpawner_BP.BackroomSpawner_BP_C
// 0x0050 (0x0270 - 0x0220)
class ABackroomSpawner_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         生成多少个; // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         NewVar_0;                                          // 0x0238(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Get;                                               // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SpawnClass;                                        // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   Tag;                                               // 0x0264(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BackroomSpawner_BP(int32 EntryPoint);
	void 开始生成();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BackroomSpawner_BP_C">();
	}
	static class ABackroomSpawner_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABackroomSpawner_BP_C>();
	}
};
static_assert(alignof(ABackroomSpawner_BP_C) == 0x000008, "Wrong alignment on ABackroomSpawner_BP_C");
static_assert(sizeof(ABackroomSpawner_BP_C) == 0x000270, "Wrong size on ABackroomSpawner_BP_C");
static_assert(offsetof(ABackroomSpawner_BP_C, UberGraphFrame) == 0x000220, "Member 'ABackroomSpawner_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, DefaultSceneRoot) == 0x000228, "Member 'ABackroomSpawner_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, 生成多少个) == 0x000230, "Member 'ABackroomSpawner_BP_C::生成多少个' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, NewVar_0) == 0x000238, "Member 'ABackroomSpawner_BP_C::NewVar_0' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, Index_0) == 0x000248, "Member 'ABackroomSpawner_BP_C::Index_0' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, Get) == 0x000250, "Member 'ABackroomSpawner_BP_C::Get' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, SpawnClass) == 0x000258, "Member 'ABackroomSpawner_BP_C::SpawnClass' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, Radius) == 0x000260, "Member 'ABackroomSpawner_BP_C::Radius' has a wrong offset!");
static_assert(offsetof(ABackroomSpawner_BP_C, Tag) == 0x000264, "Member 'ABackroomSpawner_BP_C::Tag' has a wrong offset!");

}

