#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backroom_AK74_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Backroom_AK74_BP.Backroom_AK74_BP_C.ExecuteUbergraph_Backroom_AK74_BP
// 0x0028 (0x0028 - 0x0000)
struct Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAK74_Anim_C*                           K2Node_DynamicCast_AsAK74_Anim;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_____;                                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x2];                                       // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_Play_ReturnValue_2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP) == 0x000008, "Wrong alignment on Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP");
static_assert(sizeof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP) == 0x000028, "Wrong size on Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, EntryPoint) == 0x000000, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, K2Node_DynamicCast_AsAK74_Anim) == 0x000010, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::K2Node_DynamicCast_AsAK74_Anim' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, K2Node_Event_____) == 0x000019, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::K2Node_Event_____' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, CallFunc_Montage_Play_ReturnValue) == 0x00001C, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, CallFunc_Montage_Play_ReturnValue_1) == 0x000020, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::CallFunc_Montage_Play_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP, CallFunc_Montage_Play_ReturnValue_2) == 0x000024, "Member 'Backroom_AK74_BP_C_ExecuteUbergraph_Backroom_AK74_BP::CallFunc_Montage_Play_ReturnValue_2' has a wrong offset!");

// Function Backroom_AK74_BP.Backroom_AK74_BP_C.是否是空仓状态
// 0x0001 (0x0001 - 0x0000)
struct Backroom_AK74_BP_C_是否是空仓状态 final
{
public:
	bool                                          空仓换弹; // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Backroom_AK74_BP_C_是否是空仓状态) == 0x000001, "Wrong alignment on Backroom_AK74_BP_C_是否是空仓状态");
static_assert(sizeof(Backroom_AK74_BP_C_是否是空仓状态) == 0x000001, "Wrong size on Backroom_AK74_BP_C_是否是空仓状态");
static_assert(offsetof(Backroom_AK74_BP_C_是否是空仓状态, 空仓换弹) == 0x000000, "Member 'Backroom_AK74_BP_C_是否是空仓状态::空仓换弹' has a wrong offset!");

}

