#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackroomTips

#include "Basic.hpp"


namespace SDK::Params
{

// Function BackroomTips.BackroomTips_C.ExecuteUbergraph_BackroomTips
// 0x0028 (0x0028 - 0x0000)
struct BackroomTips_C_ExecuteUbergraph_BackroomTips final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackroomTips_C_ExecuteUbergraph_BackroomTips) == 0x000008, "Wrong alignment on BackroomTips_C_ExecuteUbergraph_BackroomTips");
static_assert(sizeof(BackroomTips_C_ExecuteUbergraph_BackroomTips) == 0x000028, "Wrong size on BackroomTips_C_ExecuteUbergraph_BackroomTips");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, EntryPoint) == 0x000000, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, K2Node_DynamicCast_AsPlayer_BP) == 0x000010, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00001C, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomTips_C_ExecuteUbergraph_BackroomTips, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'BackroomTips_C_ExecuteUbergraph_BackroomTips::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

