#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backpack_DragObject_UMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "InventoryData_Struct_structs.hpp"


namespace SDK::Params
{

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.ExecuteUbergraph_Backpack_DragObject_UMG
// 0x03C0 (0x03C0 - 0x0000)
struct Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent_2;                       // 0x0010(0x0070)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation_2;                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0088(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x00C0(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0130(0x0070)(ConstParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01B0(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x01E8(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation_1;                          // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackpack_DragObject_UMG_C*             K2Node_DynamicCast_AsBackpack_Drag_Object_UMG;     // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0280(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackpack_DragObject_UMG_C*             K2Node_DynamicCast_AsBackpack_Drag_Object_UMG_1;   // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  K2Node_CustomEvent_InventoryData;                  // 0x0308(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_6;              // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDragDropping_ReturnValue;               // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsHovered_ReturnValue;                    // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG");
static_assert(sizeof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG) == 0x0003C0, "Wrong size on Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, EntryPoint) == 0x000000, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_PointerEvent_2) == 0x000010, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_PointerEvent_2' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_Operation_2) == 0x000080, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_Operation_2' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_MyGeometry_1) == 0x000088, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_MouseEvent_1) == 0x0000C0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_MouseEvent) == 0x000130, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x0001A0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_2) == 0x0001A8, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_MyGeometry) == 0x0001B0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_PointerEvent_1) == 0x0001E8, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_Operation_1) == 0x000258, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_Operation_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_DynamicCast_AsBackpack_Drag_Object_UMG) == 0x000260, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_DynamicCast_AsBackpack_Drag_Object_UMG' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_DynamicCast_bSuccess) == 0x000268, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_3) == 0x000270, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_4) == 0x000278, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_PointerEvent) == 0x000280, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_Event_Operation) == 0x0002F0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_DynamicCast_AsBackpack_Drag_Object_UMG_1) == 0x0002F8, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_DynamicCast_AsBackpack_Drag_Object_UMG_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_DynamicCast_bSuccess_1) == 0x000300, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, K2Node_CustomEvent_InventoryData) == 0x000308, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::K2Node_CustomEvent_InventoryData' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0003A0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_5) == 0x0003A8, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_PlayAnimation_ReturnValue_6) == 0x0003B0, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_PlayAnimation_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_IsDragDropping_ReturnValue) == 0x0003B8, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_IsDragDropping_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG, CallFunc_IsHovered_ReturnValue) == 0x0003B9, "Member 'Backpack_DragObject_UMG_C_ExecuteUbergraph_Backpack_DragObject_UMG::CallFunc_IsHovered_ReturnValue' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.RefreshData
// 0x0098 (0x0098 - 0x0000)
struct Backpack_DragObject_UMG_C_RefreshData final
{
public:
	struct FInventoryData_Struct                  InventoryData_0;                                   // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_RefreshData) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_RefreshData");
static_assert(sizeof(Backpack_DragObject_UMG_C_RefreshData) == 0x000098, "Wrong size on Backpack_DragObject_UMG_C_RefreshData");
static_assert(offsetof(Backpack_DragObject_UMG_C_RefreshData, InventoryData_0) == 0x000000, "Member 'Backpack_DragObject_UMG_C_RefreshData::InventoryData_0' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnDragLeave
// 0x0078 (0x0078 - 0x0000)
struct Backpack_DragObject_UMG_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnDragLeave) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnDragLeave");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnDragLeave) == 0x000078, "Wrong size on Backpack_DragObject_UMG_C_OnDragLeave");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragLeave, Operation) == 0x000070, "Member 'Backpack_DragObject_UMG_C_OnDragLeave::Operation' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnDragEnter
// 0x00B0 (0x00B0 - 0x0000)
struct Backpack_DragObject_UMG_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnDragEnter) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnDragEnter");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnDragEnter) == 0x0000B0, "Wrong size on Backpack_DragObject_UMG_C_OnDragEnter");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragEnter, Operation) == 0x0000A8, "Member 'Backpack_DragObject_UMG_C_OnDragEnter::Operation' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct Backpack_DragObject_UMG_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnMouseLeave) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnMouseLeave");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnMouseLeave) == 0x000070, "Wrong size on Backpack_DragObject_UMG_C_OnMouseLeave");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct Backpack_DragObject_UMG_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnMouseEnter) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnMouseEnter");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnMouseEnter) == 0x0000A8, "Wrong size on Backpack_DragObject_UMG_C_OnMouseEnter");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnDragCancelled
// 0x0078 (0x0078 - 0x0000)
struct Backpack_DragObject_UMG_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnDragCancelled) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnDragCancelled");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnDragCancelled) == 0x000078, "Wrong size on Backpack_DragObject_UMG_C_OnDragCancelled");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragCancelled, Operation) == 0x000070, "Member 'Backpack_DragObject_UMG_C_OnDragCancelled::Operation' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct Backpack_DragObject_UMG_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00B8)()
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnMouseButtonDown");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnMouseButtonDown) == 0x000218, "Wrong size on Backpack_DragObject_UMG_C_OnMouseButtonDown");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnDragDetected
// 0x00D0 (0x00D0 - 0x0000)
struct Backpack_DragObject_UMG_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnDragDetected) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnDragDetected");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnDragDetected) == 0x0000D0, "Wrong size on Backpack_DragObject_UMG_C_OnDragDetected");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, Operation) == 0x0000A8, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000B8, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, K2Node_DynamicCast_AsPlayer_BP) == 0x0000C0, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x0000C8, "Member 'Backpack_DragObject_UMG_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnMouseButtonDoubleClick
// 0x0218 (0x0218 - 0x0000)
struct Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick final
{
public:
	struct FGeometry                              InMyGeometry;                                      // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          InMouseEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00B8)()
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick) == 0x000218, "Wrong size on Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick, InMyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick::InMyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick, InMouseEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick::InMouseEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick, ReturnValue) == 0x0000A8, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick::ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'Backpack_DragObject_UMG_C_OnMouseButtonDoubleClick::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.UseObject
// 0x0050 (0x0050 - 0x0000)
struct Backpack_DragObject_UMG_C_UseObject final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_2;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Backpack_DragObject_UMG_C_UseObject) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_UseObject");
static_assert(sizeof(Backpack_DragObject_UMG_C_UseObject) == 0x000050, "Wrong size on Backpack_DragObject_UMG_C_UseObject");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, CallFunc_GetPlayerPawn_ReturnValue) == 0x000000, "Member 'Backpack_DragObject_UMG_C_UseObject::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_AsPlayer_BP) == 0x000008, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, CallFunc_PlayAnimation_ReturnValue) == 0x000018, "Member 'Backpack_DragObject_UMG_C_UseObject::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000020, "Member 'Backpack_DragObject_UMG_C_UseObject::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_AsPlayer_BP_1) == 0x000028, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, CallFunc_IsValid_ReturnValue) == 0x000031, "Member 'Backpack_DragObject_UMG_C_UseObject::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, CallFunc_GetPlayerPawn_ReturnValue_2) == 0x000038, "Member 'Backpack_DragObject_UMG_C_UseObject::CallFunc_GetPlayerPawn_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_AsPlayer_BP_2) == 0x000040, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_AsPlayer_BP_2' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_UseObject, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'Backpack_DragObject_UMG_C_UseObject::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.OnDrop
// 0x00F0 (0x00F0 - 0x0000)
struct Backpack_DragObject_UMG_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBackpack_DragObject_UMG_C*             K2Node_DynamicCast_AsBackpack_Drag_Object_UMG;     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack;                 // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DB[0x5];                                       // 0x00DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_OnDrop) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_OnDrop");
static_assert(sizeof(Backpack_DragObject_UMG_C_OnDrop) == 0x0000F0, "Wrong size on Backpack_DragObject_UMG_C_OnDrop");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, MyGeometry) == 0x000000, "Member 'Backpack_DragObject_UMG_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, PointerEvent) == 0x000038, "Member 'Backpack_DragObject_UMG_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, Operation) == 0x0000A8, "Member 'Backpack_DragObject_UMG_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, ReturnValue) == 0x0000B0, "Member 'Backpack_DragObject_UMG_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, K2Node_DynamicCast_AsBackpack_Drag_Object_UMG) == 0x0000B8, "Member 'Backpack_DragObject_UMG_C_OnDrop::K2Node_DynamicCast_AsBackpack_Drag_Object_UMG' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Backpack_DragObject_UMG_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, K2Node_DynamicCast_AsWBI_Backpack) == 0x0000C8, "Member 'Backpack_DragObject_UMG_C_OnDrop::K2Node_DynamicCast_AsWBI_Backpack' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'Backpack_DragObject_UMG_C_OnDrop::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x0000D9, "Member 'Backpack_DragObject_UMG_C_OnDrop::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, K2Node_SwitchEnum_CmpSuccess) == 0x0000DA, "Member 'Backpack_DragObject_UMG_C_OnDrop::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'Backpack_DragObject_UMG_C_OnDrop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Backpack_DragObject_UMG_C_OnDrop, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000E8, "Member 'Backpack_DragObject_UMG_C_OnDrop::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function Backpack_DragObject_UMG.Backpack_DragObject_UMG_C.创建UI
// 0x0008 (0x0008 - 0x0000)
struct Backpack_DragObject_UMG_C_创建UI final
{
public:
	class UWidget*                                创建的UI; // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Backpack_DragObject_UMG_C_创建UI) == 0x000008, "Wrong alignment on Backpack_DragObject_UMG_C_创建UI");
static_assert(sizeof(Backpack_DragObject_UMG_C_创建UI) == 0x000008, "Wrong size on Backpack_DragObject_UMG_C_创建UI");
static_assert(offsetof(Backpack_DragObject_UMG_C_创建UI, 创建的UI) == 0x000000, "Member 'Backpack_DragObject_UMG_C_创建UI::创建的UI' has a wrong offset!");

}

