#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Backpack_Details

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Backpack_Details.Backpack_Details_C
// 0x0030 (0x0290 - 0x0260)
class UBackpack_Details_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             名称; // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             描述; // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             类别;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsVisbility;                                       // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_Backpack_Details(int32 EntryPoint);
	void 设置文字(const class FText& 名称_0, const class FText& 类别_0, const class FText& 描述_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Backpack_Details_C">();
	}
	static class UBackpack_Details_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBackpack_Details_C>();
	}
};
static_assert(alignof(UBackpack_Details_C) == 0x000008, "Wrong alignment on UBackpack_Details_C");
static_assert(sizeof(UBackpack_Details_C) == 0x000290, "Wrong size on UBackpack_Details_C");
static_assert(offsetof(UBackpack_Details_C, UberGraphFrame) == 0x000260, "Member 'UBackpack_Details_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBackpack_Details_C, NewAnimation) == 0x000268, "Member 'UBackpack_Details_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UBackpack_Details_C, 名称) == 0x000270, "Member 'UBackpack_Details_C::名称' has a wrong offset!");
static_assert(offsetof(UBackpack_Details_C, 描述) == 0x000278, "Member 'UBackpack_Details_C::描述' has a wrong offset!");
static_assert(offsetof(UBackpack_Details_C, 类别) == 0x000280, "Member 'UBackpack_Details_C::类别' has a wrong offset!");
static_assert(offsetof(UBackpack_Details_C, IsVisbility) == 0x000288, "Member 'UBackpack_Details_C::IsVisbility' has a wrong offset!");

}

