#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BackroomQuestTips_UMG

#include "Basic.hpp"


namespace SDK::Params
{

// Function BackroomQuestTips_UMG.BackroomQuestTips_UMG_C.ExecuteUbergraph_BackroomQuestTips_UMG
// 0x00A0 (0x00A0 - 0x0000)
struct BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0010(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent________;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_QusetSystem;                    // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue_1;             // 0x0070(0x0018)()
	TScriptInterface<class IQuest_Interface_C>    K2Node_DynamicCast_AsQuest_Interface;              // 0x0088(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG) == 0x000008, "Wrong alignment on BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG");
static_assert(sizeof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG) == 0x0000A0, "Wrong size on BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, EntryPoint) == 0x000000, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, ___bool_IsClosed_Variable) == 0x000004, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, ___int_Variable) == 0x000008, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::___int_Variable' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, ___bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_CustomEvent_InText) == 0x000010, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_CustomEvent_Texture) == 0x000028, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_CustomEvent________) == 0x000038, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_CustomEvent________' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_CustomEvent_QusetSystem) == 0x000040, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_CustomEvent_QusetSystem' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x000048, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00006C, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, CallFunc_Conv_IntToText_ReturnValue_1) == 0x000070, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::CallFunc_Conv_IntToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_DynamicCast_AsQuest_Interface) == 0x000088, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_DynamicCast_AsQuest_Interface' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG, K2Node_DynamicCast_bSuccess) == 0x000098, "Member 'BackroomQuestTips_UMG_C_ExecuteUbergraph_BackroomQuestTips_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BackroomQuestTips_UMG.BackroomQuestTips_UMG_C.初始化计数任务
// 0x0010 (0x0010 - 0x0000)
struct BackroomQuestTips_UMG_C_初始化计数任务 final
{
public:
	int32                                         总共要完成几个; // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 QusetSystem_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(BackroomQuestTips_UMG_C_初始化计数任务) == 0x000008, "Wrong alignment on BackroomQuestTips_UMG_C_初始化计数任务");
static_assert(sizeof(BackroomQuestTips_UMG_C_初始化计数任务) == 0x000010, "Wrong size on BackroomQuestTips_UMG_C_初始化计数任务");
static_assert(offsetof(BackroomQuestTips_UMG_C_初始化计数任务, 总共要完成几个) == 0x000000, "Member 'BackroomQuestTips_UMG_C_初始化计数任务::总共要完成几个' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_初始化计数任务, QusetSystem_0) == 0x000008, "Member 'BackroomQuestTips_UMG_C_初始化计数任务::QusetSystem_0' has a wrong offset!");

// Function BackroomQuestTips_UMG.BackroomQuestTips_UMG_C.刷新任务系统
// 0x0020 (0x0020 - 0x0000)
struct BackroomQuestTips_UMG_C_刷新任务系统 final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Texture;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BackroomQuestTips_UMG_C_刷新任务系统) == 0x000008, "Wrong alignment on BackroomQuestTips_UMG_C_刷新任务系统");
static_assert(sizeof(BackroomQuestTips_UMG_C_刷新任务系统) == 0x000020, "Wrong size on BackroomQuestTips_UMG_C_刷新任务系统");
static_assert(offsetof(BackroomQuestTips_UMG_C_刷新任务系统, InText) == 0x000000, "Member 'BackroomQuestTips_UMG_C_刷新任务系统::InText' has a wrong offset!");
static_assert(offsetof(BackroomQuestTips_UMG_C_刷新任务系统, Texture) == 0x000018, "Member 'BackroomQuestTips_UMG_C_刷新任务系统::Texture' has a wrong offset!");

}

