#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boundary_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Boundary_BP.Boundary_BP_C.ExecuteUbergraph_Boundary_BP
// 0x01A8 (0x01A8 - 0x0000)
struct Boundary_BP_C_ExecuteUbergraph_Boundary_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0010(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00C0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	class APlayerSpawnPoint_BP_C*                 CallFunc_GetActorOfClass_ReturnValue;              // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19A[0x6];                                      // 0x019A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBoundaryHint_UMG_C*                    CallFunc_Create_ReturnValue;                       // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP) == 0x000008, "Wrong alignment on Boundary_BP_C_ExecuteUbergraph_Boundary_BP");
static_assert(sizeof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP) == 0x0001A8, "Wrong size on Boundary_BP_C_ExecuteUbergraph_Boundary_BP");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, EntryPoint) == 0x000000, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000010, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000098, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0000A0, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000A8, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000B0, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000B8, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000BC, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_SweepResult) == 0x0000C0, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000148, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherActor) == 0x000150, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherComp) == 0x000158, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000160, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_DynamicCast_AsPlayer_BP) == 0x000168, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_DynamicCast_bSuccess) == 0x000170, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_DynamicCast_AsPlayer_BP_1) == 0x000178, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, K2Node_DynamicCast_bSuccess_1) == 0x000180, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_K2_SetTimer_ReturnValue) == 0x000188, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_GetActorOfClass_ReturnValue) == 0x000190, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_IsValid_ReturnValue) == 0x000198, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_IsValid_ReturnValue_1) == 0x000199, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_ExecuteUbergraph_Boundary_BP, CallFunc_Create_ReturnValue) == 0x0001A0, "Member 'Boundary_BP_C_ExecuteUbergraph_Boundary_BP::CallFunc_Create_ReturnValue' has a wrong offset!");

// Function Boundary_BP.Boundary_BP_C.BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Boundary_BP.Boundary_BP_C.BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Boundary_BP_C_BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

}

