#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Boundary_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Boundary_BP.Boundary_BP_C
// 0x0028 (0x0248 - 0x0220)
class ABoundary_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPostProcessComponent*                  PostProcess;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoundaryHint_UMG_C*                    边界提示UMG; // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Boundary_BP(int32 EntryPoint);
	void 重新设置位置();
	void BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__边界_BP_Box_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Boundary_BP_C">();
	}
	static class ABoundary_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABoundary_BP_C>();
	}
};
static_assert(alignof(ABoundary_BP_C) == 0x000008, "Wrong alignment on ABoundary_BP_C");
static_assert(sizeof(ABoundary_BP_C) == 0x000248, "Wrong size on ABoundary_BP_C");
static_assert(offsetof(ABoundary_BP_C, UberGraphFrame) == 0x000220, "Member 'ABoundary_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABoundary_BP_C, PostProcess) == 0x000228, "Member 'ABoundary_BP_C::PostProcess' has a wrong offset!");
static_assert(offsetof(ABoundary_BP_C, Box) == 0x000230, "Member 'ABoundary_BP_C::Box' has a wrong offset!");
static_assert(offsetof(ABoundary_BP_C, DefaultSceneRoot) == 0x000238, "Member 'ABoundary_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABoundary_BP_C, 边界提示UMG) == 0x000240, "Member 'ABoundary_BP_C::边界提示UMG' has a wrong offset!");

}

