#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Bloodstain_Main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Bloodstain_Main.BP_Bloodstain_Main_C
// 0x0058 (0x0278 - 0x0220)
class ABP_Bloodstain_Main_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Plane;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Dissolve_Rate_C74AE9DE4796FBF5B3D929A2EA67A74E; // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_C74AE9DE4796FBF5B3D929A2EA67A74E; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Dissolving_Dissolve_Rate_CBD5B54442FA3C2AFBEBBE9D8EBDCF39; // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Dissolving__Direction_CBD5B54442FA3C2AFBEBBE9D8EBDCF39; // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Dissolving;                                        // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Material;                                          // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     Static_Material;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime;                                          // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Bloodstain_Main(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void Dissolving__UpdateFunc();
	void Dissolving__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Bloodstain_Main_C">();
	}
	static class ABP_Bloodstain_Main_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Bloodstain_Main_C>();
	}
};
static_assert(alignof(ABP_Bloodstain_Main_C) == 0x000008, "Wrong alignment on ABP_Bloodstain_Main_C");
static_assert(sizeof(ABP_Bloodstain_Main_C) == 0x000278, "Wrong size on ABP_Bloodstain_Main_C");
static_assert(offsetof(ABP_Bloodstain_Main_C, UberGraphFrame) == 0x000220, "Member 'ABP_Bloodstain_Main_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Decal) == 0x000228, "Member 'ABP_Bloodstain_Main_C::Decal' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Plane) == 0x000230, "Member 'ABP_Bloodstain_Main_C::Plane' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, DefaultSceneRoot) == 0x000238, "Member 'ABP_Bloodstain_Main_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Timeline_0_Dissolve_Rate_C74AE9DE4796FBF5B3D929A2EA67A74E) == 0x000240, "Member 'ABP_Bloodstain_Main_C::Timeline_0_Dissolve_Rate_C74AE9DE4796FBF5B3D929A2EA67A74E' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Timeline_0__Direction_C74AE9DE4796FBF5B3D929A2EA67A74E) == 0x000244, "Member 'ABP_Bloodstain_Main_C::Timeline_0__Direction_C74AE9DE4796FBF5B3D929A2EA67A74E' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Timeline_0) == 0x000248, "Member 'ABP_Bloodstain_Main_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Dissolving_Dissolve_Rate_CBD5B54442FA3C2AFBEBBE9D8EBDCF39) == 0x000250, "Member 'ABP_Bloodstain_Main_C::Dissolving_Dissolve_Rate_CBD5B54442FA3C2AFBEBBE9D8EBDCF39' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Dissolving__Direction_CBD5B54442FA3C2AFBEBBE9D8EBDCF39) == 0x000254, "Member 'ABP_Bloodstain_Main_C::Dissolving__Direction_CBD5B54442FA3C2AFBEBBE9D8EBDCF39' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Dissolving) == 0x000258, "Member 'ABP_Bloodstain_Main_C::Dissolving' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Material) == 0x000260, "Member 'ABP_Bloodstain_Main_C::Material' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, Static_Material) == 0x000268, "Member 'ABP_Bloodstain_Main_C::Static_Material' has a wrong offset!");
static_assert(offsetof(ABP_Bloodstain_Main_C, LifeTime) == 0x000270, "Member 'ABP_Bloodstain_Main_C::LifeTime' has a wrong offset!");

}

