#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_cp02

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_cp02.BP_cp02_C.ExecuteUbergraph_BP_cp02
// 0x03B0 (0x03B0 - 0x0000)
struct BP_cp02_C_ExecuteUbergraph_BP_cp02 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Player;                               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0034(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpTips_C*                          K2Node_DynamicCast_AsPick_Up_Tips;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_4;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x01BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BB[0x5];                                      // 0x01BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_3;                  // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C9[0x3];                                      // 0x01C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_4;                  // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Selection;                      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFuse_BP_C*                             K2Node_CustomEvent____;                            // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_5;                  // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuestTips_UMG_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0208(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UQuestTips_UMG_C*                       CallFunc_Array_Get_Item;                           // 0x0218(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_On;                             // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0x6];                                      // 0x0222(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Flashlight_Demo_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0228(0x0010)(ReferenceParm)
	class ABP_Flashlight_Demo_C*                  CallFunc_Array_Get_Item_1;                         // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Flashlight_Demo_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0240(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x7];                                      // 0x0251(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Flashlight_Demo_C*                  CallFunc_Array_Get_Item_2;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0268(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0284(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_285[0x3];                                      // 0x0285(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0288(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0310(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0328(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_6;                  // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_7;                  // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34A[0x6];                                      // 0x034A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips;        // 0x0358(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_8;                  // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_10;                    // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_As_____;                        // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_11;                    // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0381(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_382[0x6];                                      // 0x0382(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0388(0x0018)(HasGetValueTypeHash)
	class U查看电表_Tip_C* CallFunc_Create_ReturnValue;                       // 0x03A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_cp02_C_ExecuteUbergraph_BP_cp02) == 0x000008, "Wrong alignment on BP_cp02_C_ExecuteUbergraph_BP_cp02");
static_assert(sizeof(BP_cp02_C_ExecuteUbergraph_BP_cp02) == 0x0003B0, "Wrong size on BP_cp02_C_ExecuteUbergraph_BP_cp02");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, EntryPoint) == 0x000000, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP) == 0x000008, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_Event_Player) == 0x000018, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetPlayerController_ReturnValue) == 0x000020, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_1) == 0x000028, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000034, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0000BC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetActorOfClass_ReturnValue) == 0x0000C0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0000C8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPick_Up_Tips) == 0x0000D0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPick_Up_Tips' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_2) == 0x0000D8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000E0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, ___int_Variable) == 0x0000E8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Lerp_ReturnValue) == 0x0000EC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_MakeRotator_ReturnValue) == 0x0000F0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0000FC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetPlayerController_ReturnValue_2) == 0x000188, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetPlayerController_ReturnValue_3) == 0x000190, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_2) == 0x000198, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_3) == 0x0001A0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_PlayAnimation_ReturnValue) == 0x0001A8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetPlayerController_ReturnValue_4) == 0x0001B0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetPlayerController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess) == 0x0001B8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001B9, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess_2) == 0x0001BA, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_3) == 0x0001C0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_3' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_4) == 0x0001C8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Add_IntInt_ReturnValue) == 0x0001CC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_4) == 0x0001D0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_4' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_5) == 0x0001D8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_CustomEvent_Selection) == 0x0001DC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_CustomEvent_Selection' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_CustomEvent____) == 0x0001E0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_CustomEvent____' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchInteger_CmpSuccess) == 0x0001E8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0001EC, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0001F0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_5) == 0x0001F8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_5' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_6) == 0x000200, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000208, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Array_Get_Item) == 0x000218, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000220, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_CustomEvent_On) == 0x000221, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetAllActorsOfClass_OutActors) == 0x000228, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Array_Get_Item_1) == 0x000238, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000240, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_IsValid_ReturnValue) == 0x000250, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Array_Get_Item_2) == 0x000258, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_IsValid_ReturnValue_1) == 0x000260, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000268, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000270, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000278, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000280, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_bFromSweep) == 0x000284, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_SweepResult) == 0x000288, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000310, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherActor) == 0x000318, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherComp) == 0x000320, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000328, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_6) == 0x000330, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_6' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_7) == 0x000338, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_7) == 0x000340, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_7' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_8) == 0x000348, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess_3) == 0x000349, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000350, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips) == 0x000358, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_9) == 0x000360, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_AsPlayer_BP_8) == 0x000368, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_AsPlayer_BP_8' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_10) == 0x000370, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_10' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_As_____) == 0x000378, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_DynamicCast_bSuccess_11) == 0x000380, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_DynamicCast_bSuccess_11' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess_4) == 0x000381, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_InputActionEvent_Key) == 0x000388, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, CallFunc_Create_ReturnValue) == 0x0003A0, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_ExecuteUbergraph_BP_cp02, K2Node_SwitchEnum_CmpSuccess_5) == 0x0003A8, "Member 'BP_cp02_C_ExecuteUbergraph_BP_cp02::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_cp02_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.手电筒开关
// 0x0001 (0x0001 - 0x0000)
struct BP_cp02_C_手电筒开关 final
{
public:
	bool                                          ON;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_cp02_C_手电筒开关) == 0x000001, "Wrong alignment on BP_cp02_C_手电筒开关");
static_assert(sizeof(BP_cp02_C_手电筒开关) == 0x000001, "Wrong size on BP_cp02_C_手电筒开关");
static_assert(offsetof(BP_cp02_C_手电筒开关, ON) == 0x000000, "Member 'BP_cp02_C_手电筒开关::ON' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.保险丝位置提示
// 0x0010 (0x0010 - 0x0000)
struct BP_cp02_C_保险丝位置提示 final
{
public:
	int32                                         Selection;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFuse_BP_C*                             保险丝_0;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_cp02_C_保险丝位置提示) == 0x000008, "Wrong alignment on BP_cp02_C_保险丝位置提示");
static_assert(sizeof(BP_cp02_C_保险丝位置提示) == 0x000010, "Wrong size on BP_cp02_C_保险丝位置提示");
static_assert(offsetof(BP_cp02_C_保险丝位置提示, Selection) == 0x000000, "Member 'BP_cp02_C_保险丝位置提示::Selection' has a wrong offset!");
static_assert(offsetof(BP_cp02_C_保险丝位置提示, 保险丝_0) == 0x000008, "Member 'BP_cp02_C_保险丝位置提示::保险丝_0' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.PlayerInteration
// 0x0008 (0x0008 - 0x0000)
struct BP_cp02_C_PlayerInteration final
{
public:
	class AActor*                                 Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_cp02_C_PlayerInteration) == 0x000008, "Wrong alignment on BP_cp02_C_PlayerInteration");
static_assert(sizeof(BP_cp02_C_PlayerInteration) == 0x000008, "Wrong size on BP_cp02_C_PlayerInteration");
static_assert(offsetof(BP_cp02_C_PlayerInteration, Player_0) == 0x000000, "Member 'BP_cp02_C_PlayerInteration::Player_0' has a wrong offset!");

// Function BP_cp02.BP_cp02_C.InpActEvt_PlayerInteration_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0");
static_assert(sizeof(BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0");
static_assert(offsetof(BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'BP_cp02_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0::Key' has a wrong offset!");

}

