#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Entity_Pawn

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Entity_Pawn.BP_Entity_Pawn_C.ExecuteUbergraph_BP_Entity_Pawn
// 0x0610 (0x0610 - 0x0000)
struct BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x1];                                       // 0x0013(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ___object_Variable;                                // 0x0098(0x0010)(ConstParm, ReferenceParm)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x00A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ___object_Variable_1;                              // 0x00C0(0x0010)(ConstParm, ReferenceParm)
	class UWBP_HitCircle_C*                       CallFunc_Create_ReturnValue;                       // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x00F0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0104(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x3];                                      // 0x0121(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0124(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isMelee_;                             // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x01D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x01E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x01EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EB[0x1];                                      // 0x01EB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x01EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x01F8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0204(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0214(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue_1;            // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0229(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue_2;            // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0250(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_251[0x3];                                      // 0x0251(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Montage_Play_ReturnValue;                 // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0258(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0264(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x0270(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x027C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0288(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue_3;            // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x0320(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0329(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x032C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0334(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x0340(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x034C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x0378(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x0388(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x038C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x0390(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x0394(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x03AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVagrant_BP_C*                          K2Node_DynamicCast_AsVagrant_BP;                   // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetValueAsBool_ReturnValue;               // 0x03C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C2[0x6];                                      // 0x03C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x03D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D2[0x2];                                      // 0x03D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x03D4(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue_4;            // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0400(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x040C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit_1;               // 0x0418(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue_1;          // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x04A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x04A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A3[0x1];                                      // 0x04A3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x04A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x04A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x04AC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x04B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x04C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4DC[0x4];                                      // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x04E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x04F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x04F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x050C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0518(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_524[0x4];                                      // 0x0524(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0528(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0530(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_531[0x3];                                      // 0x0531(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x0534(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0538(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_539[0x3];                                      // 0x0539(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0548(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x0550(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0560(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0578(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_2;                // 0x0598(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEntity_Anim_C*                         K2Node_DynamicCast_AsEntity_Anim;                  // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_3;                // 0x05C0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x05C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5C9[0x7];                                      // 0x05C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x05D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x05E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E2[0x6];                                      // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerStateSetting_C*                  K2Node_DynamicCast_AsPlayer_State_Setting;         // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x05F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x05FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5FB[0x1];                                      // 0x05FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_4;         // 0x0608(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x060C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn) == 0x000008, "Wrong alignment on BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn");
static_assert(sizeof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn) == 0x000610, "Wrong size on BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, EntryPoint) == 0x000000, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_SetTimer_ReturnValue) == 0x000008, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, ___byte_Variable) == 0x000010, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bBlockingHit) == 0x000011, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bInitialOverlap) == 0x000012, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Time) == 0x000014, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Distance) == 0x000018, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Location) == 0x00001C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ImpactPoint) == 0x000028, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Normal) == 0x000034, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ImpactNormal) == 0x000040, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_PhysMat) == 0x000050, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitActor) == 0x000058, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitComponent) == 0x000060, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitBoneName) == 0x000068, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitItem) == 0x000070, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ElementIndex) == 0x000074, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_FaceIndex) == 0x000078, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_TraceStart) == 0x00007C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_TraceEnd) == 0x000088, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, ___object_Variable) == 0x000098, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x0000A8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x0000B8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, ___object_Variable_1) == 0x0000C0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Create_ReturnValue) == 0x0000D0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAIController_ReturnValue) == 0x0000D8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000E0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_IsValid_ReturnValue) == 0x0000EC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_SetTimer_ReturnValue_1) == 0x0000F0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_SetTimer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000104, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000110, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000118, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_IsValid_ReturnValue_1) == 0x000120, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_Event_Hit) == 0x000124, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_Event_Damage) == 0x0001AC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_Event_isMelee_) == 0x0001B0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_Event_isMelee_' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetActorForwardVector_ReturnValue) == 0x0001B4, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x0001C0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakVector_X) == 0x0001CC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakVector_Y) == 0x0001D0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakVector_Z) == 0x0001D4, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001D8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_MakeVector_ReturnValue) == 0x0001DC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, ___bool_Has_Been_Initd_Variable) == 0x0001E8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, ___bool_IsClosed_Variable) == 0x0001E9, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_CustomEvent_MovementResult_1) == 0x0001EA, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0001EC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x0001F8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000204, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_VSize_ReturnValue) == 0x000210, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000214, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000218, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAIController_ReturnValue_1) == 0x000220, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAIController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000228, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_CustomEvent_MovementResult) == 0x000229, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x00022C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_MakeLiteralName_ReturnValue) == 0x000230, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAIController_ReturnValue_2) == 0x000238, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAIController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetBlackboard_ReturnValue) == 0x000240, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAnimInstance_ReturnValue) == 0x000248, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000250, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Montage_Play_ReturnValue) == 0x000254, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Montage_Play_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_K2_GetActorLocation_ReturnValue_4) == 0x000258, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_K2_GetActorLocation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetActorForwardVector_ReturnValue_1) == 0x000264, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetActorForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x000270, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Add_VectorVector_ReturnValue) == 0x00027C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_SphereTraceSingle_OutHit) == 0x000288, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_SphereTraceSingle_ReturnValue) == 0x000310, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAIController_ReturnValue_3) == 0x000318, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAIController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetBlackboard_ReturnValue_1) == 0x000320, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bBlockingHit_1) == 0x000328, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bBlockingHit_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bInitialOverlap_1) == 0x000329, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bInitialOverlap_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Time_1) == 0x00032C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Time_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Distance_1) == 0x000330, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Distance_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Location_1) == 0x000334, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Location_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ImpactPoint_1) == 0x000340, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ImpactPoint_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Normal_1) == 0x00034C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Normal_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ImpactNormal_1) == 0x000358, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ImpactNormal_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_PhysMat_1) == 0x000368, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_PhysMat_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitActor_1) == 0x000370, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitActor_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitComponent_1) == 0x000378, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitBoneName_1) == 0x000380, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitBoneName_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_HitItem_1) == 0x000388, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_HitItem_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_ElementIndex_1) == 0x00038C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_ElementIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_FaceIndex_1) == 0x000390, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_FaceIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_TraceStart_1) == 0x000394, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_TraceStart_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_TraceEnd_1) == 0x0003A0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_TraceEnd_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_MakeLiteralName_ReturnValue_1) == 0x0003AC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_DynamicCast_AsVagrant_BP) == 0x0003B8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_DynamicCast_AsVagrant_BP' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_DynamicCast_bSuccess) == 0x0003C0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetValueAsBool_ReturnValue) == 0x0003C1, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetValueAsBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_DynamicCast_AsPlayer_BP) == 0x0003C8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_DynamicCast_bSuccess_1) == 0x0003D0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0003D1, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, K2Node_CreateDelegate_OutputDelegate) == 0x0003D4, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetAIController_ReturnValue_4) == 0x0003E8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetAIController_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Conv_StringToName_ReturnValue) == 0x0003F0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_Conv_StringToName_ReturnValue_1) == 0x0003F8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetSocketLocation_ReturnValue) == 0x000400, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_GetSocketLocation_ReturnValue_1) == 0x00040C, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_GetSocketLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_SphereTraceSingle_OutHit_1) == 0x000418, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_SphereTraceSingle_OutHit_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_SphereTraceSingle_ReturnValue_1) == 0x0004A0, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_SphereTraceSingle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bBlockingHit_2) == 0x0004A1, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bBlockingHit_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_bInitialOverlap_2) == 0x0004A2, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_bInitialOverlap_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Time_2) == 0x0004A4, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Time_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Distance_2) == 0x0004A8, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Distance_2' has a wrong offset!");
static_assert(offsetof(BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn, CallFunc_BreakHitResult_Location_2) == 0x0004AC, "Member 'BP_Entity_Pawn_C_ExecuteUbergraph_BP_Entity_Pawn::CallFunc_BreakHitResult_Location_2' has a wrong offset!");
