#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Flashlight_Demo

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Flashlight_Demo.BP_Flashlight_Demo_C.ExecuteUbergraph_BP_Flashlight_Demo
// 0x0004 (0x0004 - 0x0000)
struct BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo) == 0x000004, "Wrong alignment on BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo");
static_assert(sizeof(BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo) == 0x000004, "Wrong size on BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo");
static_assert(offsetof(BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo, EntryPoint) == 0x000000, "Member 'BP_Flashlight_Demo_C_ExecuteUbergraph_BP_Flashlight_Demo::EntryPoint' has a wrong offset!");

// Function BP_Flashlight_Demo.BP_Flashlight_Demo_C.UserConstructionScript
// 0x0080 (0x0080 - 0x0000)
struct BP_Flashlight_Demo_C_UserConstructionScript final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue;      // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_ColorToLinearColor_ReturnValue_1;    // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_LinearColorToVector_ReturnValue;     // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	class USpotLightComponent*                    CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Flashlight_Demo_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_Flashlight_Demo_C_UserConstructionScript");
static_assert(sizeof(BP_Flashlight_Demo_C_UserConstructionScript) == 0x000080, "Wrong size on BP_Flashlight_Demo_C_UserConstructionScript");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue) == 0x000004, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_Conv_ColorToLinearColor_ReturnValue_1) == 0x000014, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_Conv_ColorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_Conv_LinearColorToVector_ReturnValue) == 0x000024, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_Conv_LinearColorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000070, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_UserConstructionScript, CallFunc_SetStaticMesh_ReturnValue) == 0x000071, "Member 'BP_Flashlight_Demo_C_UserConstructionScript::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");

// Function BP_Flashlight_Demo.BP_Flashlight_Demo_C.Set Intensity
// 0x000C (0x000C - 0x0000)
struct BP_Flashlight_Demo_C_Set_Intensity final
{
public:
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Flashlight_Demo_C_Set_Intensity) == 0x000004, "Wrong alignment on BP_Flashlight_Demo_C_Set_Intensity");
static_assert(sizeof(BP_Flashlight_Demo_C_Set_Intensity) == 0x00000C, "Wrong size on BP_Flashlight_Demo_C_Set_Intensity");
static_assert(offsetof(BP_Flashlight_Demo_C_Set_Intensity, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000000, "Member 'BP_Flashlight_Demo_C_Set_Intensity::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_Set_Intensity, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000004, "Member 'BP_Flashlight_Demo_C_Set_Intensity::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Flashlight_Demo_C_Set_Intensity, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000008, "Member 'BP_Flashlight_Demo_C_Set_Intensity::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

}

