#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteriorWallC_600_02

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_InteriorWallC_600_02.BP_InteriorWallC_600_02_C
// 0x0040 (0x0260 - 0x0220)
class ABP_InteriorWallC_600_02_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_CornerDamageA_06;                               // 0x0220(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CornerDamageA_05;                               // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CornerDamageA_04;                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CornerDamageA_03;                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CornerDamageA_02;                               // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CornerDamageA_01;                               // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_InteriorWallC_300_01;                           // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_InteriorWallC_600_02_C">();
	}
	static class ABP_InteriorWallC_600_02_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_InteriorWallC_600_02_C>();
	}
};
static_assert(alignof(ABP_InteriorWallC_600_02_C) == 0x000008, "Wrong alignment on ABP_InteriorWallC_600_02_C");
static_assert(sizeof(ABP_InteriorWallC_600_02_C) == 0x000260, "Wrong size on ABP_InteriorWallC_600_02_C");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_06) == 0x000220, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_06' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_05) == 0x000228, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_05' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_04) == 0x000230, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_04' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_03) == 0x000238, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_03' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_02) == 0x000240, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_02' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_CornerDamageA_01) == 0x000248, "Member 'ABP_InteriorWallC_600_02_C::SM_CornerDamageA_01' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, SM_InteriorWallC_300_01) == 0x000250, "Member 'ABP_InteriorWallC_600_02_C::SM_InteriorWallC_300_01' has a wrong offset!");
static_assert(offsetof(ABP_InteriorWallC_600_02_C, DefaultSceneRoot) == 0x000258, "Member 'ABP_InteriorWallC_600_02_C::DefaultSceneRoot' has a wrong offset!");

}

