#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Splater_Preset_4

#include "Basic.hpp"

#include "Niagara_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_Splater_Preset_4.BP_Splater_Preset_4_C.ExecuteUbergraph_BP_Splater_Preset_4
// 0x0190 (0x0190 - 0x0000)
struct BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FBasicParticleData>             K2Node_Event_Data;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class UNiagaraSystem*                         K2Node_Event_NiagaraSystem;                        // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBasicParticleData                     CallFunc_Array_Get_Item;                           // 0x0020(0x001C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromZ_ReturnValue;                 // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_Array_Get_Item_1;                         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x007C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0xC];                                       // 0x00A4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Bloodstain_Main_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0108(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4) == 0x000010, "Wrong alignment on BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4");
static_assert(sizeof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4) == 0x000190, "Wrong size on BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, EntryPoint) == 0x000000, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, ___int_Array_Index_Variable) == 0x000004, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, K2Node_Event_Data) == 0x000008, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::K2Node_Event_Data' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, K2Node_Event_NiagaraSystem) == 0x000018, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::K2Node_Event_NiagaraSystem' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Array_Length_ReturnValue) == 0x00003C, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_MakeRotFromZ_ReturnValue) == 0x000040, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_MakeRotFromZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Array_Length_ReturnValue_1) == 0x00004C, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_FClamp_ReturnValue) == 0x000050, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Subtract_IntInt_ReturnValue) == 0x000054, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_RandomIntegerInRange_ReturnValue) == 0x00005C, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Array_Get_Item_1) == 0x000060, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000068, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_RandomFloatInRange_ReturnValue) == 0x000070, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000074, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, ___int_Loop_Counter_Variable) == 0x000078, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Less_IntInt_ReturnValue) == 0x00007C, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Add_IntInt_ReturnValue) == 0x000080, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Add_FloatFloat_ReturnValue) == 0x000084, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_FClamp_ReturnValue_1) == 0x000088, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00008C, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_FClamp_ReturnValue_2) == 0x000090, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000094, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000098, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_MakeTransform_ReturnValue) == 0x0000B0, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E8, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_BreakRotator_Roll) == 0x0000F0, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_BreakRotator_Pitch) == 0x0000F4, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_BreakRotator_Yaw) == 0x0000F8, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_MakeRotator_ReturnValue) == 0x0000FC, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000108, "Member 'BP_Splater_Preset_4_C_ExecuteUbergraph_BP_Splater_Preset_4::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");

// Function BP_Splater_Preset_4.BP_Splater_Preset_4_C.ReceiveParticleData
// 0x0018 (0x0018 - 0x0000)
struct BP_Splater_Preset_4_C_ReceiveParticleData final
{
public:
	TArray<struct FBasicParticleData>             Data_0;                                            // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UNiagaraSystem*                         NiagaraSystem;                                     // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Splater_Preset_4_C_ReceiveParticleData) == 0x000008, "Wrong alignment on BP_Splater_Preset_4_C_ReceiveParticleData");
static_assert(sizeof(BP_Splater_Preset_4_C_ReceiveParticleData) == 0x000018, "Wrong size on BP_Splater_Preset_4_C_ReceiveParticleData");
static_assert(offsetof(BP_Splater_Preset_4_C_ReceiveParticleData, Data_0) == 0x000000, "Member 'BP_Splater_Preset_4_C_ReceiveParticleData::Data_0' has a wrong offset!");
static_assert(offsetof(BP_Splater_Preset_4_C_ReceiveParticleData, NiagaraSystem) == 0x000010, "Member 'BP_Splater_Preset_4_C_ReceiveParticleData::NiagaraSystem' has a wrong offset!");

}

