#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletCase_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletCase_BP.BulletCase_BP_C
// 0x0028 (0x0248 - 0x0220)
class ABulletCase_BP_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Min;                                               // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max;                                               // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BulletCase_BP(int32 EntryPoint);
	void BndEvt__StaticMesh_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletCase_BP_C">();
	}
	static class ABulletCase_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletCase_BP_C>();
	}
};
static_assert(alignof(ABulletCase_BP_C) == 0x000008, "Wrong alignment on ABulletCase_BP_C");
static_assert(sizeof(ABulletCase_BP_C) == 0x000248, "Wrong size on ABulletCase_BP_C");
static_assert(offsetof(ABulletCase_BP_C, UberGraphFrame) == 0x000220, "Member 'ABulletCase_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletCase_BP_C, StaticMesh) == 0x000228, "Member 'ABulletCase_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(ABulletCase_BP_C, Scene) == 0x000230, "Member 'ABulletCase_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(ABulletCase_BP_C, ProjectileMovement) == 0x000238, "Member 'ABulletCase_BP_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABulletCase_BP_C, Min) == 0x000240, "Member 'ABulletCase_BP_C::Min' has a wrong offset!");
static_assert(offsetof(ABulletCase_BP_C, Max) == 0x000244, "Member 'ABulletCase_BP_C::Max' has a wrong offset!");

}

