#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BulletMaster_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BulletMaster_BP.BulletMaster_BP_C
// 0x0028 (0x0248 - 0x0220)
class ABulletMaster_BP_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         普通伤害; // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BulletMaster_BP(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void HitSurface(const struct FHitResult& Hit);
	void 击中静态物体(const struct FHitResult& Hit);
	void 施加冲量(class UPrimitiveComponent* InputObject, float 力量, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BulletMaster_BP_C">();
	}
	static class ABulletMaster_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABulletMaster_BP_C>();
	}
};
static_assert(alignof(ABulletMaster_BP_C) == 0x000008, "Wrong alignment on ABulletMaster_BP_C");
static_assert(sizeof(ABulletMaster_BP_C) == 0x000248, "Wrong size on ABulletMaster_BP_C");
static_assert(offsetof(ABulletMaster_BP_C, UberGraphFrame) == 0x000220, "Member 'ABulletMaster_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABulletMaster_BP_C, ParticleSystem) == 0x000228, "Member 'ABulletMaster_BP_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABulletMaster_BP_C, Sphere) == 0x000230, "Member 'ABulletMaster_BP_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABulletMaster_BP_C, ProjectileMovement) == 0x000238, "Member 'ABulletMaster_BP_C::ProjectileMovement' has a wrong offset!");
static_assert(offsetof(ABulletMaster_BP_C, 普通伤害) == 0x000240, "Member 'ABulletMaster_BP_C::普通伤害' has a wrong offset!");

}

