#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CharacterModel_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass CharacterSelectAnim.CharacterSelectAnim_C
// 0x3740 (0x3A00 - 0x02C0)
class UCharacterSelectAnim_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2B8[0x8];                                      // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x02F8(0x00B0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x03A8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x03C8(0x0020)()
	uint8                                         Pad_3E8[0x8];                                      // 0x03E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_17;                           // 0x03F0(0x0190)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0580(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x0600(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_16;                           // 0x0620(0x0190)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x07B0(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x0830(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_15;                           // 0x0850(0x0190)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x09E0(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x0A60(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_14;                           // 0x0A80(0x0190)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x0C10(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_13;                           // 0x0C30(0x0190)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0DC0(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0E40(0x00C0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_16;                       // 0x0F00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_15;                       // 0x1008(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_14;                       // 0x1110(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_13;                       // 0x1218(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x1320(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x1340(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x1360(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_12;                       // 0x13E0(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x14E8(0x0080)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_11;                       // 0x1568(0x0108)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x1670(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_10;                       // 0x1690(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x1798(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x17B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1800(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x1880(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_12;                           // 0x18A0(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_11;                           // 0x1A30(0x0190)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x1BC0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x1CC8(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1DD0(0x0080)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_10;                           // 0x1E50(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_9;                            // 0x1FE0(0x0190)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x2170(0x0020)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_8;                            // 0x2190(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_7;                            // 0x2320(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_6;                            // 0x24B0(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_5;                            // 0x2640(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_4;                            // 0x27D0(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_3;                            // 0x2960(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_2;                            // 0x2AF0(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik_1;                            // 0x2C80(0x0190)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x2E10(0x0190)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x2FA0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x30A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x31B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x32B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x33C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x34C8(0x0108)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x35D0(0x0080)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x3650(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3670(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x3690(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x3798(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x38A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x38E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3968(0x0080)()
	bool                                          NoWeapon_;                                         // 0x39E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39E9[0x3];                                     // 0x39E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Yaw;                                               // 0x39EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x39F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterModel                               CharacterModel;                                    // 0x39F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CharacterSelectAnim(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* AnimGraph_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CharacterSelectAnim_C">();
	}
	static class UCharacterSelectAnim_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterSelectAnim_C>();
	}
};
static_assert(alignof(UCharacterSelectAnim_C) == 0x000010, "Wrong alignment on UCharacterSelectAnim_C");
static_assert(sizeof(UCharacterSelectAnim_C) == 0x003A00, "Wrong size on UCharacterSelectAnim_C");
static_assert(offsetof(UCharacterSelectAnim_C, UberGraphFrame) == 0x0002C0, "Member 'UCharacterSelectAnim_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_BlendListByEnum) == 0x0002F8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_6) == 0x0003A8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_6' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_6) == 0x0003C8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_6' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_17) == 0x0003F0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_17' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_10) == 0x000580, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_10' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_5) == 0x000600, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_5' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_16) == 0x000620, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_16' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_9) == 0x0007B0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_9' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_5) == 0x000830, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_5' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_15) == 0x000850, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_15' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_8) == 0x0009E0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_8' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_4) == 0x000A60, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_4' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_14) == 0x000A80, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_14' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_4) == 0x000C10, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_4' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_13) == 0x000C30, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_13' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_7) == 0x000DC0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_7' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LayeredBoneBlend) == 0x000E40, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LayeredBoneBlend' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_16) == 0x000F00, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_16' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_15) == 0x001008, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_15' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_14) == 0x001110, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_14' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_13) == 0x001218, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_13' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_3) == 0x001320, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_3' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_3) == 0x001340, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_3' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_6) == 0x001360, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_6' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_12) == 0x0013E0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_12' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_5) == 0x0014E8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_5' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_11) == 0x001568, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_11' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_2) == 0x001670, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_2' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_10) == 0x001690, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_10' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_2) == 0x001798, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_2' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Slot_1) == 0x0017B8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Slot_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_4) == 0x001800, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_4' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace_1) == 0x001880, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_12) == 0x0018A0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_12' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_11) == 0x001A30, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_11' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_9) == 0x001BC0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_8) == 0x001CC8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_3) == 0x001DD0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_3' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_10) == 0x001E50, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_10' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_9) == 0x001FE0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_9' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x002170, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_8) == 0x002190, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_8' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_7) == 0x002320, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_7' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_6) == 0x0024B0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_6' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_5) == 0x002640, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_5' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_4) == 0x0027D0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_4' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_3) == 0x002960, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_3' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_2) == 0x002AF0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_2' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik_1) == 0x002C80, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Fabrik) == 0x002E10, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Fabrik' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_7) == 0x002FA0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_6) == 0x0030A8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_5) == 0x0031B0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_4) == 0x0032B8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_3) == 0x0033C0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_2) == 0x0034C8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_2) == 0x0035D0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_2' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_LocalToComponentSpace) == 0x003650, "Member 'UCharacterSelectAnim_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ComponentToLocalSpace) == 0x003670, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone_1) == 0x003690, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_ModifyBone) == 0x003798, "Member 'UCharacterSelectAnim_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_Slot) == 0x0038A0, "Member 'UCharacterSelectAnim_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer_1) == 0x0038E8, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, AnimGraphNode_SequencePlayer) == 0x003968, "Member 'UCharacterSelectAnim_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, NoWeapon_) == 0x0039E8, "Member 'UCharacterSelectAnim_C::NoWeapon_' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, Yaw) == 0x0039EC, "Member 'UCharacterSelectAnim_C::Yaw' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, Pitch) == 0x0039F0, "Member 'UCharacterSelectAnim_C::Pitch' has a wrong offset!");
static_assert(offsetof(UCharacterSelectAnim_C, CharacterModel) == 0x0039F4, "Member 'UCharacterSelectAnim_C::CharacterModel' has a wrong offset!");

}

