#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CharacterSelectAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CharacterSelectAnim.CharacterSelectAnim_C.ExecuteUbergraph_CharacterSelectAnim
// 0x0004 (0x0004 - 0x0000)
struct CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim) == 0x000004, "Wrong alignment on CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim");
static_assert(sizeof(CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim) == 0x000004, "Wrong size on CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim");
static_assert(offsetof(CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim, EntryPoint) == 0x000000, "Member 'CharacterSelectAnim_C_ExecuteUbergraph_CharacterSelectAnim::EntryPoint' has a wrong offset!");

// Function CharacterSelectAnim.CharacterSelectAnim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct CharacterSelectAnim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(CharacterSelectAnim_C_AnimGraph) == 0x000008, "Wrong alignment on CharacterSelectAnim_C_AnimGraph");
static_assert(sizeof(CharacterSelectAnim_C_AnimGraph) == 0x000010, "Wrong size on CharacterSelectAnim_C_AnimGraph");
static_assert(offsetof(CharacterSelectAnim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'CharacterSelectAnim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

