#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChasoPlayer

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ChasoPlayer.ChasoPlayer_C.ExecuteUbergraph_ChasoPlayer
// 0x0088 (0x0088 - 0x0000)
struct ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_AIController_C*                 K2Node_DynamicCast_AsZombie_AIController;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer) == 0x000008, "Wrong alignment on ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer");
static_assert(sizeof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer) == 0x000088, "Wrong size on ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, EntryPoint) == 0x000000, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_CustomEvent_MovementResult_1) == 0x000004, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_CustomEvent_MovementResult) == 0x000018, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x00001C, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, ___byte_Variable) == 0x00002C, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::___byte_Variable' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_MakeLiteralName_ReturnValue) == 0x000030, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_SwitchEnum_CmpSuccess) == 0x000038, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_Event_OwnerController) == 0x000040, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_Event_ControlledPawn) == 0x000048, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_DynamicCast_AsZombie_AIController) == 0x000050, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_DynamicCast_AsZombie_AIController' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_GetBlackboard_ReturnValue) == 0x000060, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000068, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000074, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000078, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer, CallFunc_IsValid_ReturnValue) == 0x000080, "Member 'ChasoPlayer_C_ExecuteUbergraph_ChasoPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function ChasoPlayer.ChasoPlayer_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct ChasoPlayer_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChasoPlayer_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on ChasoPlayer_C_ReceiveExecuteAI");
static_assert(sizeof(ChasoPlayer_C_ReceiveExecuteAI) == 0x000010, "Wrong size on ChasoPlayer_C_ReceiveExecuteAI");
static_assert(offsetof(ChasoPlayer_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'ChasoPlayer_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(ChasoPlayer_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'ChasoPlayer_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function ChasoPlayer.ChasoPlayer_C.OnSuccess_D71D87724551652EE8309BBB469345F1
// 0x0001 (0x0001 - 0x0000)
struct ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1) == 0x000001, "Wrong alignment on ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1");
static_assert(sizeof(ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1) == 0x000001, "Wrong size on ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1");
static_assert(offsetof(ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1, MovementResult) == 0x000000, "Member 'ChasoPlayer_C_OnSuccess_D71D87724551652EE8309BBB469345F1::MovementResult' has a wrong offset!");

// Function ChasoPlayer.ChasoPlayer_C.OnFail_D71D87724551652EE8309BBB469345F1
// 0x0001 (0x0001 - 0x0000)
struct ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1) == 0x000001, "Wrong alignment on ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1");
static_assert(sizeof(ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1) == 0x000001, "Wrong size on ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1");
static_assert(offsetof(ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1, MovementResult) == 0x000000, "Member 'ChasoPlayer_C_OnFail_D71D87724551652EE8309BBB469345F1::MovementResult' has a wrong offset!");

}

