#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChineseAlleyQuest_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function ChineseAlleyQuest_BP.ChineseAlleyQuest_BP_C.ExecuteUbergraph_ChineseAlleyQuest_BP
// 0x0200 (0x0200 - 0x0000)
struct ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombieBuilder_BP_C*                    CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UChineseZombieBloodBar_UMG_C*           CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestTips_UMG_C*                       CallFunc_Create_ReturnValue_1;                     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         ___int_Array_Index_Variable;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0038(0x0010)(ReferenceParm)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocation_BP_C*                         K2Node_DynamicCast_AsLocation_BP;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UInGame_Umg_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayer_BP_C*                           CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGame_Umg_C*                          CallFunc_Array_Get_Item_1;                         // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AChinese_Vampire_BP_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AChinese_Vampire_BP_C*                  CallFunc_GetActorOfClass_ReturnValue_2;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestTips_UMG_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x00E8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UQuestTips_UMG_C*                       CallFunc_Array_Get_Item_2;                         // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UInGame_Umg_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets_2;      // 0x0100(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UInGame_Umg_C*                          CallFunc_Array_Get_Item_3;                         // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestTips_UMG_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_3;      // 0x0118(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UQuestTips_UMG_C*                       CallFunc_Array_Get_Item_4;                         // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_138[0x8];                                      // 0x0138(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0140(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_4;            // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_5;            // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestTips_UMG_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets_4;      // 0x0198(0x0010)(ReferenceParm, ContainsInstancedReference)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_6;            // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestTips_UMG_C*                       CallFunc_Array_Get_Item_5;                         // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9[0x3];                                      // 0x01B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x01BC(0x0014)(NoDestructor)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F1[0x7];                                      // 0x01F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP) == 0x000010, "Wrong alignment on ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP");
static_assert(sizeof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP) == 0x000200, "Wrong size on ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, EntryPoint) == 0x000000, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Create_ReturnValue) == 0x000010, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Create_ReturnValue_1) == 0x000018, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, ___int_Array_Index_Variable) == 0x000030, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000034, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Add_ByteByte_ReturnValue) == 0x000035, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllActorsWithTag_OutActors) == 0x000038, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetValidValue_ReturnValue) == 0x000048, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item) == 0x000050, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_DynamicCast_AsLocation_BP) == 0x000058, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_DynamicCast_AsLocation_BP' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Length_ReturnValue) == 0x000064, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000068, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000078, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item_1) == 0x000080, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, ___int_Loop_Counter_Variable) == 0x000088, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Less_IntInt_ReturnValue) == 0x0000C8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0000D8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_2) == 0x0000E0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x0000E8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item_2) == 0x0000F8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_2) == 0x000100, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_2' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item_3) == 0x000110, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_3) == 0x000118, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_3' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item_4) == 0x000128, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_3) == 0x000130, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_MakeTransform_ReturnValue_1) == 0x000140, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000170, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000178, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000180, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_4) == 0x000188, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_5) == 0x000190, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets_4) == 0x000198, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets_4' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetActorOfClass_ReturnValue_6) == 0x0001A8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetActorOfClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_Array_Get_Item_5) == 0x0001B0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue) == 0x0001B8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_MakeStruct_MovieSceneSequencePlaybackSettings) == 0x0001BC, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_MakeStruct_MovieSceneSequencePlaybackSettings' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_CreateLevelSequencePlayer_OutActor) == 0x0001D0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_CreateLevelSequencePlayer_OutActor' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_CreateLevelSequencePlayer_ReturnValue) == 0x0001D8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_CreateLevelSequencePlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetGameInstance_ReturnValue) == 0x0001E0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_DynamicCast_AsMy_Game_Instance) == 0x0001E8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_DynamicCast_AsMy_Game_Instance' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, K2Node_DynamicCast_bSuccess_1) == 0x0001F0, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001F8, "Member 'ChineseAlleyQuest_BP_C_ExecuteUbergraph_ChineseAlleyQuest_BP::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");

}

