#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Clip_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Clip_Master.Clip_Master_C
// 0x0020 (0x0240 - 0x0220)
class AClip_Master_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           As_Player_BP;                                      // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Clip_Master(int32 EntryPoint);
	void 弹夹分离();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Clip_Master_C">();
	}
	static class AClip_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AClip_Master_C>();
	}
};
static_assert(alignof(AClip_Master_C) == 0x000008, "Wrong alignment on AClip_Master_C");
static_assert(sizeof(AClip_Master_C) == 0x000240, "Wrong size on AClip_Master_C");
static_assert(offsetof(AClip_Master_C, UberGraphFrame) == 0x000220, "Member 'AClip_Master_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AClip_Master_C, SkeletalMesh) == 0x000228, "Member 'AClip_Master_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AClip_Master_C, DefaultSceneRoot) == 0x000230, "Member 'AClip_Master_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AClip_Master_C, As_Player_BP) == 0x000238, "Member 'AClip_Master_C::As_Player_BP' has a wrong offset!");

}

