#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CommonFunction_0

#include "Basic.hpp"


namespace SDK::Params
{

// Function CommonFunction.CommonFunction_C.ShowFPS
// 0x0068 (0x0068 - 0x0000)
struct CommonFunction_C_ShowFPS final
{
public:
	int32                                         Int;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFPS_C*                                 CallFunc_Create_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFPS_C*>                         CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0020(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UFPS_C*                                 CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFPS_C*>                         CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFPS_C*                                 CallFunc_Array_Get_Item_1;                         // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CommonFunction_C_ShowFPS) == 0x000008, "Wrong alignment on CommonFunction_C_ShowFPS");
static_assert(sizeof(CommonFunction_C_ShowFPS) == 0x000068, "Wrong size on CommonFunction_C_ShowFPS");
static_assert(offsetof(CommonFunction_C_ShowFPS, Int) == 0x000000, "Member 'CommonFunction_C_ShowFPS::Int' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, __WorldContext) == 0x000008, "Member 'CommonFunction_C_ShowFPS::__WorldContext' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, K2Node_SwitchInteger_CmpSuccess) == 0x000010, "Member 'CommonFunction_C_ShowFPS::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_Create_ReturnValue) == 0x000018, "Member 'CommonFunction_C_ShowFPS::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000020, "Member 'CommonFunction_C_ShowFPS::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_Array_Get_Item) == 0x000030, "Member 'CommonFunction_C_ShowFPS::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000038, "Member 'CommonFunction_C_ShowFPS::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'CommonFunction_C_ShowFPS::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_Array_Get_Item_1) == 0x000050, "Member 'CommonFunction_C_ShowFPS::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_IsValid_ReturnValue_1) == 0x000058, "Member 'CommonFunction_C_ShowFPS::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_Array_Length_ReturnValue) == 0x00005C, "Member 'CommonFunction_C_ShowFPS::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CommonFunction_C_ShowFPS, CallFunc_Greater_IntInt_ReturnValue) == 0x000060, "Member 'CommonFunction_C_ShowFPS::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

