#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWeaponState

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "WeaponType_structs.hpp"
#include "Optics_Enum_structs.hpp"
#include "MuzzleType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomWeaponState.CustomWeaponState_C
// 0x0028 (0x0050 - 0x0028)
class UCustomWeaponState_C final : public USaveGame
{
public:
	EWeaponType                                   WeaponType;                                        // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EOptics_Enum>                          OpticsType;                                        // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<EMuzzleType>                           MuzzleType;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomWeaponState_C">();
	}
	static class UCustomWeaponState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomWeaponState_C>();
	}
};
static_assert(alignof(UCustomWeaponState_C) == 0x000008, "Wrong alignment on UCustomWeaponState_C");
static_assert(sizeof(UCustomWeaponState_C) == 0x000050, "Wrong size on UCustomWeaponState_C");
static_assert(offsetof(UCustomWeaponState_C, WeaponType) == 0x000028, "Member 'UCustomWeaponState_C::WeaponType' has a wrong offset!");
static_assert(offsetof(UCustomWeaponState_C, OpticsType) == 0x000030, "Member 'UCustomWeaponState_C::OpticsType' has a wrong offset!");
static_assert(offsetof(UCustomWeaponState_C, MuzzleType) == 0x000040, "Member 'UCustomWeaponState_C::MuzzleType' has a wrong offset!");

}

