#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton_UMG1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomButton_UMG1.CustomButton_UMG1_C
// 0x0058 (0x02B8 - 0x0260)
class UCustomButton_UMG1_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       交互; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_1;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_398;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_137;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0288(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          Click_;                                            // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              Click;                                             // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_CustomButton_UMG1(int32 EntryPoint);
	void BndEvt__CustomButton_UMG1_Button_398_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void 点击();
	void Reset();
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void CustomMappingCheck(const struct FInputActionKeyMapping& InputAction, const struct FInputAxisKeyMapping& InputAxis);
	void initializeSetting();
	void SettingDetails(const class FText& 标题, const class FText& 详情);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomButton_UMG1_C">();
	}
	static class UCustomButton_UMG1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomButton_UMG1_C>();
	}
};
static_assert(alignof(UCustomButton_UMG1_C) == 0x000008, "Wrong alignment on UCustomButton_UMG1_C");
static_assert(sizeof(UCustomButton_UMG1_C) == 0x0002B8, "Wrong size on UCustomButton_UMG1_C");
static_assert(offsetof(UCustomButton_UMG1_C, UberGraphFrame) == 0x000260, "Member 'UCustomButton_UMG1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, 交互) == 0x000268, "Member 'UCustomButton_UMG1_C::交互' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, Border_1) == 0x000270, "Member 'UCustomButton_UMG1_C::Border_1' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, Button_398) == 0x000278, "Member 'UCustomButton_UMG1_C::Button_398' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, TextBlock_137) == 0x000280, "Member 'UCustomButton_UMG1_C::TextBlock_137' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, Name_0) == 0x000288, "Member 'UCustomButton_UMG1_C::Name_0' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, Click_) == 0x0002A0, "Member 'UCustomButton_UMG1_C::Click_' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG1_C, Click) == 0x0002A8, "Member 'UCustomButton_UMG1_C::Click' has a wrong offset!");

}

