#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton_UMG4

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CustomButton_UMG4.CustomButton_UMG4_C.ExecuteUbergraph_CustomButton_UMG4
// 0x0068 (0x0068 - 0x0000)
struct CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0018(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0040(0x0028)()
};
static_assert(alignof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4) == 0x000008, "Wrong alignment on CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4");
static_assert(sizeof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4) == 0x000068, "Wrong size on CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, EntryPoint) == 0x000000, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, K2Node_MakeStruct_SlateColor) == 0x000018, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4, K2Node_MakeStruct_SlateColor_1) == 0x000040, "Member 'CustomButton_UMG4_C_ExecuteUbergraph_CustomButton_UMG4::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");

// Function CustomButton_UMG4.CustomButton_UMG4_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomButton_UMG4_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomButton_UMG4_C_PreConstruct) == 0x000001, "Wrong alignment on CustomButton_UMG4_C_PreConstruct");
static_assert(sizeof(CustomButton_UMG4_C_PreConstruct) == 0x000001, "Wrong size on CustomButton_UMG4_C_PreConstruct");
static_assert(offsetof(CustomButton_UMG4_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomButton_UMG4_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

