#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomMapping_Slot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Slate_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function CustomMapping_Slot.CustomMapping_Slot_C.ExecuteUbergraph_CustomMapping_Slot
// 0x01A8 (0x01A8 - 0x0000)
struct CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0008(0x0070)(ConstParm)
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey_1;          // 0x0078(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_FindText_ReturnValue;                     // 0x0098(0x0018)()
	struct FInputChord                            K2Node_ComponentBoundEvent_SelectedKey;            // 0x00B0(0x0020)(HasGetValueTypeHash)
	class FText                                   CallFunc_FindText_ReturnValue_1;                   // 0x00D0(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0100(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x0138(0x0070)(ConstParm)
};
static_assert(alignof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot");
static_assert(sizeof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot) == 0x0001A8, "Wrong size on CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, EntryPoint) == 0x000000, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, K2Node_Event_MouseEvent_1) == 0x000008, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, K2Node_ComponentBoundEvent_SelectedKey_1) == 0x000078, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::K2Node_ComponentBoundEvent_SelectedKey_1' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, CallFunc_FindText_ReturnValue) == 0x000098, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::CallFunc_FindText_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, K2Node_ComponentBoundEvent_SelectedKey) == 0x0000B0, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::K2Node_ComponentBoundEvent_SelectedKey' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, CallFunc_FindText_ReturnValue_1) == 0x0000D0, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::CallFunc_FindText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, CallFunc_IsValid_ReturnValue) == 0x0000E8, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, CallFunc_GetInputSettings_ReturnValue) == 0x0000F0, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, CallFunc_GetInputSettings_ReturnValue_1) == 0x0000F8, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, K2Node_Event_MyGeometry) == 0x000100, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot, K2Node_Event_MouseEvent) == 0x000138, "Member 'CustomMapping_Slot_C_ExecuteUbergraph_CustomMapping_Slot::K2Node_Event_MouseEvent' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CustomMapping_Slot_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CustomMapping_Slot_C_OnMouseEnter) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_OnMouseEnter");
static_assert(sizeof(CustomMapping_Slot_C_OnMouseEnter) == 0x0000A8, "Wrong size on CustomMapping_Slot_C_OnMouseEnter");
static_assert(offsetof(CustomMapping_Slot_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CustomMapping_Slot_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CustomMapping_Slot_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature final
{
public:
	struct FInputChord                            SelectedKey;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature");
static_assert(sizeof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature) == 0x000020, "Wrong size on CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature");
static_assert(offsetof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature, SelectedKey) == 0x000000, "Member 'CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector2_K2Node_ComponentBoundEvent_4_OnKeySelected__DelegateSignature::SelectedKey' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature final
{
public:
	struct FInputChord                            SelectedKey;                                       // 0x0000(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature");
static_assert(sizeof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature) == 0x000020, "Wrong size on CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature");
static_assert(offsetof(CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature, SelectedKey) == 0x000000, "Member 'CustomMapping_Slot_C_BndEvt__CustomMapping_Slot_InputKeySelector1_K2Node_ComponentBoundEvent_2_OnKeySelected__DelegateSignature::SelectedKey' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CustomMapping_Slot_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CustomMapping_Slot_C_OnMouseLeave) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_OnMouseLeave");
static_assert(sizeof(CustomMapping_Slot_C_OnMouseLeave) == 0x000070, "Wrong size on CustomMapping_Slot_C_OnMouseLeave");
static_assert(offsetof(CustomMapping_Slot_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CustomMapping_Slot_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.RemoveMapping
// 0x0078 (0x0078 - 0x0000)
struct CustomMapping_Slot_C_RemoveMapping final
{
public:
	struct FInputChord                            InputChord;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0028(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0050(0x0028)()
};
static_assert(alignof(CustomMapping_Slot_C_RemoveMapping) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_RemoveMapping");
static_assert(sizeof(CustomMapping_Slot_C_RemoveMapping) == 0x000078, "Wrong size on CustomMapping_Slot_C_RemoveMapping");
static_assert(offsetof(CustomMapping_Slot_C_RemoveMapping, InputChord) == 0x000000, "Member 'CustomMapping_Slot_C_RemoveMapping::InputChord' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_RemoveMapping, CallFunc_GetInputSettings_ReturnValue) == 0x000020, "Member 'CustomMapping_Slot_C_RemoveMapping::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_RemoveMapping, K2Node_MakeStruct_InputActionKeyMapping) == 0x000028, "Member 'CustomMapping_Slot_C_RemoveMapping::K2Node_MakeStruct_InputActionKeyMapping' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_RemoveMapping, K2Node_MakeStruct_InputAxisKeyMapping) == 0x000050, "Member 'CustomMapping_Slot_C_RemoveMapping::K2Node_MakeStruct_InputAxisKeyMapping' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.AddMapping
// 0x0078 (0x0078 - 0x0000)
struct CustomMapping_Slot_C_AddMapping final
{
public:
	struct FInputChord                            InputChord;                                        // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputActionKeyMapping                 K2Node_MakeStruct_InputActionKeyMapping;           // 0x0028(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_MakeStruct_InputAxisKeyMapping;             // 0x0050(0x0028)()
};
static_assert(alignof(CustomMapping_Slot_C_AddMapping) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_AddMapping");
static_assert(sizeof(CustomMapping_Slot_C_AddMapping) == 0x000078, "Wrong size on CustomMapping_Slot_C_AddMapping");
static_assert(offsetof(CustomMapping_Slot_C_AddMapping, InputChord) == 0x000000, "Member 'CustomMapping_Slot_C_AddMapping::InputChord' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_AddMapping, CallFunc_GetInputSettings_ReturnValue) == 0x000020, "Member 'CustomMapping_Slot_C_AddMapping::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_AddMapping, K2Node_MakeStruct_InputActionKeyMapping) == 0x000028, "Member 'CustomMapping_Slot_C_AddMapping::K2Node_MakeStruct_InputActionKeyMapping' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_AddMapping, K2Node_MakeStruct_InputAxisKeyMapping) == 0x000050, "Member 'CustomMapping_Slot_C_AddMapping::K2Node_MakeStruct_InputAxisKeyMapping' has a wrong offset!");

// Function CustomMapping_Slot.CustomMapping_Slot_C.FindText
// 0x0070 (0x0070 - 0x0000)
struct CustomMapping_Slot_C_FindText final
{
public:
	class UInputKeySelector*                      目标; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          ___bool_Variable;                                  // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsSelectingKey_ReturnValue;            // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0028(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0040(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x0058(0x0018)()
};
static_assert(alignof(CustomMapping_Slot_C_FindText) == 0x000008, "Wrong alignment on CustomMapping_Slot_C_FindText");
static_assert(sizeof(CustomMapping_Slot_C_FindText) == 0x000070, "Wrong size on CustomMapping_Slot_C_FindText");
static_assert(offsetof(CustomMapping_Slot_C_FindText, 目标) == 0x000000, "Member 'CustomMapping_Slot_C_FindText::目标' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, ReturnValue) == 0x000008, "Member 'CustomMapping_Slot_C_FindText::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, ___bool_Variable) == 0x000020, "Member 'CustomMapping_Slot_C_FindText::___bool_Variable' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, CallFunc_GetIsSelectingKey_ReturnValue) == 0x000021, "Member 'CustomMapping_Slot_C_FindText::CallFunc_GetIsSelectingKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, ___bool_Variable_1) == 0x000022, "Member 'CustomMapping_Slot_C_FindText::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, CallFunc_Key_IsValid_ReturnValue) == 0x000023, "Member 'CustomMapping_Slot_C_FindText::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, CallFunc_Key_GetDisplayName_ReturnValue) == 0x000028, "Member 'CustomMapping_Slot_C_FindText::CallFunc_Key_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, K2Node_Select_Default) == 0x000040, "Member 'CustomMapping_Slot_C_FindText::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomMapping_Slot_C_FindText, K2Node_Select_Default_1) == 0x000058, "Member 'CustomMapping_Slot_C_FindText::K2Node_Select_Default_1' has a wrong offset!");

}

