#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton_UMG1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function CustomButton_UMG1.CustomButton_UMG1_C.ExecuteUbergraph_CustomButton_UMG1
// 0x0298 (0x0298 - 0x0000)
struct CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Event___;                                   // 0x0010(0x0018)()
	class FText                                   K2Node_Event____1;                                 // 0x0028(0x0018)()
	struct FInputActionKeyMapping                 K2Node_Event_InputAction;                          // 0x0040(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_Event_InputAxis;                            // 0x0068(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00A8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x00D0(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x00F8(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_3;                    // 0x0120(0x0028)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0148(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0180(0x0070)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x01F0(0x0070)(ConstParm)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0260(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUISettingInterface_C> K2Node_DynamicCast_AsUISetting_Interface;          // 0x0280(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0291(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1) == 0x000008, "Wrong alignment on CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1");
static_assert(sizeof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1) == 0x000298, "Wrong size on CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, EntryPoint) == 0x000000, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, ___int_Array_Index_Variable) == 0x000004, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, ___int_Loop_Counter_Variable) == 0x000008, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event___) == 0x000010, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event___' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event____1) == 0x000028, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event____1' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_InputAction) == 0x000040, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_InputAction' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_InputAxis) == 0x000068, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_InputAxis' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_IsDesignTime) == 0x000090, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000A0, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_MakeStruct_SlateColor) == 0x0000A8, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_MakeStruct_SlateColor_1) == 0x0000D0, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_MakeStruct_SlateColor_2) == 0x0000F8, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_MakeStruct_SlateColor_3) == 0x000120, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_MakeStruct_SlateColor_3' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_MyGeometry) == 0x000148, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_MouseEvent_1) == 0x000180, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_Event_MouseEvent) == 0x0001F0, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000260, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_Array_Get_Item) == 0x000270, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_Array_Length_ReturnValue) == 0x000278, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_DynamicCast_AsUISetting_Interface) == 0x000280, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_DynamicCast_AsUISetting_Interface' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, K2Node_DynamicCast_bSuccess) == 0x000290, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1, CallFunc_Less_IntInt_ReturnValue) == 0x000291, "Member 'CustomButton_UMG1_C_ExecuteUbergraph_CustomButton_UMG1::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function CustomButton_UMG1.CustomButton_UMG1_C.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct CustomButton_UMG1_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CustomButton_UMG1_C_OnMouseLeave) == 0x000008, "Wrong alignment on CustomButton_UMG1_C_OnMouseLeave");
static_assert(sizeof(CustomButton_UMG1_C_OnMouseLeave) == 0x000070, "Wrong size on CustomButton_UMG1_C_OnMouseLeave");
static_assert(offsetof(CustomButton_UMG1_C_OnMouseLeave, MouseEvent) == 0x000000, "Member 'CustomButton_UMG1_C_OnMouseLeave::MouseEvent' has a wrong offset!");

// Function CustomButton_UMG1.CustomButton_UMG1_C.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct CustomButton_UMG1_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(CustomButton_UMG1_C_OnMouseEnter) == 0x000008, "Wrong alignment on CustomButton_UMG1_C_OnMouseEnter");
static_assert(sizeof(CustomButton_UMG1_C_OnMouseEnter) == 0x0000A8, "Wrong size on CustomButton_UMG1_C_OnMouseEnter");
static_assert(offsetof(CustomButton_UMG1_C_OnMouseEnter, MyGeometry) == 0x000000, "Member 'CustomButton_UMG1_C_OnMouseEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_OnMouseEnter, MouseEvent) == 0x000038, "Member 'CustomButton_UMG1_C_OnMouseEnter::MouseEvent' has a wrong offset!");

// Function CustomButton_UMG1.CustomButton_UMG1_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomButton_UMG1_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomButton_UMG1_C_PreConstruct) == 0x000001, "Wrong alignment on CustomButton_UMG1_C_PreConstruct");
static_assert(sizeof(CustomButton_UMG1_C_PreConstruct) == 0x000001, "Wrong size on CustomButton_UMG1_C_PreConstruct");
static_assert(offsetof(CustomButton_UMG1_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomButton_UMG1_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function CustomButton_UMG1.CustomButton_UMG1_C.CustomMappingCheck
// 0x0050 (0x0050 - 0x0000)
struct CustomButton_UMG1_C_CustomMappingCheck final
{
public:
	struct FInputActionKeyMapping                 InputAction;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FInputAxisKeyMapping                   InputAxis;                                         // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CustomButton_UMG1_C_CustomMappingCheck) == 0x000008, "Wrong alignment on CustomButton_UMG1_C_CustomMappingCheck");
static_assert(sizeof(CustomButton_UMG1_C_CustomMappingCheck) == 0x000050, "Wrong size on CustomButton_UMG1_C_CustomMappingCheck");
static_assert(offsetof(CustomButton_UMG1_C_CustomMappingCheck, InputAction) == 0x000000, "Member 'CustomButton_UMG1_C_CustomMappingCheck::InputAction' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_CustomMappingCheck, InputAxis) == 0x000028, "Member 'CustomButton_UMG1_C_CustomMappingCheck::InputAxis' has a wrong offset!");

// Function CustomButton_UMG1.CustomButton_UMG1_C.SettingDetails
// 0x0030 (0x0030 - 0x0000)
struct CustomButton_UMG1_C_SettingDetails final
{
public:
	class FText                                   标题; // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   详情; // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(CustomButton_UMG1_C_SettingDetails) == 0x000008, "Wrong alignment on CustomButton_UMG1_C_SettingDetails");
static_assert(sizeof(CustomButton_UMG1_C_SettingDetails) == 0x000030, "Wrong size on CustomButton_UMG1_C_SettingDetails");
static_assert(offsetof(CustomButton_UMG1_C_SettingDetails, 标题) == 0x000000, "Member 'CustomButton_UMG1_C_SettingDetails::标题' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG1_C_SettingDetails, 详情) == 0x000018, "Member 'CustomButton_UMG1_C_SettingDetails::详情' has a wrong offset!");

}

