#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomMapping_Struct

#include "Basic.hpp"

#include "Slate_structs.hpp"


namespace SDK
{

// UserDefinedStruct CustomMapping_Struct.CustomMapping_Struct
// 0x0068 (0x0068 - 0x0000)
struct FCustomMapping_Struct final
{
public:
	class FText                                   DisplayName_6_3030B640459C345EA31858A7C4DF0F53;    // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FName                                   MappingName_14_838623264D209857B45F338204DE25D1;   // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInputChord                            KeyBoardSelector_20_984A9763461AEF4696960EA0EC5A290D; // 0x0020(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FInputChord                            GamePadSelector_23_177AFA7C4BAEC110650FEB84BFF68A95; // 0x0040(0x0020)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          IsAxis_9_1267A8EF49F3693B77B1CC9440BDCEAF;         // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AxisValue_11_3A8747F74918A925EBF45AA72B3711D6;     // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FCustomMapping_Struct) == 0x000008, "Wrong alignment on FCustomMapping_Struct");
static_assert(sizeof(FCustomMapping_Struct) == 0x000068, "Wrong size on FCustomMapping_Struct");
static_assert(offsetof(FCustomMapping_Struct, DisplayName_6_3030B640459C345EA31858A7C4DF0F53) == 0x000000, "Member 'FCustomMapping_Struct::DisplayName_6_3030B640459C345EA31858A7C4DF0F53' has a wrong offset!");
static_assert(offsetof(FCustomMapping_Struct, MappingName_14_838623264D209857B45F338204DE25D1) == 0x000018, "Member 'FCustomMapping_Struct::MappingName_14_838623264D209857B45F338204DE25D1' has a wrong offset!");
static_assert(offsetof(FCustomMapping_Struct, KeyBoardSelector_20_984A9763461AEF4696960EA0EC5A290D) == 0x000020, "Member 'FCustomMapping_Struct::KeyBoardSelector_20_984A9763461AEF4696960EA0EC5A290D' has a wrong offset!");
static_assert(offsetof(FCustomMapping_Struct, GamePadSelector_23_177AFA7C4BAEC110650FEB84BFF68A95) == 0x000040, "Member 'FCustomMapping_Struct::GamePadSelector_23_177AFA7C4BAEC110650FEB84BFF68A95' has a wrong offset!");
static_assert(offsetof(FCustomMapping_Struct, IsAxis_9_1267A8EF49F3693B77B1CC9440BDCEAF) == 0x000060, "Member 'FCustomMapping_Struct::IsAxis_9_1267A8EF49F3693B77B1CC9440BDCEAF' has a wrong offset!");
static_assert(offsetof(FCustomMapping_Struct, AxisValue_11_3A8747F74918A925EBF45AA72B3711D6) == 0x000064, "Member 'FCustomMapping_Struct::AxisValue_11_3A8747F74918A925EBF45AA72B3711D6' has a wrong offset!");

}

