#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton_UMG2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomButton_UMG2.CustomButton_UMG2_C
// 0x0038 (0x0298 - 0x0260)
class UCustomButton_UMG2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       交互; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_131;                                        // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_137;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_CustomButton_UMG2(int32 EntryPoint);
	void BndEvt__Button_131_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_131_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomButton_UMG2_C">();
	}
	static class UCustomButton_UMG2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomButton_UMG2_C>();
	}
};
static_assert(alignof(UCustomButton_UMG2_C) == 0x000008, "Wrong alignment on UCustomButton_UMG2_C");
static_assert(sizeof(UCustomButton_UMG2_C) == 0x000298, "Wrong size on UCustomButton_UMG2_C");
static_assert(offsetof(UCustomButton_UMG2_C, UberGraphFrame) == 0x000260, "Member 'UCustomButton_UMG2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG2_C, 交互) == 0x000268, "Member 'UCustomButton_UMG2_C::交互' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG2_C, Button_131) == 0x000270, "Member 'UCustomButton_UMG2_C::Button_131' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG2_C, TextBlock_137) == 0x000278, "Member 'UCustomButton_UMG2_C::TextBlock_137' has a wrong offset!");
static_assert(offsetof(UCustomButton_UMG2_C, Name_0) == 0x000280, "Member 'UCustomButton_UMG2_C::Name_0' has a wrong offset!");

}

