#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWeapon_UMG

#include "Basic.hpp"

#include "Optics_Enum_structs.hpp"
#include "WeaponType_structs.hpp"
#include "Engine_structs.hpp"
#include "AccessoriesType_structs.hpp"
#include "MuzzleType_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomWeapon_UMG.CustomWeapon_UMG_C
// 0x0078 (0x02D8 - 0x0260)
class UCustomWeapon_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWeaponSlot_UMG_C*                      AKM;                                               // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           AKM配件种类; // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           hk416配件种类; // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_14;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Scar配件种类; // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_735;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWeaponSlot_UMG_C*                      WeaponSlot_UMG;                                    // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWeaponSlot_UMG_C*                      WeaponSlot_UMG_1;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           具体配件; // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           武器种类;                                      // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    自定义按钮; // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturnButton_UMG_C*                    返回按钮; // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EWeaponType                                   WeaponType;                                        // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOptics_Enum                                  OpticsType;                                        // 0x02D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAccessoriesType                              Accessories_Type;                                  // 0x02D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMuzzleType                                   MuzzleType;                                        // 0x02D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_CustomWeapon_UMG(int32 EntryPoint);
	void BndEvt__CustomWeapon_UMG_返回按钮_K2Node_ComponentBoundEvent_1_Click__DelegateSignature();
	void BndEvt__CustomWeapon_UMG_自定义按钮_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void Construct();
	void 离开自定义武器界面();
	void 配件创建(EWeaponType WeaponType_0, EAccessoriesType AccessoriesType);
	void 配件种类(EWeaponType WeaponType_0);
	void 关闭所有配件显示();
	void 添加武器配件选项();
	ESlateVisibility Get_自定义按钮_Visibility_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomWeapon_UMG_C">();
	}
	static class UCustomWeapon_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomWeapon_UMG_C>();
	}
};
static_assert(alignof(UCustomWeapon_UMG_C) == 0x000008, "Wrong alignment on UCustomWeapon_UMG_C");
static_assert(sizeof(UCustomWeapon_UMG_C) == 0x0002D8, "Wrong size on UCustomWeapon_UMG_C");
static_assert(offsetof(UCustomWeapon_UMG_C, UberGraphFrame) == 0x000260, "Member 'UCustomWeapon_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, Appear) == 0x000268, "Member 'UCustomWeapon_UMG_C::Appear' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, AKM) == 0x000270, "Member 'UCustomWeapon_UMG_C::AKM' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, AKM配件种类) == 0x000278, "Member 'UCustomWeapon_UMG_C::AKM配件种类' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, hk416配件种类) == 0x000280, "Member 'UCustomWeapon_UMG_C::hk416配件种类' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, Image_14) == 0x000288, "Member 'UCustomWeapon_UMG_C::Image_14' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, Scar配件种类) == 0x000290, "Member 'UCustomWeapon_UMG_C::Scar配件种类' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, TextBlock_735) == 0x000298, "Member 'UCustomWeapon_UMG_C::TextBlock_735' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, WeaponSlot_UMG) == 0x0002A0, "Member 'UCustomWeapon_UMG_C::WeaponSlot_UMG' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, WeaponSlot_UMG_1) == 0x0002A8, "Member 'UCustomWeapon_UMG_C::WeaponSlot_UMG_1' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, 具体配件) == 0x0002B0, "Member 'UCustomWeapon_UMG_C::具体配件' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, 武器种类) == 0x0002B8, "Member 'UCustomWeapon_UMG_C::武器种类' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, 自定义按钮) == 0x0002C0, "Member 'UCustomWeapon_UMG_C::自定义按钮' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, 返回按钮) == 0x0002C8, "Member 'UCustomWeapon_UMG_C::返回按钮' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, WeaponType) == 0x0002D0, "Member 'UCustomWeapon_UMG_C::WeaponType' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, OpticsType) == 0x0002D1, "Member 'UCustomWeapon_UMG_C::OpticsType' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, Accessories_Type) == 0x0002D2, "Member 'UCustomWeapon_UMG_C::Accessories_Type' has a wrong offset!");
static_assert(offsetof(UCustomWeapon_UMG_C, MuzzleType) == 0x0002D3, "Member 'UCustomWeapon_UMG_C::MuzzleType' has a wrong offset!");

}

