#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWeapon_UMG

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "WeaponType_structs.hpp"
#include "AccessoriesType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CustomWeapon_UMG.CustomWeapon_UMG_C.ExecuteUbergraph_CustomWeapon_UMG
// 0x0190 (0x0190 - 0x0000)
struct CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable;                                  // 0x0008(0x0018)(ConstParm)
	class FText                                   ___text_Variable_1;                                // 0x0020(0x0018)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAccessoriesSlot_UMG_C*                 CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccessoriesSlot_UMG_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccessoriesSlot_UMG_C*                 CallFunc_Create_ReturnValue_2;                     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable_2;                                // 0x0058(0x0018)(ConstParm)
	class UAccessoriesSlot_UMG_C*                 CallFunc_Create_ReturnValue_3;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccessoriesSlot_UMG_C*                 CallFunc_Create_ReturnValue_4;                     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   K2Node_CustomEvent_WeaponType_1;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   K2Node_CustomEvent_WeaponType;                     // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAccessoriesType                              K2Node_CustomEvent_AccessoriesType;                // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable_3;                                // 0x00B8(0x0018)(ConstParm)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_3;                   // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_4;                   // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x00F0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class FText                                   ___text_Variable_4;                                // 0x0100(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomWeapon_BP_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUIWeapon_C>           K2Node_DynamicCast_AsUIWeapon;                     // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0150(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item_1;                         // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets_1;      // 0x0178(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item_2;                         // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG) == 0x000008, "Wrong alignment on CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG");
static_assert(sizeof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG) == 0x000190, "Wrong size on CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, EntryPoint) == 0x000000, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___text_Variable) == 0x000008, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___text_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___text_Variable_1) == 0x000020, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_MakeLiteralByte_ReturnValue) == 0x000038, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Create_ReturnValue) == 0x000040, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Create_ReturnValue_1) == 0x000048, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Create_ReturnValue_2) == 0x000050, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___text_Variable_2) == 0x000058, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___text_Variable_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Create_ReturnValue_3) == 0x000070, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Create_ReturnValue_4) == 0x000078, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000080, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_CustomEvent_WeaponType_1) == 0x000081, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_CustomEvent_WeaponType_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_CustomEvent_WeaponType) == 0x000082, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_CustomEvent_WeaponType' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_CustomEvent_AccessoriesType) == 0x000083, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_CustomEvent_AccessoriesType' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_AddChild_ReturnValue) == 0x000088, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_AddChild_ReturnValue_1) == 0x000090, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000098, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_BreakVector2D_X) == 0x0000A0, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_BreakVector2D_Y) == 0x0000A4, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0000A8, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000AC, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_MakeVector2D_ReturnValue) == 0x0000B0, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___text_Variable_3) == 0x0000B8, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___text_Variable_3' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_AddChild_ReturnValue_2) == 0x0000D0, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_AddChild_ReturnValue_3) == 0x0000D8, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_AddChild_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000E0, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_AddChild_ReturnValue_4) == 0x0000E8, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_AddChild_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x0000F0, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___text_Variable_4) == 0x000100, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___text_Variable_4' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Array_Length_ReturnValue) == 0x000118, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___int_Array_Index_Variable) == 0x00011C, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_GetActorOfClass_ReturnValue) == 0x000120, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Array_Get_Item) == 0x000128, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_DynamicCast_AsUIWeapon) == 0x000130, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_DynamicCast_AsUIWeapon' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000148, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000150, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, ___int_Loop_Counter_Variable) == 0x000160, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Array_Get_Item_1) == 0x000168, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Less_IntInt_ReturnValue) == 0x000170, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x000174, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_GetAllWidgetsOfClass_FoundWidgets_1) == 0x000178, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_GetAllWidgetsOfClass_FoundWidgets_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG, CallFunc_Array_Get_Item_2) == 0x000188, "Member 'CustomWeapon_UMG_C_ExecuteUbergraph_CustomWeapon_UMG::CallFunc_Array_Get_Item_2' has a wrong offset!");

// Function CustomWeapon_UMG.CustomWeapon_UMG_C.配件创建
// 0x0002 (0x0002 - 0x0000)
struct CustomWeapon_UMG_C_配件创建 final
{
public:
	EWeaponType                                   WeaponType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAccessoriesType                              AccessoriesType;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_UMG_C_配件创建) == 0x000001, "Wrong alignment on CustomWeapon_UMG_C_配件创建");
static_assert(sizeof(CustomWeapon_UMG_C_配件创建) == 0x000002, "Wrong size on CustomWeapon_UMG_C_配件创建");
static_assert(offsetof(CustomWeapon_UMG_C_配件创建, WeaponType_0) == 0x000000, "Member 'CustomWeapon_UMG_C_配件创建::WeaponType_0' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_配件创建, AccessoriesType) == 0x000001, "Member 'CustomWeapon_UMG_C_配件创建::AccessoriesType' has a wrong offset!");

// Function CustomWeapon_UMG.CustomWeapon_UMG_C.配件种类
// 0x0001 (0x0001 - 0x0000)
struct CustomWeapon_UMG_C_配件种类 final
{
public:
	EWeaponType                                   WeaponType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_UMG_C_配件种类) == 0x000001, "Wrong alignment on CustomWeapon_UMG_C_配件种类");
static_assert(sizeof(CustomWeapon_UMG_C_配件种类) == 0x000001, "Wrong size on CustomWeapon_UMG_C_配件种类");
static_assert(offsetof(CustomWeapon_UMG_C_配件种类, WeaponType_0) == 0x000000, "Member 'CustomWeapon_UMG_C_配件种类::WeaponType_0' has a wrong offset!");

// Function CustomWeapon_UMG.CustomWeapon_UMG_C.添加武器配件选项
// 0x0078 (0x0078 - 0x0000)
struct CustomWeapon_UMG_C_添加武器配件选项 final
{
public:
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable;                                  // 0x0008(0x0018)(ConstParm)
	class UAccessoriesType_UMG_C*                 CallFunc_Create_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   ___byte_Variable;                                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelWidget*                           ___object_Variable;                                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelWidget*                           ___object_Variable_1;                              // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAccessoriesType_UMG_C*                 CallFunc_Create_ReturnValue_1;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable_1;                                // 0x0048(0x0018)(ConstParm)
	class UPanelWidget*                           K2Node_Select_Default;                             // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_UMG_C_添加武器配件选项) == 0x000008, "Wrong alignment on CustomWeapon_UMG_C_添加武器配件选项");
static_assert(sizeof(CustomWeapon_UMG_C_添加武器配件选项) == 0x000078, "Wrong size on CustomWeapon_UMG_C_添加武器配件选项");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, CallFunc_MakeLiteralByte_ReturnValue) == 0x000000, "Member 'CustomWeapon_UMG_C_添加武器配件选项::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, ___text_Variable) == 0x000008, "Member 'CustomWeapon_UMG_C_添加武器配件选项::___text_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, CallFunc_Create_ReturnValue) == 0x000020, "Member 'CustomWeapon_UMG_C_添加武器配件选项::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, ___byte_Variable) == 0x000028, "Member 'CustomWeapon_UMG_C_添加武器配件选项::___byte_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, ___object_Variable) == 0x000030, "Member 'CustomWeapon_UMG_C_添加武器配件选项::___object_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, ___object_Variable_1) == 0x000038, "Member 'CustomWeapon_UMG_C_添加武器配件选项::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, CallFunc_Create_ReturnValue_1) == 0x000040, "Member 'CustomWeapon_UMG_C_添加武器配件选项::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, ___text_Variable_1) == 0x000048, "Member 'CustomWeapon_UMG_C_添加武器配件选项::___text_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, K2Node_Select_Default) == 0x000060, "Member 'CustomWeapon_UMG_C_添加武器配件选项::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, CallFunc_AddChild_ReturnValue) == 0x000068, "Member 'CustomWeapon_UMG_C_添加武器配件选项::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_添加武器配件选项, CallFunc_AddChild_ReturnValue_1) == 0x000070, "Member 'CustomWeapon_UMG_C_添加武器配件选项::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");

// Function CustomWeapon_UMG.CustomWeapon_UMG_C.Get_自定义按钮_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0) == 0x000001, "Wrong alignment on CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0");
static_assert(sizeof(CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0) == 0x000002, "Wrong size on CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0");
static_assert(offsetof(CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0, ReturnValue) == 0x000000, "Member 'CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'CustomWeapon_UMG_C_Get_自定义按钮_Visibility_0::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

