#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomButton_UMG2

#include "Basic.hpp"


namespace SDK::Params
{

// Function CustomButton_UMG2.CustomButton_UMG2_C.ExecuteUbergraph_CustomButton_UMG2
// 0x0018 (0x0018 - 0x0000)
struct CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2) == 0x000008, "Wrong alignment on CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2");
static_assert(sizeof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2) == 0x000018, "Wrong size on CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2");
static_assert(offsetof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2, EntryPoint) == 0x000000, "Member 'CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2, K2Node_Event_IsDesignTime) == 0x000004, "Member 'CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'CustomButton_UMG2_C_ExecuteUbergraph_CustomButton_UMG2::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function CustomButton_UMG2.CustomButton_UMG2_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct CustomButton_UMG2_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomButton_UMG2_C_PreConstruct) == 0x000001, "Wrong alignment on CustomButton_UMG2_C_PreConstruct");
static_assert(sizeof(CustomButton_UMG2_C_PreConstruct) == 0x000001, "Wrong size on CustomButton_UMG2_C_PreConstruct");
static_assert(offsetof(CustomButton_UMG2_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'CustomButton_UMG2_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

