#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomCharacterUMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CharacterModel_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "CustomCharacterEnum_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass CustomCharacterUMG.CustomCharacterUMG_C
// 0x0BF8 (0x0E58 - 0x0260)
class UCustomCharacterUMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       服装显示淡入Anim; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewYearGirlClothAnim;                              // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       MaidClothAnim;                                     // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AmayaClothAnim;                                    // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ModAnim;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CharacterAnim;                                     // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class U选择自定义人物_C* BunnyGril_1;                                       // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             CharacterSelect;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* Female_1;                                          // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* JuaLee;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* LadyBiker;                                         // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* Maid_1;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* Man_1;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* MOD;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ModSelect_1;                                       // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* NewYearGirl;                                       // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* SchoolGril_1;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义人物_C* Soldier;                                           // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                      UniformGridPanel_1;                                // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    下一步; // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 人物选择; // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 头发选择; // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             显示的服装; // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 衣服选择; // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 裤子选择; // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturnButton_UMG_C*                    返回按钮; // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 面部选择; // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class U选择自定义部位文字_C* 鞋子选择; // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         列; // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         行; // 0x0354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterModel                               CharacterModel;                                    // 0x0358(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UTexture2D*, class USkeletalMesh*> Man衣服; // 0x0360(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir头发; // 0x03B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir裤子; // 0x0400(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir衣服; // 0x0450(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> SchoolGir袜子; // 0x04A0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACustomCharacter_C*                     CustomCharacterRef;                                // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class UTexture2D*, class USkeletalMesh*> Female衣服; // 0x04F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female裤子; // 0x0548(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female面部; // 0x0598(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female鞋子; // 0x05E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Female头发; // 0x0638(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man裤子; // 0x0688(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man帽子; // 0x06D8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man鞋子; // 0x0728(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Man面部; // 0x0778(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir衣服; // 0x07C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir丝袜; // 0x0818(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid衣服; // 0x0868(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Amaya衣服; // 0x08B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> NewYearGril衣服; // 0x0908(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir鞋子; // 0x0958(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> BunnyGir头饰;                                    // 0x09A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid头发; // 0x09F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid丝袜; // 0x0A48(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Maid鞋子; // 0x0A98(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker头盔; // 0x0AE8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker衣服; // 0x0B38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> LadyBiker裤子; // 0x0B88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier衣服; // 0x0BD8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier裤子; // 0x0C28(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier头盔; // 0x0C78(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier鞋子; // 0x0CC8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> Soldier防弹衣; // 0x0D18(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee衣服; // 0x0D68(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee头发; // 0x0DB8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UTexture2D*, class USkeletalMesh*> JuaLee鞋子; // 0x0E08(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_CustomCharacterUMG(int32 EntryPoint);
	void Construct();
	void BndEvt__CustomCharacterUMG_返回按钮_K2Node_ComponentBoundEvent_1_Click__DelegateSignature();
	void 面部UI刷新();
	void BndEvt__CustomCharacterUMG_自定义按钮_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void 衣服UI刷新();
	void ModUI刷新();
	void 初始化自定义服装选中();
	void 头发UI刷新();
	void 鞋子UI刷新();
	void 裤子UI刷新();
	void 人物UI刷新();
	void 关闭所有换装UI交互();
	ESlateVisibility Get_自定义按钮_Visibility_0();
	void 展示可更换服装(const TMap<class UTexture2D*, class USkeletalMesh*>& TargetMap, ECustomCharacterEnum CustomCharacterEnum);
	void 刷新部位名字();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomCharacterUMG_C">();
	}
	static class UCustomCharacterUMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCustomCharacterUMG_C>();
	}
};
static_assert(alignof(UCustomCharacterUMG_C) == 0x000008, "Wrong alignment on UCustomCharacterUMG_C");
static_assert(sizeof(UCustomCharacterUMG_C) == 0x000E58, "Wrong size on UCustomCharacterUMG_C");
static_assert(offsetof(UCustomCharacterUMG_C, UberGraphFrame) == 0x000260, "Member 'UCustomCharacterUMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 服装显示淡入Anim) == 0x000268, "Member 'UCustomCharacterUMG_C::服装显示淡入Anim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Appear) == 0x000270, "Member 'UCustomCharacterUMG_C::Appear' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, NewYearGirlClothAnim) == 0x000278, "Member 'UCustomCharacterUMG_C::NewYearGirlClothAnim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, MaidClothAnim) == 0x000280, "Member 'UCustomCharacterUMG_C::MaidClothAnim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, AmayaClothAnim) == 0x000288, "Member 'UCustomCharacterUMG_C::AmayaClothAnim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, ModAnim) == 0x000290, "Member 'UCustomCharacterUMG_C::ModAnim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, CharacterAnim) == 0x000298, "Member 'UCustomCharacterUMG_C::CharacterAnim' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGril_1) == 0x0002A0, "Member 'UCustomCharacterUMG_C::BunnyGril_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, CharacterSelect) == 0x0002A8, "Member 'UCustomCharacterUMG_C::CharacterSelect' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female_1) == 0x0002B0, "Member 'UCustomCharacterUMG_C::Female_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, JuaLee) == 0x0002B8, "Member 'UCustomCharacterUMG_C::JuaLee' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, LadyBiker) == 0x0002C0, "Member 'UCustomCharacterUMG_C::LadyBiker' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Maid_1) == 0x0002C8, "Member 'UCustomCharacterUMG_C::Maid_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man_1) == 0x0002D0, "Member 'UCustomCharacterUMG_C::Man_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, MOD) == 0x0002D8, "Member 'UCustomCharacterUMG_C::MOD' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, ModSelect_1) == 0x0002E0, "Member 'UCustomCharacterUMG_C::ModSelect_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, NewYearGirl) == 0x0002E8, "Member 'UCustomCharacterUMG_C::NewYearGirl' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, SchoolGril_1) == 0x0002F0, "Member 'UCustomCharacterUMG_C::SchoolGril_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier) == 0x0002F8, "Member 'UCustomCharacterUMG_C::Soldier' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, UniformGridPanel_1) == 0x000300, "Member 'UCustomCharacterUMG_C::UniformGridPanel_1' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 下一步) == 0x000308, "Member 'UCustomCharacterUMG_C::下一步' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 人物选择) == 0x000310, "Member 'UCustomCharacterUMG_C::人物选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 头发选择) == 0x000318, "Member 'UCustomCharacterUMG_C::头发选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 显示的服装) == 0x000320, "Member 'UCustomCharacterUMG_C::显示的服装' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 衣服选择) == 0x000328, "Member 'UCustomCharacterUMG_C::衣服选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 裤子选择) == 0x000330, "Member 'UCustomCharacterUMG_C::裤子选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 返回按钮) == 0x000338, "Member 'UCustomCharacterUMG_C::返回按钮' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 面部选择) == 0x000340, "Member 'UCustomCharacterUMG_C::面部选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 鞋子选择) == 0x000348, "Member 'UCustomCharacterUMG_C::鞋子选择' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 列) == 0x000350, "Member 'UCustomCharacterUMG_C::列' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, 行) == 0x000354, "Member 'UCustomCharacterUMG_C::行' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, CharacterModel) == 0x000358, "Member 'UCustomCharacterUMG_C::CharacterModel' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man衣服) == 0x000360, "Member 'UCustomCharacterUMG_C::Man衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGir头发) == 0x0003B0, "Member 'UCustomCharacterUMG_C::BunnyGir头发' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, SchoolGir裤子) == 0x000400, "Member 'UCustomCharacterUMG_C::SchoolGir裤子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, SchoolGir衣服) == 0x000450, "Member 'UCustomCharacterUMG_C::SchoolGir衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, SchoolGir袜子) == 0x0004A0, "Member 'UCustomCharacterUMG_C::SchoolGir袜子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, CustomCharacterRef) == 0x0004F0, "Member 'UCustomCharacterUMG_C::CustomCharacterRef' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female衣服) == 0x0004F8, "Member 'UCustomCharacterUMG_C::Female衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female裤子) == 0x000548, "Member 'UCustomCharacterUMG_C::Female裤子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female面部) == 0x000598, "Member 'UCustomCharacterUMG_C::Female面部' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female鞋子) == 0x0005E8, "Member 'UCustomCharacterUMG_C::Female鞋子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Female头发) == 0x000638, "Member 'UCustomCharacterUMG_C::Female头发' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man裤子) == 0x000688, "Member 'UCustomCharacterUMG_C::Man裤子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man帽子) == 0x0006D8, "Member 'UCustomCharacterUMG_C::Man帽子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man鞋子) == 0x000728, "Member 'UCustomCharacterUMG_C::Man鞋子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Man面部) == 0x000778, "Member 'UCustomCharacterUMG_C::Man面部' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGir衣服) == 0x0007C8, "Member 'UCustomCharacterUMG_C::BunnyGir衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGir丝袜) == 0x000818, "Member 'UCustomCharacterUMG_C::BunnyGir丝袜' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Maid衣服) == 0x000868, "Member 'UCustomCharacterUMG_C::Maid衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Amaya衣服) == 0x0008B8, "Member 'UCustomCharacterUMG_C::Amaya衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, NewYearGril衣服) == 0x000908, "Member 'UCustomCharacterUMG_C::NewYearGril衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGir鞋子) == 0x000958, "Member 'UCustomCharacterUMG_C::BunnyGir鞋子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, BunnyGir头饰) == 0x0009A8, "Member 'UCustomCharacterUMG_C::BunnyGir头饰' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Maid头发) == 0x0009F8, "Member 'UCustomCharacterUMG_C::Maid头发' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Maid丝袜) == 0x000A48, "Member 'UCustomCharacterUMG_C::Maid丝袜' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Maid鞋子) == 0x000A98, "Member 'UCustomCharacterUMG_C::Maid鞋子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, LadyBiker头盔) == 0x000AE8, "Member 'UCustomCharacterUMG_C::LadyBiker头盔' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, LadyBiker衣服) == 0x000B38, "Member 'UCustomCharacterUMG_C::LadyBiker衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, LadyBiker裤子) == 0x000B88, "Member 'UCustomCharacterUMG_C::LadyBiker裤子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier衣服) == 0x000BD8, "Member 'UCustomCharacterUMG_C::Soldier衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier裤子) == 0x000C28, "Member 'UCustomCharacterUMG_C::Soldier裤子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier头盔) == 0x000C78, "Member 'UCustomCharacterUMG_C::Soldier头盔' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier鞋子) == 0x000CC8, "Member 'UCustomCharacterUMG_C::Soldier鞋子' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, Soldier防弹衣) == 0x000D18, "Member 'UCustomCharacterUMG_C::Soldier防弹衣' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, JuaLee衣服) == 0x000D68, "Member 'UCustomCharacterUMG_C::JuaLee衣服' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, JuaLee头发) == 0x000DB8, "Member 'UCustomCharacterUMG_C::JuaLee头发' has a wrong offset!");
static_assert(offsetof(UCustomCharacterUMG_C, JuaLee鞋子) == 0x000E08, "Member 'UCustomCharacterUMG_C::JuaLee鞋子' has a wrong offset!");

}

