#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomCharacter

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CharacterModel_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass CustomCharacter.CustomCharacter_C
// 0x0100 (0x05C0 - 0x04C0)
class ACustomCharacter_C final : public ACharacter
{
public:
	uint8                                         Pad_4B8[0x8];                                      // 0x04B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 Hat;                                               // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs;                                              // 0x04D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hand;                                              // 0x04D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Belt;                                              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Pants;                                             // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Cloth;                                             // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shoes;                                             // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 HairSocket;                                        // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____1______0_63D6A7D04C1B1DED661831A412DC42F0;     // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____1__Direction_63D6A7D04C1B1DED661831A412DC42F0; // 0x0514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_515[0x3];                                      // 0x0515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_1; // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_2755B4F04961DB9976752BB8CF62921C;     // 0x0520(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_2755B4F04961DB9976752BB8CF62921C; // 0x0524(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_525[0x3];                                      // 0x0525(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0; // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRotator;                                        // 0x0530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ECharacterModel                               CharacterModel;                                    // 0x0531(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_532[0x6];                                      // 0x0532(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterSelectAnim_C*                 AnimRef;                                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          BaseMesh;                                          // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HeadMesh;                                          // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HairMesh;                                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ShoesMesh;                                         // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ClothMesh;                                         // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          PantsMesh;                                         // 0x0568(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          BeltMesh;                                          // 0x0570(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HandMesh;                                          // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          LegsMesh;                                          // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HatMesh;                                           // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomCharacterState_BP_C*             As_Custom_Character_State_BP;                      // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ACustomCharacter_C*                     CustomCharacterRef;                                // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                   AmayaDance;                                        // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               ActorRotation;                                     // 0x05B0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_CustomCharacter(int32 EntryPoint);
	void 恢复默认设置();
	void 播放微笑动画();
	void 播放眨眼动画();
	void ReceiveBeginPlay();
	void InpAxisEvt_Turn_K2Node_InputAxisEvent_0(float AxisValue);
	void 随机跳舞();
	void 选择人物_Event(ECharacterModel Selection);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_LeftMouseButton_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void OnCompleted_9662C3F24F401F50D7E320ABFEEF79EA(class FName NotifyName);
	void OnBlendOut_9662C3F24F401F50D7E320ABFEEF79EA(class FName NotifyName);
	void OnInterrupted_9662C3F24F401F50D7E320ABFEEF79EA(class FName NotifyName);
	void OnNotifyBegin_9662C3F24F401F50D7E320ABFEEF79EA(class FName NotifyName);
	void OnNotifyEnd_9662C3F24F401F50D7E320ABFEEF79EA(class FName NotifyName);
	void 时间轴_1__UpdateFunc();
	void 时间轴_1__FinishedFunc();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void UserConstructionScript();
	void 拖动旋转(float Z);
	void 应用读取的数据();
	void 选择Man角色();
	void 选择Female角色();
	void 保存玩家选择信息(ECharacterModel CharacterModel_0);
	void 选择BunnyGirl角色();
	void 选择Amaya角色();
	void 选择Maid角色();
	void 选择NewYearGirl角色();
	void 选择SchoolGirl角色();
	void 选择LadyBiker角色();
	void 选择Soldier角色();
	void 选择JuaLee角色();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CustomCharacter_C">();
	}
	static class ACustomCharacter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACustomCharacter_C>();
	}
};
static_assert(alignof(ACustomCharacter_C) == 0x000010, "Wrong alignment on ACustomCharacter_C");
static_assert(sizeof(ACustomCharacter_C) == 0x0005C0, "Wrong size on ACustomCharacter_C");
static_assert(offsetof(ACustomCharacter_C, UberGraphFrame) == 0x0004C0, "Member 'ACustomCharacter_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Hat) == 0x0004C8, "Member 'ACustomCharacter_C::Hat' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Legs) == 0x0004D0, "Member 'ACustomCharacter_C::Legs' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Hand) == 0x0004D8, "Member 'ACustomCharacter_C::Hand' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Belt) == 0x0004E0, "Member 'ACustomCharacter_C::Belt' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Pants) == 0x0004E8, "Member 'ACustomCharacter_C::Pants' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Cloth) == 0x0004F0, "Member 'ACustomCharacter_C::Cloth' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Shoes) == 0x0004F8, "Member 'ACustomCharacter_C::Shoes' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, HairSocket) == 0x000500, "Member 'ACustomCharacter_C::HairSocket' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, Head) == 0x000508, "Member 'ACustomCharacter_C::Head' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ____1______0_63D6A7D04C1B1DED661831A412DC42F0) == 0x000510, "Member 'ACustomCharacter_C::____1______0_63D6A7D04C1B1DED661831A412DC42F0' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ____1__Direction_63D6A7D04C1B1DED661831A412DC42F0) == 0x000514, "Member 'ACustomCharacter_C::____1__Direction_63D6A7D04C1B1DED661831A412DC42F0' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, 时间轴_1) == 0x000518, "Member 'ACustomCharacter_C::时间轴_1' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ____0______0_2755B4F04961DB9976752BB8CF62921C) == 0x000520, "Member 'ACustomCharacter_C::____0______0_2755B4F04961DB9976752BB8CF62921C' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ____0__Direction_2755B4F04961DB9976752BB8CF62921C) == 0x000524, "Member 'ACustomCharacter_C::____0__Direction_2755B4F04961DB9976752BB8CF62921C' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, 时间轴_0) == 0x000528, "Member 'ACustomCharacter_C::时间轴_0' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, CanRotator) == 0x000530, "Member 'ACustomCharacter_C::CanRotator' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, CharacterModel) == 0x000531, "Member 'ACustomCharacter_C::CharacterModel' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, AnimRef) == 0x000538, "Member 'ACustomCharacter_C::AnimRef' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, BaseMesh) == 0x000540, "Member 'ACustomCharacter_C::BaseMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, HeadMesh) == 0x000548, "Member 'ACustomCharacter_C::HeadMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, HairMesh) == 0x000550, "Member 'ACustomCharacter_C::HairMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ShoesMesh) == 0x000558, "Member 'ACustomCharacter_C::ShoesMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ClothMesh) == 0x000560, "Member 'ACustomCharacter_C::ClothMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, PantsMesh) == 0x000568, "Member 'ACustomCharacter_C::PantsMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, BeltMesh) == 0x000570, "Member 'ACustomCharacter_C::BeltMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, HandMesh) == 0x000578, "Member 'ACustomCharacter_C::HandMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, LegsMesh) == 0x000580, "Member 'ACustomCharacter_C::LegsMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, HatMesh) == 0x000588, "Member 'ACustomCharacter_C::HatMesh' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, As_Custom_Character_State_BP) == 0x000590, "Member 'ACustomCharacter_C::As_Custom_Character_State_BP' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, CustomCharacterRef) == 0x000598, "Member 'ACustomCharacter_C::CustomCharacterRef' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, AmayaDance) == 0x0005A0, "Member 'ACustomCharacter_C::AmayaDance' has a wrong offset!");
static_assert(offsetof(ACustomCharacter_C, ActorRotation) == 0x0005B0, "Member 'ACustomCharacter_C::ActorRotation' has a wrong offset!");

}

