#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CustomWeapon_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "WeaponType_structs.hpp"
#include "Optics_Enum_structs.hpp"
#include "MuzzleType_structs.hpp"


namespace SDK::Params
{

// Function CustomWeapon_BP.CustomWeapon_BP_C.ExecuteUbergraph_CustomWeapon_BP
// 0x0070 (0x0070 - 0x0000)
struct CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomWeaponState_C*                   CallFunc_CreateSaveGameObject_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomWeaponState_C*                   K2Node_DynamicCast_AsCustom_Weapon_State;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SaveGameToSlot_ReturnValue;               // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue_1;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomWeaponState_C*                   K2Node_DynamicCast_AsCustom_Weapon_State_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   K2Node_CustomEvent_WeaponType_2;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOptics_Enum                                  K2Node_CustomEvent_OpticsType;                     // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   K2Node_CustomEvent_WeaponType_1;                   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMuzzleType                                   CallFunc_Array_Get_Item;                           // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMuzzleType                                   K2Node_CustomEvent_MuzzleType;                     // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   K2Node_CustomEvent_WeaponType;                     // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EOptics_Enum>                          K2Node_MakeArray_Array;                            // 0x0050(0x0010)(ReferenceParm)
	TArray<EMuzzleType>                           K2Node_MakeArray_Array_1;                          // 0x0060(0x0010)(ReferenceParm)
};
static_assert(alignof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP) == 0x000008, "Wrong alignment on CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP");
static_assert(sizeof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP) == 0x000070, "Wrong size on CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, EntryPoint) == 0x000000, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000004, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_CreateSaveGameObject_ReturnValue) == 0x000008, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_CreateSaveGameObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000010, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_DynamicCast_AsCustom_Weapon_State) == 0x000018, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_DynamicCast_AsCustom_Weapon_State' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_SaveGameToSlot_ReturnValue) == 0x000021, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_SaveGameToSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_DoesSaveGameExist_ReturnValue_1) == 0x000022, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_DoesSaveGameExist_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_LoadGameFromSlot_ReturnValue_1) == 0x000028, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_LoadGameFromSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_DynamicCast_AsCustom_Weapon_State_1) == 0x000030, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_DynamicCast_AsCustom_Weapon_State_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_CustomEvent_WeaponType_2) == 0x000039, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_CustomEvent_WeaponType_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_CustomEvent_OpticsType) == 0x00003A, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_CustomEvent_OpticsType' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_SwitchEnum_CmpSuccess_1) == 0x00003B, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_SetStaticMesh_ReturnValue) == 0x00003C, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_SetStaticMesh_ReturnValue_1) == 0x00003D, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_Conv_ByteToInt_ReturnValue) == 0x000040, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_SwitchEnum_CmpSuccess_2) == 0x000044, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_CustomEvent_WeaponType_1) == 0x000045, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_CustomEvent_WeaponType_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_Array_Get_Item) == 0x000046, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000047, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_SwitchEnum_CmpSuccess_3) == 0x000048, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_CustomEvent_MuzzleType) == 0x000049, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_CustomEvent_MuzzleType' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_CustomEvent_WeaponType) == 0x00004A, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_CustomEvent_WeaponType' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_SwitchEnum_CmpSuccess_4) == 0x00004B, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_MakeArray_Array) == 0x000050, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP, K2Node_MakeArray_Array_1) == 0x000060, "Member 'CustomWeapon_BP_C_ExecuteUbergraph_CustomWeapon_BP::K2Node_MakeArray_Array_1' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.更换枪口配件
// 0x0002 (0x0002 - 0x0000)
struct CustomWeapon_BP_C_更换枪口配件 final
{
public:
	EMuzzleType                                   MuzzleType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   WeaponType_0;                                      // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_BP_C_更换枪口配件) == 0x000001, "Wrong alignment on CustomWeapon_BP_C_更换枪口配件");
static_assert(sizeof(CustomWeapon_BP_C_更换枪口配件) == 0x000002, "Wrong size on CustomWeapon_BP_C_更换枪口配件");
static_assert(offsetof(CustomWeapon_BP_C_更换枪口配件, MuzzleType_0) == 0x000000, "Member 'CustomWeapon_BP_C_更换枪口配件::MuzzleType_0' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_更换枪口配件, WeaponType_0) == 0x000001, "Member 'CustomWeapon_BP_C_更换枪口配件::WeaponType_0' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.切换武器
// 0x0001 (0x0001 - 0x0000)
struct CustomWeapon_BP_C_切换武器 final
{
public:
	EWeaponType                                   WeaponType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_BP_C_切换武器) == 0x000001, "Wrong alignment on CustomWeapon_BP_C_切换武器");
static_assert(sizeof(CustomWeapon_BP_C_切换武器) == 0x000001, "Wrong size on CustomWeapon_BP_C_切换武器");
static_assert(offsetof(CustomWeapon_BP_C_切换武器, WeaponType_0) == 0x000000, "Member 'CustomWeapon_BP_C_切换武器::WeaponType_0' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.更换倍镜
// 0x0002 (0x0002 - 0x0000)
struct CustomWeapon_BP_C_更换倍镜 final
{
public:
	EWeaponType                                   WeaponType_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EOptics_Enum                                  OpticsType;                                        // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(CustomWeapon_BP_C_更换倍镜) == 0x000001, "Wrong alignment on CustomWeapon_BP_C_更换倍镜");
static_assert(sizeof(CustomWeapon_BP_C_更换倍镜) == 0x000002, "Wrong size on CustomWeapon_BP_C_更换倍镜");
static_assert(offsetof(CustomWeapon_BP_C_更换倍镜, WeaponType_0) == 0x000000, "Member 'CustomWeapon_BP_C_更换倍镜::WeaponType_0' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_更换倍镜, OpticsType) == 0x000001, "Member 'CustomWeapon_BP_C_更换倍镜::OpticsType' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.隐藏所有倍镜
// 0x0003 (0x0003 - 0x0000)
struct CustomWeapon_BP_C_隐藏所有倍镜 final
{
public:
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_2;              // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWeapon_BP_C_隐藏所有倍镜) == 0x000001, "Wrong alignment on CustomWeapon_BP_C_隐藏所有倍镜");
static_assert(sizeof(CustomWeapon_BP_C_隐藏所有倍镜) == 0x000003, "Wrong size on CustomWeapon_BP_C_隐藏所有倍镜");
static_assert(offsetof(CustomWeapon_BP_C_隐藏所有倍镜, CallFunc_SetStaticMesh_ReturnValue) == 0x000000, "Member 'CustomWeapon_BP_C_隐藏所有倍镜::CallFunc_SetStaticMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_隐藏所有倍镜, CallFunc_SetStaticMesh_ReturnValue_1) == 0x000001, "Member 'CustomWeapon_BP_C_隐藏所有倍镜::CallFunc_SetStaticMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_隐藏所有倍镜, CallFunc_SetStaticMesh_ReturnValue_2) == 0x000002, "Member 'CustomWeapon_BP_C_隐藏所有倍镜::CallFunc_SetStaticMesh_ReturnValue_2' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.销毁HK416的附加组件
// 0x0002 (0x0002 - 0x0000)
struct CustomWeapon_BP_C_销毁HK416的附加组件 final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWeapon_BP_C_销毁HK416的附加组件) == 0x000001, "Wrong alignment on CustomWeapon_BP_C_销毁HK416的附加组件");
static_assert(sizeof(CustomWeapon_BP_C_销毁HK416的附加组件) == 0x000002, "Wrong size on CustomWeapon_BP_C_销毁HK416的附加组件");
static_assert(offsetof(CustomWeapon_BP_C_销毁HK416的附加组件, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'CustomWeapon_BP_C_销毁HK416的附加组件::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_销毁HK416的附加组件, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'CustomWeapon_BP_C_销毁HK416的附加组件::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function CustomWeapon_BP.CustomWeapon_BP_C.生成HK416的附加组件
// 0x0080 (0x0080 - 0x0000)
struct CustomWeapon_BP_C_生成HK416的附加组件 final
{
public:
	struct FTransform                             ___struct_Variable;                                // 0x0000(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FTransform                             ___struct_Variable_1;                              // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue_1;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CustomWeapon_BP_C_生成HK416的附加组件) == 0x000010, "Wrong alignment on CustomWeapon_BP_C_生成HK416的附加组件");
static_assert(sizeof(CustomWeapon_BP_C_生成HK416的附加组件) == 0x000080, "Wrong size on CustomWeapon_BP_C_生成HK416的附加组件");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, ___struct_Variable) == 0x000000, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::___struct_Variable' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, ___struct_Variable_1) == 0x000030, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, CallFunc_AddComponent_ReturnValue_1) == 0x000068, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000070, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(CustomWeapon_BP_C_生成HK416的附加组件, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x000071, "Member 'CustomWeapon_BP_C_生成HK416的附加组件::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");

}

