#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeadPlayer_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CharacterModel_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DeadPlayer_BP.DeadPlayer_BP_C
// 0x00C8 (0x02E8 - 0x0220)
class ADeadPlayer_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 HairSocket;                                        // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hat;                                               // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Belt;                                              // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Head;                                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Cloth;                                             // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Hand;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Pants;                                             // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Legs;                                              // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Shoes;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_SkinBody_A;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ECharacterModel                               CharacterModel;                                    // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          BeltMesh;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HatMesh;                                           // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          LegsMesh;                                          // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HandMesh;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          PantsMesh;                                         // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ClothMesh;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ShoesMesh;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HairMesh;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          HeadMesh;                                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          BaseMesh;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DeadPlayer_BP(int32 EntryPoint);
	void 脖子被勒住音效();
	void 播放受伤音效();
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void 应用读取的数据();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DeadPlayer_BP_C">();
	}
	static class ADeadPlayer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADeadPlayer_BP_C>();
	}
};
static_assert(alignof(ADeadPlayer_BP_C) == 0x000008, "Wrong alignment on ADeadPlayer_BP_C");
static_assert(sizeof(ADeadPlayer_BP_C) == 0x0002E8, "Wrong size on ADeadPlayer_BP_C");
static_assert(offsetof(ADeadPlayer_BP_C, UberGraphFrame) == 0x000220, "Member 'ADeadPlayer_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, HairSocket) == 0x000228, "Member 'ADeadPlayer_BP_C::HairSocket' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Hat) == 0x000230, "Member 'ADeadPlayer_BP_C::Hat' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Belt) == 0x000238, "Member 'ADeadPlayer_BP_C::Belt' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Head) == 0x000240, "Member 'ADeadPlayer_BP_C::Head' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Cloth) == 0x000248, "Member 'ADeadPlayer_BP_C::Cloth' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Hand) == 0x000250, "Member 'ADeadPlayer_BP_C::Hand' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Pants) == 0x000258, "Member 'ADeadPlayer_BP_C::Pants' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Legs) == 0x000260, "Member 'ADeadPlayer_BP_C::Legs' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, Shoes) == 0x000268, "Member 'ADeadPlayer_BP_C::Shoes' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, CineCamera) == 0x000270, "Member 'ADeadPlayer_BP_C::CineCamera' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, SpringArm) == 0x000278, "Member 'ADeadPlayer_BP_C::SpringArm' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, SK_SkinBody_A) == 0x000280, "Member 'ADeadPlayer_BP_C::SK_SkinBody_A' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, DefaultSceneRoot) == 0x000288, "Member 'ADeadPlayer_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, CharacterModel) == 0x000290, "Member 'ADeadPlayer_BP_C::CharacterModel' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, BeltMesh) == 0x000298, "Member 'ADeadPlayer_BP_C::BeltMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, HatMesh) == 0x0002A0, "Member 'ADeadPlayer_BP_C::HatMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, LegsMesh) == 0x0002A8, "Member 'ADeadPlayer_BP_C::LegsMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, HandMesh) == 0x0002B0, "Member 'ADeadPlayer_BP_C::HandMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, PantsMesh) == 0x0002B8, "Member 'ADeadPlayer_BP_C::PantsMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, ClothMesh) == 0x0002C0, "Member 'ADeadPlayer_BP_C::ClothMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, ShoesMesh) == 0x0002C8, "Member 'ADeadPlayer_BP_C::ShoesMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, HairMesh) == 0x0002D0, "Member 'ADeadPlayer_BP_C::HairMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, HeadMesh) == 0x0002D8, "Member 'ADeadPlayer_BP_C::HeadMesh' has a wrong offset!");
static_assert(offsetof(ADeadPlayer_BP_C, BaseMesh) == 0x0002E0, "Member 'ADeadPlayer_BP_C::BaseMesh' has a wrong offset!");

}

