#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Destination_UMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Destination_UMG.Destination_UMG_C.ExecuteUbergraph_Destination_UMG
// 0x0120 (0x0120 - 0x0000)
struct Destination_UMG_C_ExecuteUbergraph_Destination_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeX;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetViewportSize_SizeY;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue_1;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent____;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             K2Node_CustomEvent_T;                              // 0x0040(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_____;                           // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_ProjectWorldToScreen_ScreenPosition;      // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ProjectWorldToScreen_ReturnValue;         // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0108(0x0018)()
};
static_assert(alignof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG) == 0x000010, "Wrong alignment on Destination_UMG_C_ExecuteUbergraph_Destination_UMG");
static_assert(sizeof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG) == 0x000120, "Wrong size on Destination_UMG_C_ExecuteUbergraph_Destination_UMG");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, EntryPoint) == 0x000000, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_GetViewportSize_SizeX) == 0x000010, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_GetViewportSize_SizeX' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_GetViewportSize_SizeY) == 0x000014, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_GetViewportSize_SizeY' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_FTrunc_ReturnValue) == 0x000018, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Conv_IntToString_ReturnValue) == 0x000020, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000030, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_FTrunc_ReturnValue_1) == 0x000034, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_FTrunc_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, K2Node_CustomEvent____) == 0x000038, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::K2Node_CustomEvent____' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, K2Node_CustomEvent_T) == 0x000040, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::K2Node_CustomEvent_T' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, K2Node_CustomEvent_____) == 0x000070, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x000078, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00007C, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000088, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00008C, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Add_IntInt_ReturnValue_1) == 0x000098, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_ProjectWorldToScreen_ScreenPosition) == 0x00009C, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_ProjectWorldToScreen_ScreenPosition' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_ProjectWorldToScreen_ReturnValue) == 0x0000A4, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_ProjectWorldToScreen_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x0000A8, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_BreakVector2D_X) == 0x0000AC, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_BreakVector2D_Y) == 0x0000B0, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B4, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Add_FloatFloat_ReturnValue) == 0x0000C0, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_VSize_ReturnValue) == 0x0000C4, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_FClamp_ReturnValue) == 0x0000C8, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000CC, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x0000D0, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_FClamp_ReturnValue_1) == 0x0000D4, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_MakeVector2D_ReturnValue) == 0x0000D8, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x0000E0, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Conv_TextToString_ReturnValue) == 0x0000E8, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Concat_StrStr_ReturnValue) == 0x0000F8, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_ExecuteUbergraph_Destination_UMG, CallFunc_Conv_StringToText_ReturnValue) == 0x000108, "Member 'Destination_UMG_C_ExecuteUbergraph_Destination_UMG::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function Destination_UMG.Destination_UMG_C.QuestDistance
// 0x0050 (0x0050 - 0x0000)
struct Destination_UMG_C_QuestDistance final
{
public:
	class AActor*                                 目标点; // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             T;                                                 // 0x0010(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor)
	class AActor*                                 玩家位置; // 0x0040(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Destination_UMG_C_QuestDistance) == 0x000010, "Wrong alignment on Destination_UMG_C_QuestDistance");
static_assert(sizeof(Destination_UMG_C_QuestDistance) == 0x000050, "Wrong size on Destination_UMG_C_QuestDistance");
static_assert(offsetof(Destination_UMG_C_QuestDistance, 目标点) == 0x000000, "Member 'Destination_UMG_C_QuestDistance::目标点' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_QuestDistance, T) == 0x000010, "Member 'Destination_UMG_C_QuestDistance::T' has a wrong offset!");
static_assert(offsetof(Destination_UMG_C_QuestDistance, 玩家位置) == 0x000040, "Member 'Destination_UMG_C_QuestDistance::玩家位置' has a wrong offset!");

}

