#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Destination_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Destination_UMG.Destination_UMG_C
// 0x0040 (0x02A0 - 0x0260)
class UDestination_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Tip;                                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_64;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetPosition;                                    // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   单位; // 0x0288(0x0018)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_Destination_UMG(int32 EntryPoint);
	void Construct();
	void QuestDistance(class AActor* 目标点, const struct FTransform& T, class AActor* 玩家位置);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Destination_UMG_C">();
	}
	static class UDestination_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDestination_UMG_C>();
	}
};
static_assert(alignof(UDestination_UMG_C) == 0x000008, "Wrong alignment on UDestination_UMG_C");
static_assert(sizeof(UDestination_UMG_C) == 0x0002A0, "Wrong size on UDestination_UMG_C");
static_assert(offsetof(UDestination_UMG_C, UberGraphFrame) == 0x000260, "Member 'UDestination_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, Tip) == 0x000268, "Member 'UDestination_UMG_C::Tip' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, Image_0) == 0x000270, "Member 'UDestination_UMG_C::Image_0' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, TextBlock_64) == 0x000278, "Member 'UDestination_UMG_C::TextBlock_64' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, Distance) == 0x000280, "Member 'UDestination_UMG_C::Distance' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, OffsetPosition) == 0x000284, "Member 'UDestination_UMG_C::OffsetPosition' has a wrong offset!");
static_assert(offsetof(UDestination_UMG_C, 单位) == 0x000288, "Member 'UDestination_UMG_C::单位' has a wrong offset!");

}

