#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Dialogue_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Dialogue_UMG.Dialogue_UMG_C
// 0x0040 (0x02A0 - 0x0260)
class UDialogue_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       字出场; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       开场; // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_41;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           说话内容; // 0x0288(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AActor*                                 WhoTalk;                                           // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Dialogue_UMG(int32 EntryPoint);
	void Construct();
	void 刷新对话内容();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Dialogue_UMG_C">();
	}
	static class UDialogue_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogue_UMG_C>();
	}
};
static_assert(alignof(UDialogue_UMG_C) == 0x000008, "Wrong alignment on UDialogue_UMG_C");
static_assert(sizeof(UDialogue_UMG_C) == 0x0002A0, "Wrong size on UDialogue_UMG_C");
static_assert(offsetof(UDialogue_UMG_C, UberGraphFrame) == 0x000260, "Member 'UDialogue_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, 字出场) == 0x000268, "Member 'UDialogue_UMG_C::字出场' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, 开场) == 0x000270, "Member 'UDialogue_UMG_C::开场' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, TextBlock_41) == 0x000278, "Member 'UDialogue_UMG_C::TextBlock_41' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, Index_0) == 0x000280, "Member 'UDialogue_UMG_C::Index_0' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, 说话内容) == 0x000288, "Member 'UDialogue_UMG_C::说话内容' has a wrong offset!");
static_assert(offsetof(UDialogue_UMG_C, WhoTalk) == 0x000298, "Member 'UDialogue_UMG_C::WhoTalk' has a wrong offset!");

}

