#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DifficultySelection_UMG

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DifficultySelection_UMG.DifficultySelection_UMG_C.ExecuteUbergraph_DifficultySelection_UMG
// 0x0028 (0x0028 - 0x0000)
struct DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG) == 0x000008, "Wrong alignment on DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG");
static_assert(sizeof(DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG) == 0x000028, "Wrong size on DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG");
static_assert(offsetof(DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG, EntryPoint) == 0x000000, "Member 'DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG, K2Node_CustomEvent_InText) == 0x000008, "Member 'DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'DifficultySelection_UMG_C_ExecuteUbergraph_DifficultySelection_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function DifficultySelection_UMG.DifficultySelection_UMG_C.设置难度描述
// 0x0018 (0x0018 - 0x0000)
struct DifficultySelection_UMG_C_设置难度描述 final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(DifficultySelection_UMG_C_设置难度描述) == 0x000008, "Wrong alignment on DifficultySelection_UMG_C_设置难度描述");
static_assert(sizeof(DifficultySelection_UMG_C_设置难度描述) == 0x000018, "Wrong size on DifficultySelection_UMG_C_设置难度描述");
static_assert(offsetof(DifficultySelection_UMG_C_设置难度描述, InText) == 0x000000, "Member 'DifficultySelection_UMG_C_设置难度描述::InText' has a wrong offset!");

// Function DifficultySelection_UMG.DifficultySelection_UMG_C.GetVisibility_0
// 0x0002 (0x0002 - 0x0000)
struct DifficultySelection_UMG_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DifficultySelection_UMG_C_GetVisibility_0) == 0x000001, "Wrong alignment on DifficultySelection_UMG_C_GetVisibility_0");
static_assert(sizeof(DifficultySelection_UMG_C_GetVisibility_0) == 0x000002, "Wrong size on DifficultySelection_UMG_C_GetVisibility_0");
static_assert(offsetof(DifficultySelection_UMG_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'DifficultySelection_UMG_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(DifficultySelection_UMG_C_GetVisibility_0, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'DifficultySelection_UMG_C_GetVisibility_0::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

}

