#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DrawersSlot_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DrawersSlot_BP.DrawersSlot_BP_C.ExecuteUbergraph_DrawersSlot_BP
// 0x00F8 (0x00F8 - 0x0000)
struct DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue;         // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Player;                               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0040(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSoundAtLocation_ReturnValue_1;       // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP) == 0x000008, "Wrong alignment on DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP");
static_assert(sizeof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP) == 0x0000F8, "Wrong size on DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, EntryPoint) == 0x000000, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_SpawnSoundAtLocation_ReturnValue) == 0x000010, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_SpawnSoundAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_Lerp_ReturnValue) == 0x000018, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, ___bool_Variable) == 0x00001C, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::___bool_Variable' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, K2Node_Event_Player) == 0x000020, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_BreakVector_X) == 0x000028, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_BreakVector_Y) == 0x00002C, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_BreakVector_Z) == 0x000030, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_MakeVector_ReturnValue) == 0x000034, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000040, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C8, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_GetUserWidgetObject_ReturnValue) == 0x0000D8, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, CallFunc_SpawnSoundAtLocation_ReturnValue_1) == 0x0000E0, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::CallFunc_SpawnSoundAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips) == 0x0000E8, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips' has a wrong offset!");
static_assert(offsetof(DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'DrawersSlot_BP_C_ExecuteUbergraph_DrawersSlot_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function DrawersSlot_BP.DrawersSlot_BP_C.PlayerInteration
// 0x0008 (0x0008 - 0x0000)
struct DrawersSlot_BP_C_PlayerInteration final
{
public:
	class AActor*                                 Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DrawersSlot_BP_C_PlayerInteration) == 0x000008, "Wrong alignment on DrawersSlot_BP_C_PlayerInteration");
static_assert(sizeof(DrawersSlot_BP_C_PlayerInteration) == 0x000008, "Wrong size on DrawersSlot_BP_C_PlayerInteration");
static_assert(offsetof(DrawersSlot_BP_C_PlayerInteration, Player) == 0x000000, "Member 'DrawersSlot_BP_C_PlayerInteration::Player' has a wrong offset!");

}

