#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DroppedMeshes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DroppedMeshes.DroppedMeshes_C
// 0x0018 (0x0238 - 0x0220)
class ADroppedMeshes_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SMesh;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DroppedMeshes(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DroppedMeshes_C">();
	}
	static class ADroppedMeshes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADroppedMeshes_C>();
	}
};
static_assert(alignof(ADroppedMeshes_C) == 0x000008, "Wrong alignment on ADroppedMeshes_C");
static_assert(sizeof(ADroppedMeshes_C) == 0x000238, "Wrong size on ADroppedMeshes_C");
static_assert(offsetof(ADroppedMeshes_C, UberGraphFrame) == 0x000220, "Member 'ADroppedMeshes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ADroppedMeshes_C, SMesh) == 0x000228, "Member 'ADroppedMeshes_C::SMesh' has a wrong offset!");
static_assert(offsetof(ADroppedMeshes_C, DefaultSceneRoot) == 0x000230, "Member 'ADroppedMeshes_C::DefaultSceneRoot' has a wrong offset!");

}

