#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DS_MainMenuGameMode

#include "Basic.hpp"


namespace SDK::Params
{

// Function DS_MainMenuGameMode.DS_MainMenuGameMode_C.ExecuteUbergraph_DS_MainMenuGameMode
// 0x0048 (0x0048 - 0x0000)
struct DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayerStateSetting_C*                  K2Node_DynamicCast_AsPlayer_State_Setting;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode) == 0x000008, "Wrong alignment on DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode");
static_assert(sizeof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode) == 0x000048, "Wrong size on DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, EntryPoint) == 0x000000, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, K2Node_DynamicCast_AsMy_Game_Instance) == 0x000010, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::K2Node_DynamicCast_AsMy_Game_Instance' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000019, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000020, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, K2Node_DynamicCast_AsPlayer_State_Setting) == 0x000028, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::K2Node_DynamicCast_AsPlayer_State_Setting' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000034, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_Conv_IntToFloat_ReturnValue_1) == 0x000038, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_Conv_IntToFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000040, "Member 'DS_MainMenuGameMode_C_ExecuteUbergraph_DS_MainMenuGameMode::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");

}

