#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Entity_listen_Task

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Entity_listen_Task.Entity_listen_Task_C.ExecuteUbergraph_Entity_listen_Task
// 0x00B0 (0x00B0 - 0x0000)
struct Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Entity_Pawn_C*                      K2Node_DynamicCast_AsBP_Entity_Pawn;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AEntity_AiController_C*                 K2Node_DynamicCast_AsEntity_Ai_Controller;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x00A8(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task) == 0x000008, "Wrong alignment on Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task");
static_assert(sizeof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task) == 0x0000B0, "Wrong size on Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, EntryPoint) == 0x000000, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::EntryPoint' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_RandomFloatInRange_ReturnValue) == 0x000004, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_CustomEvent_MovementResult_1) == 0x000008, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_CustomEvent_MovementResult) == 0x00001C, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, ___byte_Variable) == 0x000030, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::___byte_Variable' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_Event_OwnerController_1) == 0x000038, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_Event_OwnerController_1' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_Event_ControlledPawn_1) == 0x000040, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_Event_ControlledPawn_1' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_MakeLiteralName_ReturnValue) == 0x000048, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_Event_OwnerController) == 0x000050, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_Event_ControlledPawn) == 0x000058, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_Event_DeltaSeconds) == 0x000060, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_DynamicCast_AsBP_Entity_Pawn) == 0x000068, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_DynamicCast_AsBP_Entity_Pawn' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_GetAIController_ReturnValue) == 0x000078, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_DynamicCast_AsEntity_Ai_Controller) == 0x000080, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_DynamicCast_AsEntity_Ai_Controller' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_GetBlackboard_ReturnValue) == 0x000090, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000098, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_IsValid_ReturnValue) == 0x0000A0, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task, CallFunc_K2_SetTimer_ReturnValue) == 0x0000A8, "Member 'Entity_listen_Task_C_ExecuteUbergraph_Entity_listen_Task::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

// Function Entity_listen_Task.Entity_listen_Task_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct Entity_listen_Task_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Entity_listen_Task_C_ReceiveTickAI) == 0x000008, "Wrong alignment on Entity_listen_Task_C_ReceiveTickAI");
static_assert(sizeof(Entity_listen_Task_C_ReceiveTickAI) == 0x000018, "Wrong size on Entity_listen_Task_C_ReceiveTickAI");
static_assert(offsetof(Entity_listen_Task_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'Entity_listen_Task_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'Entity_listen_Task_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'Entity_listen_Task_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function Entity_listen_Task.Entity_listen_Task_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct Entity_listen_Task_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Entity_listen_Task_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on Entity_listen_Task_C_ReceiveExecuteAI");
static_assert(sizeof(Entity_listen_Task_C_ReceiveExecuteAI) == 0x000010, "Wrong size on Entity_listen_Task_C_ReceiveExecuteAI");
static_assert(offsetof(Entity_listen_Task_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'Entity_listen_Task_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(Entity_listen_Task_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'Entity_listen_Task_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function Entity_listen_Task.Entity_listen_Task_C.OnSuccess_CA1963E1418C4F4A316F0D86889B8592
// 0x0001 (0x0001 - 0x0000)
struct Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592) == 0x000001, "Wrong alignment on Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592");
static_assert(sizeof(Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592) == 0x000001, "Wrong size on Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592");
static_assert(offsetof(Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592, MovementResult) == 0x000000, "Member 'Entity_listen_Task_C_OnSuccess_CA1963E1418C4F4A316F0D86889B8592::MovementResult' has a wrong offset!");

// Function Entity_listen_Task.Entity_listen_Task_C.OnFail_CA1963E1418C4F4A316F0D86889B8592
// 0x0001 (0x0001 - 0x0000)
struct Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592) == 0x000001, "Wrong alignment on Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592");
static_assert(sizeof(Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592) == 0x000001, "Wrong size on Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592");
static_assert(offsetof(Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592, MovementResult) == 0x000000, "Member 'Entity_listen_Task_C_OnFail_CA1963E1418C4F4A316F0D86889B8592::MovementResult' has a wrong offset!");

}

