#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExitgameConfirmation_UMG1

#include "Basic.hpp"


namespace SDK::Params
{

// Function ExitgameConfirmation_UMG1.ExitgameConfirmation_UMG1_C.ExecuteUbergraph_ExitgameConfirmation_UMG1
// 0x0024 (0x0024 - 0x0000)
struct ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1) == 0x000004, "Wrong alignment on ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1");
static_assert(sizeof(ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1) == 0x000024, "Wrong size on ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1");
static_assert(offsetof(ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1, EntryPoint) == 0x000000, "Member 'ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ExitgameConfirmation_UMG1_C_ExecuteUbergraph_ExitgameConfirmation_UMG1::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

