#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ExitgameConfirmation_UMG

#include "Basic.hpp"


namespace SDK::Params
{

// Function ExitgameConfirmation_UMG.ExitgameConfirmation_UMG_C.ExecuteUbergraph_ExitgameConfirmation_UMG
// 0x0024 (0x0024 - 0x0000)
struct ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG) == 0x000004, "Wrong alignment on ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG");
static_assert(sizeof(ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG) == 0x000024, "Wrong size on ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG");
static_assert(offsetof(ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG, EntryPoint) == 0x000000, "Member 'ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'ExitgameConfirmation_UMG_C_ExecuteUbergraph_ExitgameConfirmation_UMG::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");

}

