#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FindPlayer

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function FindPlayer.FindPlayer_C.ExecuteUbergraph_FindPlayer
// 0x0078 (0x0078 - 0x0000)
struct FindPlayer_C_ExecuteUbergraph_FindPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FindPlayer_C_ExecuteUbergraph_FindPlayer) == 0x000008, "Wrong alignment on FindPlayer_C_ExecuteUbergraph_FindPlayer");
static_assert(sizeof(FindPlayer_C_ExecuteUbergraph_FindPlayer) == 0x000078, "Wrong size on FindPlayer_C_ExecuteUbergraph_FindPlayer");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, EntryPoint) == 0x000000, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_CustomEvent_MovementResult_1) == 0x000010, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_CustomEvent_MovementResult) == 0x000024, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, ___byte_Variable) == 0x000038, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::___byte_Variable' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_Event_OwnerController) == 0x000040, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_Event_ControlledPawn) == 0x000048, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_Event_DeltaSeconds) == 0x000050, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_DynamicCast_AsZombie_BP) == 0x000058, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000068, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ExecuteUbergraph_FindPlayer, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'FindPlayer_C_ExecuteUbergraph_FindPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function FindPlayer.FindPlayer_C.ReceiveTickAI
// 0x0018 (0x0018 - 0x0000)
struct FindPlayer_C_ReceiveTickAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FindPlayer_C_ReceiveTickAI) == 0x000008, "Wrong alignment on FindPlayer_C_ReceiveTickAI");
static_assert(sizeof(FindPlayer_C_ReceiveTickAI) == 0x000018, "Wrong size on FindPlayer_C_ReceiveTickAI");
static_assert(offsetof(FindPlayer_C_ReceiveTickAI, OwnerController) == 0x000000, "Member 'FindPlayer_C_ReceiveTickAI::OwnerController' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ReceiveTickAI, ControlledPawn) == 0x000008, "Member 'FindPlayer_C_ReceiveTickAI::ControlledPawn' has a wrong offset!");
static_assert(offsetof(FindPlayer_C_ReceiveTickAI, DeltaSeconds) == 0x000010, "Member 'FindPlayer_C_ReceiveTickAI::DeltaSeconds' has a wrong offset!");

// Function FindPlayer.FindPlayer_C.OnSuccess_046049DF483FCA9EB69F85BA3AE72C88
// 0x0001 (0x0001 - 0x0000)
struct FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88) == 0x000001, "Wrong alignment on FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88");
static_assert(sizeof(FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88) == 0x000001, "Wrong size on FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88");
static_assert(offsetof(FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88, MovementResult) == 0x000000, "Member 'FindPlayer_C_OnSuccess_046049DF483FCA9EB69F85BA3AE72C88::MovementResult' has a wrong offset!");

// Function FindPlayer.FindPlayer_C.OnFail_046049DF483FCA9EB69F85BA3AE72C88
// 0x0001 (0x0001 - 0x0000)
struct FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88) == 0x000001, "Wrong alignment on FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88");
static_assert(sizeof(FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88) == 0x000001, "Wrong size on FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88");
static_assert(offsetof(FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88, MovementResult) == 0x000000, "Member 'FindPlayer_C_OnFail_046049DF483FCA9EB69F85BA3AE72C88::MovementResult' has a wrong offset!");

}

