#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Five_56Ammo_BP1

#include "Basic.hpp"


namespace SDK::Params
{

// Function 5_56Ammo_BP1.5_56Ammo_BP1_C.ExecuteUbergraph_5_56Ammo_BP1
// 0x0020 (0x0020 - 0x0000)
struct Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1) == 0x000008, "Wrong alignment on Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1");
static_assert(sizeof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1) == 0x000020, "Wrong size on Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1");
static_assert(offsetof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1, EntryPoint) == 0x000000, "Member 'Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1::EntryPoint' has a wrong offset!");
static_assert(offsetof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips) == 0x000010, "Member 'Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips' has a wrong offset!");
static_assert(offsetof(Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Five_56Ammo_BP1_C_ExecuteUbergraph_5_56Ammo_BP1::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

