#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Fuse_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Fuse_BP.Fuse_BP_C
// 0x0020 (0x0240 - 0x0220)
class AFuse_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       拾取提示; // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Fuse_BP(int32 EntryPoint);
	void 开启提示(bool bNewVisibility);
	void 更改旋转方向(float Pitch);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Fuse_BP_C">();
	}
	static class AFuse_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFuse_BP_C>();
	}
};
static_assert(alignof(AFuse_BP_C) == 0x000008, "Wrong alignment on AFuse_BP_C");
static_assert(sizeof(AFuse_BP_C) == 0x000240, "Wrong size on AFuse_BP_C");
static_assert(offsetof(AFuse_BP_C, UberGraphFrame) == 0x000220, "Member 'AFuse_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AFuse_BP_C, 拾取提示) == 0x000228, "Member 'AFuse_BP_C::拾取提示' has a wrong offset!");
static_assert(offsetof(AFuse_BP_C, StaticMesh) == 0x000230, "Member 'AFuse_BP_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AFuse_BP_C, DefaultSceneRoot) == 0x000238, "Member 'AFuse_BP_C::DefaultSceneRoot' has a wrong offset!");

}

