#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameStatement_Umg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass GameStatement_Umg.GameStatement_Umg_C
// 0x0038 (0x0298 - 0x0260)
class UGameStatement_Umg_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       消失;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border;                                            // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_79;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_516;                                     // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_735;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    自定义按钮; // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void StartGame();
	void ExecuteUbergraph_GameStatement_Umg(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GameStatement_Umg_C">();
	}
	static class UGameStatement_Umg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGameStatement_Umg_C>();
	}
};
static_assert(alignof(UGameStatement_Umg_C) == 0x000008, "Wrong alignment on UGameStatement_Umg_C");
static_assert(sizeof(UGameStatement_Umg_C) == 0x000298, "Wrong size on UGameStatement_Umg_C");
static_assert(offsetof(UGameStatement_Umg_C, UberGraphFrame) == 0x000260, "Member 'UGameStatement_Umg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, 消失) == 0x000268, "Member 'UGameStatement_Umg_C::消失' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, Border) == 0x000270, "Member 'UGameStatement_Umg_C::Border' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, Image_79) == 0x000278, "Member 'UGameStatement_Umg_C::Image_79' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, TextBlock_516) == 0x000280, "Member 'UGameStatement_Umg_C::TextBlock_516' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, TextBlock_735) == 0x000288, "Member 'UGameStatement_Umg_C::TextBlock_735' has a wrong offset!");
static_assert(offsetof(UGameStatement_Umg_C, 自定义按钮) == 0x000290, "Member 'UGameStatement_Umg_C::自定义按钮' has a wrong offset!");

}

