#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameMap_Struct

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct GameMap_Struct.GameMap_Struct
// 0x0098 (0x0098 - 0x0000)
struct FGameMap_Struct final
{
public:
	TArray<class UTexture2D*>                     场景图片_3_91C0EA554E509B49539B56A1596CFE7E; // 0x0000(0x0010)(Edit, BlueprintVisible)
	class FText                                   任务名称_20_AC549D9B495AEEC2E75FF88FC0290053; // 0x0010(0x0018)(Edit, BlueprintVisible)
	class FText                                   任务介绍_15_8B02C7EC453764F44A0CEDA394975C34; // 0x0028(0x0018)(Edit, BlueprintVisible)
	class FText                                   章节_17_254785B24D628055DAC18B822F512200; // 0x0040(0x0018)(Edit, BlueprintVisible)
	class FText                                   指引帮助_19_CF31A2CC40DF1E48AB6B3C8D2E6A06A7; // 0x0058(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UObject>                 level_24_A8E8775B4260002057E79C9B9C3770EA;         // 0x0070(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
static_assert(alignof(FGameMap_Struct) == 0x000008, "Wrong alignment on FGameMap_Struct");
static_assert(sizeof(FGameMap_Struct) == 0x000098, "Wrong size on FGameMap_Struct");
static_assert(offsetof(FGameMap_Struct, 场景图片_3_91C0EA554E509B49539B56A1596CFE7E) == 0x000000, "Member 'FGameMap_Struct::场景图片_3_91C0EA554E509B49539B56A1596CFE7E' has a wrong offset!");
static_assert(offsetof(FGameMap_Struct, 任务名称_20_AC549D9B495AEEC2E75FF88FC0290053) == 0x000010, "Member 'FGameMap_Struct::任务名称_20_AC549D9B495AEEC2E75FF88FC0290053' has a wrong offset!");
static_assert(offsetof(FGameMap_Struct, 任务介绍_15_8B02C7EC453764F44A0CEDA394975C34) == 0x000028, "Member 'FGameMap_Struct::任务介绍_15_8B02C7EC453764F44A0CEDA394975C34' has a wrong offset!");
static_assert(offsetof(FGameMap_Struct, 章节_17_254785B24D628055DAC18B822F512200) == 0x000040, "Member 'FGameMap_Struct::章节_17_254785B24D628055DAC18B822F512200' has a wrong offset!");
static_assert(offsetof(FGameMap_Struct, 指引帮助_19_CF31A2CC40DF1E48AB6B3C8D2E6A06A7) == 0x000058, "Member 'FGameMap_Struct::指引帮助_19_CF31A2CC40DF1E48AB6B3C8D2E6A06A7' has a wrong offset!");
static_assert(offsetof(FGameMap_Struct, level_24_A8E8775B4260002057E79C9B9C3770EA) == 0x000070, "Member 'FGameMap_Struct::level_24_A8E8775B4260002057E79C9B9C3770EA' has a wrong offset!");

}

