#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Ghost_GrandMa_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Ghost_GrandMa_BP.Ghost_GrandMa_BP_C.ExecuteUbergraph_Ghost_GrandMa_BP
// 0x0970 (0x0970 - 0x0000)
struct Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0074(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ___object_Variable;                                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ___object_Variable_1;                              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ___object_Variable_2;                              // 0x0098(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ___object_Variable_3;                              // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	class UWBP_HitCircle_C*                       CallFunc_Create_ReturnValue;                       // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_4;     // 0x00C8(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_3;               // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_2;               // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x2];                                       // 0x00DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_5;     // 0x00DC(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_7;     // 0x0104(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0114(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_8;     // 0x0118(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable_1;                                // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             ___object_Variable_4;                              // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             ___object_Variable_5;                              // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x2];                                      // 0x0142(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_9;            // 0x0144(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          ___bool_IsClosed_Variable_1;                       // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_1;                 // 0x0155(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_Hit;                                  // 0x0164(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_Event_Damage;                               // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_isMelee_;                             // 0x01F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F3[0x1];                                      // 0x01F3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01FC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0208(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0214(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0220(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0240(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0254(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x025C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0268(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0274(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ___object_Variable_6;                              // 0x0290(0x0010)(ConstParm, ReferenceParm)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x02A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x02BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x02C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x02D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x02E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x02EC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_1;            // 0x0375(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_1;         // 0x0376(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_377[0x1];                                      // 0x0377(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_1;                    // 0x0378(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_1;                // 0x037C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_1;                // 0x0380(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_1;             // 0x038C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_1;                  // 0x0398(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_1;            // 0x03A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_1;                 // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_1;                // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_1;            // 0x03C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_1;             // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_1;                 // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_1;            // 0x03D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_1;               // 0x03D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_1;              // 0x03DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_1;                // 0x03E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0401(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_402[0x2];                                      // 0x0402(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SCL_Pure_GetSafeFloat_ReturnValue;        // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_409[0x3];                                      // 0x0409(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x040C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0410(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0418(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0420(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0428(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_Array_Get_Item;                           // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_2;                 // 0x0441(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_442[0x2];                                      // 0x0442(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue_1;      // 0x0444(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_4;        // 0x0450(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x045C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0468(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0474(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_BoxTraceSingle_OutHit;                    // 0x0480(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BoxTraceSingle_ReturnValue;               // 0x0508(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_2;            // 0x0509(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_2;         // 0x050A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_50B[0x1];                                      // 0x050B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_2;                    // 0x050C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_2;                // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_2;                // 0x0514(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_2;             // 0x0520(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_2;                  // 0x052C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_2;            // 0x0538(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_544[0x4];                                      // 0x0544(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_2;                 // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_2;                // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_2;            // 0x0558(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_2;             // 0x0560(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_2;                 // 0x0568(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_2;            // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_2;               // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_2;              // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_2;                // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x058C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58D[0x3];                                      // 0x058D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ADS_DoorMaster_BP_C*                    K2Node_DynamicCast_AsDS_Door_Master_BP;            // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0598(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x05A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x05A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x05B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x05B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x05BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BD[0x3];                                      // 0x05BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x05C0(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0648(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0650(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_651[0x3];                                      // 0x0651(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_5;        // 0x0654(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_VectorVector_ReturnValue;      // 0x0660(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_661[0x3];                                      // 0x0661(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0664(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_6;        // 0x0668(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0674(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0680(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0708(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_709[0x3];                                      // 0x0709(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x070C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_71C[0x4];                                      // 0x071C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0720(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          CallFunc_GetAIController_ReturnValue_1;            // 0x0728(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_7;        // 0x0730(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation_1; // 0x073C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue_1; // 0x0748(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_749[0x3];                                      // 0x0749(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x074C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0750(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0754(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0758(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x075C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0768(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue_1;          // 0x0774(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit_1;               // 0x0780(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue_1;          // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit_3;            // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap_3;         // 0x080A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_80B[0x1];                                      // 0x080B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time_3;                    // 0x080C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance_3;                // 0x0810(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location_3;                // 0x0814(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint_3;             // 0x0820(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal_3;                  // 0x082C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal_3;            // 0x0838(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_844[0x4];                                      // 0x0844(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat_3;                 // 0x0848(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor_3;                // 0x0850(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent_3;            // 0x0858(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName_3;             // 0x0860(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem_3;                 // 0x0868(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex_3;            // 0x086C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex_3;               // 0x0870(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart_3;              // 0x0874(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd_3;                // 0x0880(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_88C[0x4];                                      // 0x088C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x0890(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0898(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0899(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x089A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89B[0x1];                                      // 0x089B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x089C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue_1;       // 0x08A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8AC[0x4];                                      // 0x08AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x08B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_8;        // 0x08B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x08C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x08C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_2;                       // 0x08CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8CD[0x3];                                      // 0x08CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_3;                  // 0x08D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x08E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8E1[0x7];                                      // 0x08E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x08E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGhost_GrandMa_Anim_C*                  K2Node_DynamicCast_AsGhost_Grand_Ma_Anim;          // 0x08F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x08F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8F9[0x3];                                      // 0x08F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x08FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0900(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0908(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0910(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable_3;                 // 0x0911(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_912[0x2];                                      // 0x0912(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0914(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0918(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable_3;                       // 0x0920(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_921[0x7];                                      // 0x0921(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0928(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue_1;                // 0x0938(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_9;        // 0x0940(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x094C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_94D[0x3];                                      // 0x094D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_10;       // 0x0950(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95C[0x4];                                      // 0x095C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue_1;    // 0x0960(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP) == 0x000008, "Wrong alignment on Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP");
static_assert(sizeof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP) == 0x000970, "Wrong size on Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, EntryPoint) == 0x000000, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000010, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x00001C, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_NotifyName_2) == 0x000020, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000028, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_NotifyName_1) == 0x000038, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_NotifyName) == 0x000050, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000058, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___name_Variable) == 0x000068, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___name_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_Variable) == 0x000070, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000074, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable) == 0x000088, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable_1) == 0x000090, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable_2) == 0x000098, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable_2' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A8, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable_3) == 0x0000B0, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable_3' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_Create_ReturnValue) == 0x0000C0, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000C8, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_MovementResult_3) == 0x0000D8, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_MovementResult_3' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_MovementResult_2) == 0x0000D9, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_MovementResult_2' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000DC, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___byte_Variable) == 0x0000EC, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___byte_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_6) == 0x0000F0, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_MovementResult_1) == 0x000100, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_7) == 0x000104, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CustomEvent_MovementResult) == 0x000114, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_8) == 0x000118, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___byte_Variable_1) == 0x000128, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_Variable_1) == 0x000129, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable_4) == 0x000130, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable_4' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___object_Variable_5) == 0x000138, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___object_Variable_5' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_Has_Been_Initd_Variable) == 0x000140, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_IsClosed_Variable) == 0x000141, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_CreateDelegate_OutputDelegate_9) == 0x000144, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_IsClosed_Variable_1) == 0x000154, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, ___bool_Has_Been_Initd_Variable_1) == 0x000155, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::___bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000158, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_Event_Hit) == 0x000164, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_Event_Hit' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_Event_Damage) == 0x0001EC, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_Event_Damage' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, K2Node_Event_isMelee_) == 0x0001F0, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::K2Node_Event_isMelee_' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_bBlockingHit) == 0x0001F1, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001F2, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_Time) == 0x0001F4, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_Distance) == 0x0001F8, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_Location) == 0x0001FC, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_ImpactPoint) == 0x000208, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_Normal) == 0x000214, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_ImpactNormal) == 0x000220, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_PhysMat) == 0x000230, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_HitActor) == 0x000238, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_HitComponent) == 0x000240, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_HitBoneName) == 0x000248, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_HitItem) == 0x000250, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_ElementIndex) == 0x000254, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_FaceIndex) == 0x000258, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_TraceStart) == 0x00025C, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_BreakHitResult_TraceEnd) == 0x000268, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000274, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000280, "Member 'Ghost_GrandMa_BP_C_ExecuteUbergraph_Ghost_GrandMa_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
