#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HandlePick_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function HandlePick_BP.HandlePick_BP_C.ExecuteUbergraph_HandlePick_BP
// 0x0020 (0x0020 - 0x0000)
struct HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips;        // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP) == 0x000008, "Wrong alignment on HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP");
static_assert(sizeof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP) == 0x000020, "Wrong size on HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP");
static_assert(offsetof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP, EntryPoint) == 0x000000, "Member 'HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips) == 0x000010, "Member 'HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips' has a wrong offset!");
static_assert(offsetof(HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'HandlePick_BP_C_ExecuteUbergraph_HandlePick_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

