#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Handle_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Handle_BP.Handle_BP_C.ExecuteUbergraph_Handle_BP
// 0x0008 (0x0008 - 0x0000)
struct Handle_BP_C_ExecuteUbergraph_Handle_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bNewVisibility;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Handle_BP_C_ExecuteUbergraph_Handle_BP) == 0x000004, "Wrong alignment on Handle_BP_C_ExecuteUbergraph_Handle_BP");
static_assert(sizeof(Handle_BP_C_ExecuteUbergraph_Handle_BP) == 0x000008, "Wrong size on Handle_BP_C_ExecuteUbergraph_Handle_BP");
static_assert(offsetof(Handle_BP_C_ExecuteUbergraph_Handle_BP, EntryPoint) == 0x000000, "Member 'Handle_BP_C_ExecuteUbergraph_Handle_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Handle_BP_C_ExecuteUbergraph_Handle_BP, K2Node_CustomEvent_bNewVisibility) == 0x000004, "Member 'Handle_BP_C_ExecuteUbergraph_Handle_BP::K2Node_CustomEvent_bNewVisibility' has a wrong offset!");

// Function Handle_BP.Handle_BP_C.开启提示
// 0x0001 (0x0001 - 0x0000)
struct Handle_BP_C_开启提示 final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Handle_BP_C_开启提示) == 0x000001, "Wrong alignment on Handle_BP_C_开启提示");
static_assert(sizeof(Handle_BP_C_开启提示) == 0x000001, "Wrong size on Handle_BP_C_开启提示");
static_assert(offsetof(Handle_BP_C_开启提示, bNewVisibility) == 0x000000, "Member 'Handle_BP_C_开启提示::bNewVisibility' has a wrong offset!");

}

