#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGame_UI_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass InGame_UI_BP.InGame_UI_BP_C
// 0x0018 (0x0238 - 0x0220)
class AInGame_UI_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       Widget;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_InGame_UI_BP(int32 EntryPoint);
	void 背包子弹数量更改();
	void 当前子弹数量更改(int32 Value);
	void 显示AMMO();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"InGame_UI_BP_C">();
	}
	static class AInGame_UI_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AInGame_UI_BP_C>();
	}
};
static_assert(alignof(AInGame_UI_BP_C) == 0x000008, "Wrong alignment on AInGame_UI_BP_C");
static_assert(sizeof(AInGame_UI_BP_C) == 0x000238, "Wrong size on AInGame_UI_BP_C");
static_assert(offsetof(AInGame_UI_BP_C, UberGraphFrame) == 0x000220, "Member 'AInGame_UI_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AInGame_UI_BP_C, Widget) == 0x000228, "Member 'AInGame_UI_BP_C::Widget' has a wrong offset!");
static_assert(offsetof(AInGame_UI_BP_C, DefaultSceneRoot) == 0x000230, "Member 'AInGame_UI_BP_C::DefaultSceneRoot' has a wrong offset!");

}

