#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGameGameMode

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InGameGameMode.InGameGameMode_C.ExecuteUbergraph_InGameGameMode
// 0x0048 (0x0048 - 0x0000)
struct InGameGameMode_C_ExecuteUbergraph_InGameGameMode final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x2];                                       // 0x0022(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode) == 0x000008, "Wrong alignment on InGameGameMode_C_ExecuteUbergraph_InGameGameMode");
static_assert(sizeof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode) == 0x000048, "Wrong size on InGameGameMode_C_ExecuteUbergraph_InGameGameMode");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, EntryPoint) == 0x000000, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, CallFunc_GetPlayerPawn_ReturnValue) == 0x000008, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, ___int_Variable) == 0x000010, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::___int_Variable' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, K2Node_DynamicCast_AsPlayer_BP) == 0x000018, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, K2Node_CreateDelegate_OutputDelegate) == 0x000024, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000034, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGameGameMode_C_ExecuteUbergraph_InGameGameMode, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'InGameGameMode_C_ExecuteUbergraph_InGameGameMode::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

