#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InGame_UI_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function InGame_UI_BP.InGame_UI_BP_C.ExecuteUbergraph_InGame_UI_BP
// 0x0078 (0x0078 - 0x0000)
struct InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGame_Umg_C*                          K2Node_DynamicCast_AsIn_Game_Umg;                  // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Value;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInGame_Umg_C*                          K2Node_DynamicCast_AsIn_Game_Umg_1;                // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0040(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGame_Umg_C*                          K2Node_DynamicCast_AsIn_Game_Umg_2;                // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP) == 0x000008, "Wrong alignment on InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP");
static_assert(sizeof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP) == 0x000078, "Wrong size on InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, EntryPoint) == 0x000000, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000008, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_AsIn_Game_Umg) == 0x000010, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_AsIn_Game_Umg' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000020, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_CustomEvent_Value) == 0x000028, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_CustomEvent_Value' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_AsIn_Game_Umg_1) == 0x000030, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_AsIn_Game_Umg_1' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, CallFunc_Conv_IntToText_ReturnValue) == 0x000040, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, CallFunc_PlayAnimation_ReturnValue) == 0x000058, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, CallFunc_GetUserWidgetObject_ReturnValue_2) == 0x000060, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::CallFunc_GetUserWidgetObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_AsIn_Game_Umg_2) == 0x000068, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_AsIn_Game_Umg_2' has a wrong offset!");
static_assert(offsetof(InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'InGame_UI_BP_C_ExecuteUbergraph_InGame_UI_BP::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

// Function InGame_UI_BP.InGame_UI_BP_C.当前子弹数量更改
// 0x0004 (0x0004 - 0x0000)
struct InGame_UI_BP_C_当前子弹数量更改 final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InGame_UI_BP_C_当前子弹数量更改) == 0x000004, "Wrong alignment on InGame_UI_BP_C_当前子弹数量更改");
static_assert(sizeof(InGame_UI_BP_C_当前子弹数量更改) == 0x000004, "Wrong size on InGame_UI_BP_C_当前子弹数量更改");
static_assert(offsetof(InGame_UI_BP_C_当前子弹数量更改, Value) == 0x000000, "Member 'InGame_UI_BP_C_当前子弹数量更改::Value' has a wrong offset!");

}

