#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventorySystem_Component

#include "Basic.hpp"

#include "InventoryData_Struct_structs.hpp"


namespace SDK::Params
{

// Function InventorySystem_Component.InventorySystem_Component_C.ExecuteUbergraph_InventorySystem_Component
// 0x0A78 (0x0A78 - 0x0000)
struct InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack;                 // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  K2Node_CustomEvent_ItemData_1;                     // 0x0048(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  K2Node_CustomEvent_ItemData;                       // 0x00E8(0x0098)(HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_SetFieldsInStruct_StructOut;                // 0x0188(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_Current;                        // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Target;                         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x022C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UQuestTips_UMG_C*>               CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0230(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FInventoryData_Struct                  CallFunc_Array_Get_Item;                           // 0x0240(0x0098)(HasGetValueTypeHash)
	class UQuestTips_UMG_C*                       CallFunc_Array_Get_Item_1;                         // 0x02D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x02E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x02E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E6[0x2];                                      // 0x02E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  CallFunc_Array_Get_Item_2;                         // 0x02E8(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_384[0x4];                                      // 0x0384(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  K2Node_SetFieldsInStruct_StructOut_1;              // 0x0388(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0420(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_421[0x7];                                      // 0x0421(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  K2Node_MakeStruct_InventoryData_Struct;            // 0x0428(0x0098)(HasGetValueTypeHash)
	class ABackroom_Quest_BP_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_____;                           // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_CustomEvent________;                        // 0x04D0(0x0098)(HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_MakeStruct_InventoryData_Struct_1;          // 0x0568(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0600(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0604(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_SetFieldsInStruct_StructOut_2;              // 0x0608(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x06A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_True_if_break_was_hit_Variable_1;          // 0x06A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x06A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x06A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6A4[0x4];                                      // 0x06A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBackpack_Details_C*                    CallFunc_Create_ReturnValue;                       // 0x06A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInventoryData_Struct                  CallFunc_Array_Get_Item_3;                         // 0x06B0(0x0098)(HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_SetFieldsInStruct_StructOut_3;              // 0x0748(0x0098)(HasGetValueTypeHash)
	struct FInventoryData_Struct                  K2Node_SetFieldsInStruct_StructOut_4;              // 0x07E0(0x0098)(HasGetValueTypeHash)
	struct FInventoryData_Struct                  CallFunc_Array_Get_Item_4;                         // 0x0878(0x0098)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0910(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0914(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0915(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_916[0x2];                                      // 0x0916(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Backpack_Weapon_C*                  CallFunc_Create_ReturnValue_1;                     // 0x0918(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackpack_DragObject_UMG_C*             CallFunc_Create_ReturnValue_2;                     // 0x0920(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_______;                         // 0x0928(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_929[0x7];                                      // 0x0929(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon_Master_C*                       K2Node_CustomEvent_weapon;                         // 0x0930(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0938(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack_1;               // 0x0940(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0950(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_951[0x7];                                      // 0x0951(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc___UI____UI;                               // 0x0958(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack_2;               // 0x0960(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0970(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_971[0x7];                                      // 0x0971(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack_3;               // 0x0978(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack_4;               // 0x0990(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x09A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IWBI_Backpack_C>       K2Node_DynamicCast_AsWBI_Backpack_5;               // 0x09A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x09B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9B9[0x7];                                      // 0x09B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  ___struct_Variable;                                // 0x09C0(0x0098)(ConstParm, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0A58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0A5C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x0A60(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A61[0x3];                                      // 0x0A61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0A64(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A69[0x7];                                      // 0x0A69(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component) == 0x000008, "Wrong alignment on InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component");
static_assert(sizeof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component) == 0x000A78, "Wrong size on InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, EntryPoint) == 0x000000, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::EntryPoint' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack) == 0x000008, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Variable) == 0x00001C, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Variable' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Loop_Counter_Variable) == 0x000024, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Add_IntInt_ReturnValue_1) == 0x000028, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Loop_Counter_Variable_1) == 0x00002C, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Add_IntInt_ReturnValue_2) == 0x000030, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___bool_True_if_break_was_hit_Variable) == 0x000034, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Array_Index_Variable) == 0x000038, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Not_PreBool_ReturnValue) == 0x00003C, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Array_Index_Variable_1) == 0x000040, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_ItemData_1) == 0x000048, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_ItemData_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Length_ReturnValue) == 0x0000E0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SwitchEnum_CmpSuccess) == 0x0000E4, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_ItemData) == 0x0000E8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_ItemData' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Variable_1) == 0x000180, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Subtract_IntInt_ReturnValue) == 0x000184, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SetFieldsInStruct_StructOut) == 0x000188, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000220, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_Current) == 0x000224, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_Current' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_Target) == 0x000228, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_Target' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Array_Index_Variable_2) == 0x00022C, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000230, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Get_Item) == 0x000240, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Get_Item_1) == 0x0002D8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Add_IntInt_ReturnValue_3) == 0x0002E0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0002E4, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x0002E5, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Get_Item_2) == 0x0002E8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Length_ReturnValue_1) == 0x000380, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SetFieldsInStruct_StructOut_1) == 0x000388, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SetFieldsInStruct_StructOut_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Less_IntInt_ReturnValue) == 0x000420, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_MakeStruct_InventoryData_Struct) == 0x000428, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_MakeStruct_InventoryData_Struct' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_GetActorOfClass_ReturnValue) == 0x0004C0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Add_ReturnValue) == 0x0004C8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_____) == 0x0004CC, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent________) == 0x0004D0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent________' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_MakeStruct_InventoryData_Struct_1) == 0x000568, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_MakeStruct_InventoryData_Struct_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Add_ReturnValue_1) == 0x000600, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000604, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SetFieldsInStruct_StructOut_2) == 0x000608, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SetFieldsInStruct_StructOut_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x0006A0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___bool_True_if_break_was_hit_Variable_1) == 0x0006A1, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_LessEqual_IntInt_ReturnValue_2) == 0x0006A2, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_LessEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Not_PreBool_ReturnValue_1) == 0x0006A3, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Create_ReturnValue) == 0x0006A8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Get_Item_3) == 0x0006B0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SetFieldsInStruct_StructOut_3) == 0x000748, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SetFieldsInStruct_StructOut_3' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_SetFieldsInStruct_StructOut_4) == 0x0007E0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_SetFieldsInStruct_StructOut_4' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Get_Item_4) == 0x000878, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Length_ReturnValue_2) == 0x000910, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Less_IntInt_ReturnValue_1) == 0x000914, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_BooleanAND_ReturnValue) == 0x000915, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Create_ReturnValue_1) == 0x000918, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Create_ReturnValue_2) == 0x000920, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_______) == 0x000928, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_______' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_CustomEvent_weapon) == 0x000930, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_CustomEvent_weapon' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_GetOwner_ReturnValue) == 0x000938, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack_1) == 0x000940, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess_1) == 0x000950, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc___UI____UI) == 0x000958, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc___UI____UI' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack_2) == 0x000960, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess_2) == 0x000970, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack_3) == 0x000978, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack_3' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess_3) == 0x000988, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack_4) == 0x000990, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack_4' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess_4) == 0x0009A0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_AsWBI_Backpack_5) == 0x0009A8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_AsWBI_Backpack_5' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, K2Node_DynamicCast_bSuccess_5) == 0x0009B8, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___struct_Variable) == 0x0009C0, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___struct_Variable' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, ___int_Loop_Counter_Variable_2) == 0x000A58, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Array_Add_ReturnValue_2) == 0x000A5C, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Less_IntInt_ReturnValue_2) == 0x000A60, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_Add_IntInt_ReturnValue_4) == 0x000A64, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_BooleanAND_ReturnValue_1) == 0x000A68, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component, CallFunc_GetOwner_ReturnValue_1) == 0x000A70, "Member 'InventorySystem_Component_C_ExecuteUbergraph_InventorySystem_Component::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");

// Function InventorySystem_Component.InventorySystem_Component_C.添加武器
// 0x0010 (0x0010 - 0x0000)
struct InventorySystem_Component_C_添加武器 final
{
public:
	bool                                          是否是主武器; // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon_Master_C*                       weapon;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_添加武器) == 0x000008, "Wrong alignment on InventorySystem_Component_C_添加武器");
static_assert(sizeof(InventorySystem_Component_C_添加武器) == 0x000010, "Wrong size on InventorySystem_Component_C_添加武器");
static_assert(offsetof(InventorySystem_Component_C_添加武器, 是否是主武器) == 0x000000, "Member 'InventorySystem_Component_C_添加武器::是否是主武器' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_添加武器, weapon) == 0x000008, "Member 'InventorySystem_Component_C_添加武器::weapon' has a wrong offset!");

// Function InventorySystem_Component.InventorySystem_Component_C.丢弃物品
// 0x00A0 (0x00A0 - 0x0000)
struct InventorySystem_Component_C_丢弃物品 final
{
public:
	int32                                         丢弃数量; // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInventoryData_Struct                  丢弃物品的数据; // 0x0008(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_丢弃物品) == 0x000008, "Wrong alignment on InventorySystem_Component_C_丢弃物品");
static_assert(sizeof(InventorySystem_Component_C_丢弃物品) == 0x0000A0, "Wrong size on InventorySystem_Component_C_丢弃物品");
static_assert(offsetof(InventorySystem_Component_C_丢弃物品, 丢弃数量) == 0x000000, "Member 'InventorySystem_Component_C_丢弃物品::丢弃数量' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_丢弃物品, 丢弃物品的数据) == 0x000008, "Member 'InventorySystem_Component_C_丢弃物品::丢弃物品的数据' has a wrong offset!");

// Function InventorySystem_Component.InventorySystem_Component_C.物品对调
// 0x0008 (0x0008 - 0x0000)
struct InventorySystem_Component_C_物品对调 final
{
public:
	int32                                         Current;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Target;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_物品对调) == 0x000004, "Wrong alignment on InventorySystem_Component_C_物品对调");
static_assert(sizeof(InventorySystem_Component_C_物品对调) == 0x000008, "Wrong size on InventorySystem_Component_C_物品对调");
static_assert(offsetof(InventorySystem_Component_C_物品对调, Current) == 0x000000, "Member 'InventorySystem_Component_C_物品对调::Current' has a wrong offset!");
static_assert(offsetof(InventorySystem_Component_C_物品对调, Target) == 0x000004, "Member 'InventorySystem_Component_C_物品对调::Target' has a wrong offset!");

// Function InventorySystem_Component.InventorySystem_Component_C.使用物品
// 0x0098 (0x0098 - 0x0000)
struct InventorySystem_Component_C_使用物品 final
{
public:
	struct FInventoryData_Struct                  ItemData;                                          // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_使用物品) == 0x000008, "Wrong alignment on InventorySystem_Component_C_使用物品");
static_assert(sizeof(InventorySystem_Component_C_使用物品) == 0x000098, "Wrong size on InventorySystem_Component_C_使用物品");
static_assert(offsetof(InventorySystem_Component_C_使用物品, ItemData) == 0x000000, "Member 'InventorySystem_Component_C_使用物品::ItemData' has a wrong offset!");

// Function InventorySystem_Component.InventorySystem_Component_C.添加物品
// 0x0098 (0x0098 - 0x0000)
struct InventorySystem_Component_C_添加物品 final
{
public:
	struct FInventoryData_Struct                  ItemData;                                          // 0x0000(0x0098)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(InventorySystem_Component_C_添加物品) == 0x000008, "Wrong alignment on InventorySystem_Component_C_添加物品");
static_assert(sizeof(InventorySystem_Component_C_添加物品) == 0x000098, "Wrong size on InventorySystem_Component_C_添加物品");
static_assert(offsetof(InventorySystem_Component_C_添加物品, ItemData) == 0x000000, "Member 'InventorySystem_Component_C_添加物品::ItemData' has a wrong offset!");

}

