#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyboardKey

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function KeyboardKey.KeyboardKey_C.ExecuteUbergraph_KeyboardKey
// 0x0060 (0x0060 - 0x0000)
struct KeyboardKey_C_ExecuteUbergraph_KeyboardKey final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey) == 0x000008, "Wrong alignment on KeyboardKey_C_ExecuteUbergraph_KeyboardKey");
static_assert(sizeof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey) == 0x000060, "Wrong size on KeyboardKey_C_ExecuteUbergraph_KeyboardKey");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, EntryPoint) == 0x000000, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, K2Node_MakeStruct_SlateColor) == 0x000008, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, K2Node_Event_IsDesignTime) == 0x000030, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000038, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_BreakVector2D_X) == 0x000040, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000048, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000050, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000054, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyboardKey_C_ExecuteUbergraph_KeyboardKey, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'KeyboardKey_C_ExecuteUbergraph_KeyboardKey::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function KeyboardKey.KeyboardKey_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct KeyboardKey_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(KeyboardKey_C_PreConstruct) == 0x000001, "Wrong alignment on KeyboardKey_C_PreConstruct");
static_assert(sizeof(KeyboardKey_C_PreConstruct) == 0x000001, "Wrong size on KeyboardKey_C_PreConstruct");
static_assert(offsetof(KeyboardKey_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'KeyboardKey_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

