#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyboardKey

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeyboardKey.KeyboardKey_C
// 0x0048 (0x02A8 - 0x0260)
class UKeyboardKey_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_0;                                     // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_72;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             KeyTexture;                                        // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              KeySize;                                           // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Specified_Color;                                   // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UKeyBoardShow_C*                        KeyBoardShow;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KeyboardKey(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeyboardKey_C">();
	}
	static class UKeyboardKey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyboardKey_C>();
	}
};
static_assert(alignof(UKeyboardKey_C) == 0x000008, "Wrong alignment on UKeyboardKey_C");
static_assert(sizeof(UKeyboardKey_C) == 0x0002A8, "Wrong size on UKeyboardKey_C");
static_assert(offsetof(UKeyboardKey_C, UberGraphFrame) == 0x000260, "Member 'UKeyboardKey_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, CanvasPanel_0) == 0x000268, "Member 'UKeyboardKey_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, Image) == 0x000270, "Member 'UKeyboardKey_C::Image' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, Image_72) == 0x000278, "Member 'UKeyboardKey_C::Image_72' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, KeyTexture) == 0x000280, "Member 'UKeyboardKey_C::KeyTexture' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, KeySize) == 0x000288, "Member 'UKeyboardKey_C::KeySize' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, Specified_Color) == 0x000290, "Member 'UKeyboardKey_C::Specified_Color' has a wrong offset!");
static_assert(offsetof(UKeyboardKey_C, KeyBoardShow) == 0x0002A0, "Member 'UKeyboardKey_C::KeyBoardShow' has a wrong offset!");

}

