#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyBoardShow

#include "Basic.hpp"


namespace SDK::Params
{

// Function KeyBoardShow.KeyBoardShow_C.ExecuteUbergraph_KeyBoardShow
// 0x0048 (0x0048 - 0x0000)
struct KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APlayer_BP_C*>                   CallFunc_GetAllActorsOfClass_OutActors;            // 0x0020(0x0010)(ReferenceParm)
	class APlayer_BP_C*                           CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow) == 0x000008, "Wrong alignment on KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow");
static_assert(sizeof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow) == 0x000048, "Wrong size on KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, EntryPoint) == 0x000000, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::EntryPoint' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, ___bool_Has_Been_Initd_Variable) == 0x000004, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, ___bool_IsClosed_Variable) == 0x000005, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, CallFunc_GetPlayerController_ReturnValue) == 0x000018, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, CallFunc_GetAllActorsOfClass_OutActors) == 0x000020, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, CallFunc_Array_Get_Item) == 0x000030, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'KeyBoardShow_C_ExecuteUbergraph_KeyBoardShow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

}

