#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: KeyBoardShow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass KeyBoardShow.KeyBoardShow_C
// 0x0030 (0x0290 - 0x0260)
class UKeyBoardShow_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       One;                                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UKeyboardLayout_C*                      KeyboardLayout;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_92;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    自定义按钮; // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayer_BP_C*                           PlayerRef;                                         // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_KeyBoardShow(int32 EntryPoint);
	void StartGame();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"KeyBoardShow_C">();
	}
	static class UKeyBoardShow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UKeyBoardShow_C>();
	}
};
static_assert(alignof(UKeyBoardShow_C) == 0x000008, "Wrong alignment on UKeyBoardShow_C");
static_assert(sizeof(UKeyBoardShow_C) == 0x000290, "Wrong size on UKeyBoardShow_C");
static_assert(offsetof(UKeyBoardShow_C, UberGraphFrame) == 0x000260, "Member 'UKeyBoardShow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UKeyBoardShow_C, One) == 0x000268, "Member 'UKeyBoardShow_C::One' has a wrong offset!");
static_assert(offsetof(UKeyBoardShow_C, KeyboardLayout) == 0x000270, "Member 'UKeyBoardShow_C::KeyboardLayout' has a wrong offset!");
static_assert(offsetof(UKeyBoardShow_C, TextBlock_92) == 0x000278, "Member 'UKeyBoardShow_C::TextBlock_92' has a wrong offset!");
static_assert(offsetof(UKeyBoardShow_C, 自定义按钮) == 0x000280, "Member 'UKeyBoardShow_C::自定义按钮' has a wrong offset!");
static_assert(offsetof(UKeyBoardShow_C, PlayerRef) == 0x000288, "Member 'UKeyBoardShow_C::PlayerRef' has a wrong offset!");

}

