#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: List_UMG

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass List_UMG.List_UMG_C
// 0x0038 (0x0298 - 0x0260)
class UList_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_53;                                      // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0270(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FLinearColor                           Specified_Color;                                   // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_List_UMG(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"List_UMG_C">();
	}
	static class UList_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UList_UMG_C>();
	}
};
static_assert(alignof(UList_UMG_C) == 0x000008, "Wrong alignment on UList_UMG_C");
static_assert(sizeof(UList_UMG_C) == 0x000298, "Wrong size on UList_UMG_C");
static_assert(offsetof(UList_UMG_C, UberGraphFrame) == 0x000260, "Member 'UList_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UList_UMG_C, TextBlock_53) == 0x000268, "Member 'UList_UMG_C::TextBlock_53' has a wrong offset!");
static_assert(offsetof(UList_UMG_C, Name_0) == 0x000270, "Member 'UList_UMG_C::Name_0' has a wrong offset!");
static_assert(offsetof(UList_UMG_C, Specified_Color) == 0x000288, "Member 'UList_UMG_C::Specified_Color' has a wrong offset!");

}

