#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Loading_UMG

#include "Basic.hpp"

#include "GameMap_Struct_structs.hpp"


namespace SDK::Params
{

// Function Loading_UMG.Loading_UMG_C.ExecuteUbergraph_Loading_UMG
// 0x01C8 (0x01C8 - 0x0000)
struct Loading_UMG_C_ExecuteUbergraph_Loading_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                ___object_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class A主界面音效_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A主界面音效_C* CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0050(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameMap_Struct                        CallFunc_Map_Find_Value;                           // 0x0078(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Random_OutItem;                     // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameMap_Struct                        CallFunc_Map_Find_Value_1;                         // 0x0128(0x0098)(HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue_1;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG) == 0x000008, "Wrong alignment on Loading_UMG_C_ExecuteUbergraph_Loading_UMG");
static_assert(sizeof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG) == 0x0001C8, "Wrong size on Loading_UMG_C_ExecuteUbergraph_Loading_UMG");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, EntryPoint) == 0x000000, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, ___object_Variable) == 0x000008, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::___object_Variable' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Array_Get_Item) == 0x000028, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, K2Node_CustomEvent_Loaded) == 0x000048, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, K2Node_CreateDelegate_OutputDelegate) == 0x000050, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000060, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Conv_StringToName_ReturnValue) == 0x000070, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Map_Find_Value) == 0x000078, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Map_Find_ReturnValue) == 0x000110, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Array_Random_OutItem) == 0x000118, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Array_Random_OutIndex) == 0x000120, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Map_Find_Value_1) == 0x000128, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Map_Find_Value_1' has a wrong offset!");
static_assert(offsetof(Loading_UMG_C_ExecuteUbergraph_Loading_UMG, CallFunc_Map_Find_ReturnValue_1) == 0x0001C0, "Member 'Loading_UMG_C_ExecuteUbergraph_Loading_UMG::CallFunc_Map_Find_ReturnValue_1' has a wrong offset!");

// Function Loading_UMG.Loading_UMG_C.OnLoaded_332044D74990B7743D056AB93242FBAD
// 0x0008 (0x0008 - 0x0000)
struct Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD) == 0x000008, "Wrong alignment on Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD");
static_assert(sizeof(Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD) == 0x000008, "Wrong size on Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD");
static_assert(offsetof(Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD, Loaded) == 0x000000, "Member 'Loading_UMG_C_OnLoaded_332044D74990B7743D056AB93242FBAD::Loaded' has a wrong offset!");

}

