#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mainmenu_Map

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Mainmenu_Map.Mainmenu_Map_C
// 0x00B0 (0x02D8 - 0x0228)
class AMainmenu_Map_C final : public ALevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0228(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Finish;                                            // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMainMenu_UMG_C*                        MainMenu;                                          // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Pitch;                                             // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Yaw;                                               // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Camera;                                            // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       WeaponCamera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       衣服camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       面部Camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       头发camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       裤子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       鞋子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       人物camera_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       WeaponCamera2_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       WeaponCamera3_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0290(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomCharacter_C*                     CustomCharacter_2_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACustomWeapon_BP_C*                     CustomWeapon_BP_2_ExecuteUbergraph_Mainmenu_Map_RefProperty; // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor11_EdGraph_0_RefProperty;       // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor10_EdGraph_0_RefProperty;       // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor9_2_EdGraph_0_RefProperty;      // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor7_3_EdGraph_0_RefProperty;      // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor6_4_EdGraph_0_RefProperty;      // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACineCameraActor*                       MainCineCameraActor2_5_EdGraph_0_RefProperty;      // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void 随机选择摄像机(class AActor** Output_Get);
	void InpActEvt_R_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void 进入更换服装();
	void 返回主界面();
	void 感谢名单();
	void 制作者();
	void 设置();
	void 切换地图机位();
	void 进入自定义武器();
	void 切换面部();
	void 切换衣服();
	void 切换头发();
	void 切换裤子();
	void 切换鞋子();
	void 切换人物();
	void 倍镜视角();
	void 选择武器视角();
	void 枪口视角();
	void 返回更换服装();
	void 创建主界面菜单();
	void 切换相机();
	void ExecuteUbergraph_Mainmenu_Map(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Mainmenu_Map_C">();
	}
	static class AMainmenu_Map_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainmenu_Map_C>();
	}
};
static_assert(alignof(AMainmenu_Map_C) == 0x000008, "Wrong alignment on AMainmenu_Map_C");
static_assert(sizeof(AMainmenu_Map_C) == 0x0002D8, "Wrong size on AMainmenu_Map_C");
static_assert(offsetof(AMainmenu_Map_C, UberGraphFrame) == 0x000228, "Member 'AMainmenu_Map_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, Finish) == 0x000230, "Member 'AMainmenu_Map_C::Finish' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainMenu) == 0x000238, "Member 'AMainmenu_Map_C::MainMenu' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, Pitch) == 0x000240, "Member 'AMainmenu_Map_C::Pitch' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, Yaw) == 0x000244, "Member 'AMainmenu_Map_C::Yaw' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, Camera) == 0x000248, "Member 'AMainmenu_Map_C::Camera' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, WeaponCamera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000250, "Member 'AMainmenu_Map_C::WeaponCamera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 衣服camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000258, "Member 'AMainmenu_Map_C::衣服camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 面部Camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000260, "Member 'AMainmenu_Map_C::面部Camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 头发camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000268, "Member 'AMainmenu_Map_C::头发camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 裤子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000270, "Member 'AMainmenu_Map_C::裤子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 鞋子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000278, "Member 'AMainmenu_Map_C::鞋子camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, 人物camera_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000280, "Member 'AMainmenu_Map_C::人物camera_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, WeaponCamera2_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000288, "Member 'AMainmenu_Map_C::WeaponCamera2_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, WeaponCamera3_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000290, "Member 'AMainmenu_Map_C::WeaponCamera3_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, CustomCharacter_2_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x000298, "Member 'AMainmenu_Map_C::CustomCharacter_2_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, CustomWeapon_BP_2_ExecuteUbergraph_Mainmenu_Map_RefProperty) == 0x0002A0, "Member 'AMainmenu_Map_C::CustomWeapon_BP_2_ExecuteUbergraph_Mainmenu_Map_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor11_EdGraph_0_RefProperty) == 0x0002A8, "Member 'AMainmenu_Map_C::MainCineCameraActor11_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor10_EdGraph_0_RefProperty) == 0x0002B0, "Member 'AMainmenu_Map_C::MainCineCameraActor10_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor9_2_EdGraph_0_RefProperty) == 0x0002B8, "Member 'AMainmenu_Map_C::MainCineCameraActor9_2_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor7_3_EdGraph_0_RefProperty) == 0x0002C0, "Member 'AMainmenu_Map_C::MainCineCameraActor7_3_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor6_4_EdGraph_0_RefProperty) == 0x0002C8, "Member 'AMainmenu_Map_C::MainCineCameraActor6_4_EdGraph_0_RefProperty' has a wrong offset!");
static_assert(offsetof(AMainmenu_Map_C, MainCineCameraActor2_5_EdGraph_0_RefProperty) == 0x0002D0, "Member 'AMainmenu_Map_C::MainCineCameraActor2_5_EdGraph_0_RefProperty' has a wrong offset!");

}

