#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainMenu_UMG

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function MainMenu_UMG.MainMenu_UMG_C.ExecuteUbergraph_MainMenu_UMG
// 0x0140 (0x0140 - 0x0000)
struct MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UProducer_Umg_C*                        CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USettingUmg_C*                          CallFunc_Create_ReturnValue_1;                     // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UUserWidget*>                    CallFunc_GetAllWidgetsWithInterface_FoundWidgets;  // 0x0060(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UthanksList_UMG_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IUISettingInterface_C> K2Node_DynamicCast_AsUISetting_Interface;          // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCustomWeapon_UMG_C*                    CallFunc_Create_ReturnValue_3;                     // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomCharacterUMG_C*                  CallFunc_Create_ReturnValue_4;                     // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapSelect_UMG_C*                       CallFunc_Create_ReturnValue_5;                     // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDifficultySelection_UMG_C*             CallFunc_Create_ReturnValue_6;                     // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULoading_UMG_C*                         CallFunc_Create_ReturnValue_7;                     // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UExitgameConfirmation_UMG_C*            CallFunc_Create_ReturnValue_8;                     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x2];                                      // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              CallFunc_GetScreenResolution_ReturnValue;          // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG) == 0x000008, "Wrong alignment on MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG");
static_assert(sizeof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG) == 0x000140, "Wrong size on MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, EntryPoint) == 0x000000, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, ___bool_Has_Been_Initd_Variable) == 0x000004, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_Event_MyGeometry) == 0x000008, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_Event_InDeltaTime) == 0x000040, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, ___bool_IsClosed_Variable) == 0x000044, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000048, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue) == 0x000050, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_1) == 0x000058, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetAllWidgetsWithInterface_FoundWidgets) == 0x000060, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetAllWidgetsWithInterface_FoundWidgets' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_2) == 0x000070, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Array_Length_ReturnValue) == 0x000078, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000080, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, ___int_Array_Index_Variable) == 0x000088, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Array_Get_Item) == 0x000090, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_DynamicCast_AsUISetting_Interface) == 0x000098, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_DynamicCast_AsUISetting_Interface' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_3) == 0x0000B0, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_4) == 0x0000B8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0000C0, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_StartCameraShake_ReturnValue) == 0x0000D0, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_StartCameraShake_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_5) == 0x0000D8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_6) == 0x0000E0, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetPlayerController_ReturnValue) == 0x0000E8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_7) == 0x0000F0, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Create_ReturnValue_8) == 0x0000F8, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Create_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetGameUserSettings_ReturnValue) == 0x000100, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetGameInstance_ReturnValue) == 0x000108, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_DynamicCast_AsMy_Game_Instance) == 0x000110, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_DynamicCast_AsMy_Game_Instance' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, K2Node_DynamicCast_bSuccess_1) == 0x000118, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000119, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, ___int_Loop_Counter_Variable) == 0x00011C, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x000120, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Less_IntInt_ReturnValue) == 0x000128, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x00012C, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000130, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG, CallFunc_GetScreenResolution_ReturnValue) == 0x000138, "Member 'MainMenu_UMG_C_ExecuteUbergraph_MainMenu_UMG::CallFunc_GetScreenResolution_ReturnValue' has a wrong offset!");

// Function MainMenu_UMG.MainMenu_UMG_C.Tick
// 0x003C (0x003C - 0x0000)
struct MainMenu_UMG_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_UMG_C_Tick) == 0x000004, "Wrong alignment on MainMenu_UMG_C_Tick");
static_assert(sizeof(MainMenu_UMG_C_Tick) == 0x00003C, "Wrong size on MainMenu_UMG_C_Tick");
static_assert(offsetof(MainMenu_UMG_C_Tick, MyGeometry) == 0x000000, "Member 'MainMenu_UMG_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_Tick, InDeltaTime) == 0x000038, "Member 'MainMenu_UMG_C_Tick::InDeltaTime' has a wrong offset!");

// Function MainMenu_UMG.MainMenu_UMG_C.隐藏主界面
// 0x0038 (0x0038 - 0x0000)
struct MainMenu_UMG_C_隐藏主界面 final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_UMG_C_隐藏主界面) == 0x000008, "Wrong alignment on MainMenu_UMG_C_隐藏主界面");
static_assert(sizeof(MainMenu_UMG_C_隐藏主界面) == 0x000038, "Wrong size on MainMenu_UMG_C_隐藏主界面");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, InVisibility) == 0x000000, "Member 'MainMenu_UMG_C_隐藏主界面::InVisibility' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, ___int_Array_Index_Variable) == 0x000004, "Member 'MainMenu_UMG_C_隐藏主界面::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, ___int_Loop_Counter_Variable) == 0x000008, "Member 'MainMenu_UMG_C_隐藏主界面::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'MainMenu_UMG_C_隐藏主界面::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, CallFunc_GetAllChildren_ReturnValue) == 0x000010, "Member 'MainMenu_UMG_C_隐藏主界面::CallFunc_GetAllChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'MainMenu_UMG_C_隐藏主界面::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, CallFunc_Array_Get_Item) == 0x000028, "Member 'MainMenu_UMG_C_隐藏主界面::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_隐藏主界面, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'MainMenu_UMG_C_隐藏主界面::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function MainMenu_UMG.MainMenu_UMG_C.Get_MainMenu_Visibility_0
// 0x0002 (0x0002 - 0x0000)
struct MainMenu_UMG_C_Get_MainMenu_Visibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MainMenu_UMG_C_Get_MainMenu_Visibility_0) == 0x000001, "Wrong alignment on MainMenu_UMG_C_Get_MainMenu_Visibility_0");
static_assert(sizeof(MainMenu_UMG_C_Get_MainMenu_Visibility_0) == 0x000002, "Wrong size on MainMenu_UMG_C_Get_MainMenu_Visibility_0");
static_assert(offsetof(MainMenu_UMG_C_Get_MainMenu_Visibility_0, ReturnValue) == 0x000000, "Member 'MainMenu_UMG_C_Get_MainMenu_Visibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_Get_MainMenu_Visibility_0, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'MainMenu_UMG_C_Get_MainMenu_Visibility_0::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function MainMenu_UMG.MainMenu_UMG_C.不同地图不同角色
// 0x0018 (0x0018 - 0x0000)
struct MainMenu_UMG_C_不同地图不同角色 final
{
public:
	TArray<class ACustomCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0000(0x0010)(ReferenceParm)
	class ACustomCharacter_C*                     CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_UMG_C_不同地图不同角色) == 0x000008, "Wrong alignment on MainMenu_UMG_C_不同地图不同角色");
static_assert(sizeof(MainMenu_UMG_C_不同地图不同角色) == 0x000018, "Wrong size on MainMenu_UMG_C_不同地图不同角色");
static_assert(offsetof(MainMenu_UMG_C_不同地图不同角色, CallFunc_GetAllActorsOfClass_OutActors) == 0x000000, "Member 'MainMenu_UMG_C_不同地图不同角色::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_不同地图不同角色, CallFunc_Array_Get_Item) == 0x000010, "Member 'MainMenu_UMG_C_不同地图不同角色::CallFunc_Array_Get_Item' has a wrong offset!");

// Function MainMenu_UMG.MainMenu_UMG_C.返回主界面
// 0x0010 (0x0010 - 0x0000)
struct MainMenu_UMG_C_返回主界面 final
{
public:
	class UWidget*                                RemoveUI;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MainMenu_UMG_C_返回主界面) == 0x000008, "Wrong alignment on MainMenu_UMG_C_返回主界面");
static_assert(sizeof(MainMenu_UMG_C_返回主界面) == 0x000010, "Wrong size on MainMenu_UMG_C_返回主界面");
static_assert(offsetof(MainMenu_UMG_C_返回主界面, RemoveUI) == 0x000000, "Member 'MainMenu_UMG_C_返回主界面::RemoveUI' has a wrong offset!");
static_assert(offsetof(MainMenu_UMG_C_返回主界面, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'MainMenu_UMG_C_返回主界面::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

}

