#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MapNameTip_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MapNameTip_UMG.MapNameTip_UMG_C
// 0x0038 (0x0298 - 0x0260)
class UMapNameTip_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_35;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MapName;                                           // 0x0278(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	float                                         动画速度; // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         持续时间; // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MapNameTip_UMG(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MapNameTip_UMG_C">();
	}
	static class UMapNameTip_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMapNameTip_UMG_C>();
	}
};
static_assert(alignof(UMapNameTip_UMG_C) == 0x000008, "Wrong alignment on UMapNameTip_UMG_C");
static_assert(sizeof(UMapNameTip_UMG_C) == 0x000298, "Wrong size on UMapNameTip_UMG_C");
static_assert(offsetof(UMapNameTip_UMG_C, UberGraphFrame) == 0x000260, "Member 'UMapNameTip_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMapNameTip_UMG_C, Appear) == 0x000268, "Member 'UMapNameTip_UMG_C::Appear' has a wrong offset!");
static_assert(offsetof(UMapNameTip_UMG_C, TextBlock_35) == 0x000270, "Member 'UMapNameTip_UMG_C::TextBlock_35' has a wrong offset!");
static_assert(offsetof(UMapNameTip_UMG_C, MapName) == 0x000278, "Member 'UMapNameTip_UMG_C::MapName' has a wrong offset!");
static_assert(offsetof(UMapNameTip_UMG_C, 动画速度) == 0x000290, "Member 'UMapNameTip_UMG_C::动画速度' has a wrong offset!");
static_assert(offsetof(UMapNameTip_UMG_C, 持续时间) == 0x000294, "Member 'UMapNameTip_UMG_C::持续时间' has a wrong offset!");

}

