#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MistyQuest_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "MovieScene_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MistyQuest_BP.MistyQuest_BP_C.ExecuteUbergraph_MistyQuest_BP
// 0x0C80 (0x0C80 - 0x0000)
struct MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0010(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_______ReturnValue;                        // 0x0050(0x0018)()
	class FText                                   ___text_Variable;                                  // 0x0068(0x0018)(ConstParm)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   ___text_Variable_1;                                // 0x0090(0x0018)(ConstParm)
	class FText                                   ___text_Variable_2;                                // 0x00A8(0x0018)(ConstParm)
	class FText                                   ___text_Variable_3;                                // 0x00C0(0x0018)(ConstParm)
	class FText                                   ___text_Variable_4;                                // 0x00D8(0x0018)(ConstParm)
	class FText                                   ___text_Variable_5;                                // 0x00F0(0x0018)(ConstParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestTips_UMG_C*                       CallFunc_Create_ReturnValue;                       // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URealtimeCoordinateTip_UMG_C*           CallFunc_Create_ReturnValue_1;                     // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapNameTip_UMG_C*                      CallFunc_Create_ReturnValue_2;                     // 0x0120(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0128(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0148(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0168(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   ___text_Variable_6;                                // 0x0188(0x0018)(ConstParm)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x01B0(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable;                                // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x01D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D4[0x4];                                      // 0x01D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable_7;                                // 0x01D8(0x0018)(ConstParm)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x01F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable_8;                                // 0x0208(0x0018)(ConstParm)
	class FText                                   ___text_Variable_9;                                // 0x0220(0x0018)(ConstParm)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable_10;                               // 0x0240(0x0018)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_1;            // 0x0259(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25A[0x2];                                      // 0x025A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Add_ByteByte_ReturnValue;                 // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0280(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_GetValidValue_ReturnValue;                // 0x0281(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_282[0x6];                                      // 0x0282(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable_11;                               // 0x0288(0x0018)(ConstParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_2;            // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInGame_Umg_C*>                  CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x02A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UInGame_Umg_C*                          CallFunc_Array_Get_Item;                           // 0x02B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable_12;                               // 0x02C0(0x0018)(ConstParm)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x02E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x0318(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31C[0x4];                                      // 0x031C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMistyZombieBuilder_BP_C*               CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0320(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_3;            // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0330(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAlarmBell_BP_C*                        CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0370(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue;              // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array;                            // 0x0390(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_1;                          // 0x03A0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_2;                          // 0x03B0(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_3;                          // 0x03C0(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_4;                          // 0x03D0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_5;                          // 0x03E0(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_6;                          // 0x03F0(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_7;                          // 0x0400(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_8;                          // 0x0410(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0420(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_424[0x4];                                      // 0x0424(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x0428(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHouseLight_Interface_C> K2Node_DynamicCast_AsHouse_Light_Interface;      // 0x0430(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x7];                                      // 0x0441(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_9;                          // 0x0448(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_10;                         // 0x0458(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_11;                         // 0x0468(0x0010)(ReferenceParm)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_4;            // 0x0478(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x0480(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AZombieBuilder_BP2_C*>           CallFunc_GetAllActorsOfClass_OutActors;            // 0x04B0(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombieBuilder_BP2_C*                   CallFunc_Array_Get_Item_2;                         // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAlarmBell_BP_C*                        CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x04D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DD[0x3];                                      // 0x04DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x04E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x0510(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x0548(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0550(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_______ReturnValue_1;                      // 0x0558(0x0018)()
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_______ReturnValue_2;                      // 0x0578(0x0018)()
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0590(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue_1;            // 0x05A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A8[0x8];                                      // 0x05A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_6;              // 0x05B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGhost_GrandMa_BP_C*                    CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x05E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_2;            // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_12;                         // 0x05F8(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_13;                         // 0x0608(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_14;                         // 0x0618(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_15;                         // 0x0628(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_16;                         // 0x0638(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_17;                         // 0x0648(0x0010)(ReferenceParm)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_7;              // 0x0660(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_18;                         // 0x0690(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7; // 0x06A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_19;                         // 0x06A8(0x0010)(ReferenceParm)
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_7;        // 0x06B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_20;                         // 0x06C0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_______ReturnValue_3;                      // 0x06D0(0x0018)()
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_21;                         // 0x06E8(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_22;                         // 0x06F8(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_23;                         // 0x0708(0x0010)(ReferenceParm)
	uint8                                         Pad_718[0x8];                                      // 0x0718(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_8;              // 0x0720(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_8; // 0x0750(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_5;            // 0x0758(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALocation_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_8;        // 0x0760(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_768[0x8];                                      // 0x0768(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_9;              // 0x0770(0x0030)(IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_______ReturnValue_4;                      // 0x07A0(0x0018)()
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_9; // 0x07B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlotClue_Blueprint_C*                  CallFunc_FinishSpawningActor_ReturnValue_9;        // 0x07C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_3;            // 0x07C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_24;                         // 0x07D0(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_25;                         // 0x07E0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_26;                         // 0x07F0(0x0010)(ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0800(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0888(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_889[0x7];                                      // 0x0889(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_27;                         // 0x0890(0x0010)(ReferenceParm)
	TArray<class USoundBase*>                     K2Node_MakeArray_Array_28;                         // 0x08A0(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_29;                         // 0x08B0(0x0010)(ReferenceParm)
	class A场景音效_C* CallFunc_GetActorOfClass_ReturnValue_4;            // 0x08C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_6;            // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           K2Node_MakeArray_Array_30;                         // 0x08D0(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue;                    // 0x08E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_31;                         // 0x08E8(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_32;                         // 0x08F8(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_1;                  // 0x0908(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_2;                  // 0x0910(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_33;                         // 0x0918(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_34;                         // 0x0928(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_3;                  // 0x0938(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_4;                  // 0x0940(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_35;                         // 0x0948(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_36;                         // 0x0958(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_5;                  // 0x0968(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_6;                  // 0x0970(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_37;                         // 0x0978(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_7;                  // 0x0988(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FText>                           K2Node_MakeArray_Array_38;                         // 0x0990(0x0010)(ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_39;                         // 0x09A0(0x0010)(ReferenceParm)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_8;                  // 0x09B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USubtitles_UMG_C*                       CallFunc___________ReturnValue_9;                  // 0x09B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings; // 0x09C0(0x0014)(NoDestructor)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor;       // 0x09D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue;    // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x09E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x09EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x09F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_9;          // 0x09F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings_1; // 0x09F8(0x0014)(NoDestructor)
	struct FMovieSceneSequencePlaybackSettings    K2Node_MakeStruct_MovieSceneSequencePlaybackSettings_2; // 0x0A0C(0x0014)(NoDestructor)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor_1;     // 0x0A20(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue_1;  // 0x0A28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelSequenceActor*                    CallFunc_CreateLevelSequencePlayer_OutActor_2;     // 0x0A30(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_CreateLevelSequencePlayer_ReturnValue_2;  // 0x0A38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_10;             // 0x0A40(0x0030)(IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_7;            // 0x0A70(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A71[0x7];                                      // 0x0A71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_10; // 0x0A78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_10;       // 0x0A80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A88[0x8];                                      // 0x0A88(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_11;             // 0x0A90(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_12;             // 0x0AC0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_11; // 0x0AF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_12; // 0x0AF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_11;       // 0x0B00(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_12;       // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_8;            // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B11[0xF];                                      // 0x0B11(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_13;             // 0x0B20(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_13; // 0x0B50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_13;       // 0x0B58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_14;             // 0x0B60(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_14; // 0x0B90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue_9;            // 0x0B98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B99[0x7];                                      // 0x0B99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_14;       // 0x0BA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0BA8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_15;             // 0x0BB0(0x0030)(IsPlainOldData, NoDestructor)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x0BE0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0BE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_BE9[0x7];                                      // 0x0BE9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_15; // 0x0BF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_15;       // 0x0BF8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0C00(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0C0C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C18[0x8];                                      // 0x0C18(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0C20(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_16; // 0x0C50(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALocation_BP_C*                         CallFunc_GetActorOfClass_ReturnValue_5;            // 0x0C58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_______ReturnValue_5;                      // 0x0C60(0x0018)()
	class A报废汽车生成器_BP_C* CallFunc_FinishSpawningActor_ReturnValue_16;       // 0x0C78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP) == 0x000010, "Wrong alignment on MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP");
static_assert(sizeof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP) == 0x000C80, "Wrong size on MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, EntryPoint) == 0x000000, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue) == 0x000010, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000040, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000048, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_______ReturnValue) == 0x000050, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_______ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable) == 0x000068, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_1) == 0x000090, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_2) == 0x0000A8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_3) == 0x0000C0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_4) == 0x0000D8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_5) == 0x0000F0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_5' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000108, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Create_ReturnValue) == 0x000110, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Create_ReturnValue_1) == 0x000118, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Create_ReturnValue_2) == 0x000120, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000128, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_2) == 0x000138, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_3) == 0x000148, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_4) == 0x000158, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_5) == 0x000168, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_6) == 0x000178, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_6) == 0x000188, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_6' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_7) == 0x0001A0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CreateDelegate_OutputDelegate_8) == 0x0001B0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_CustomEvent_Loaded) == 0x0001C0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___object_Variable) == 0x0001C8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___object_Variable' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___int_Array_Index_Variable) == 0x0001D0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_7) == 0x0001D8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_7' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___int_Loop_Counter_Variable) == 0x0001F0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Add_IntInt_ReturnValue) == 0x0001F4, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___int_Loop_Counter_Variable_1) == 0x0001F8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x0001FC, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000200, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_8) == 0x000208, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_8' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_9) == 0x000220, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_9' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000238, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_10) == 0x000240, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_10' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue) == 0x000258, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue_1) == 0x000259, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x00025C, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x000260, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000268, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Add_ByteByte_ReturnValue) == 0x000270, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Add_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_DynamicCast_AsPlayer_BP) == 0x000278, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_DynamicCast_bSuccess) == 0x000280, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetValidValue_ReturnValue) == 0x000281, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetValidValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_11) == 0x000288, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_11' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue_2) == 0x0002A0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0002A8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Array_Get_Item) == 0x0002B8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___text_Variable_12) == 0x0002C0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___text_Variable_12' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue_1) == 0x0002E0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000310, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Divide_FloatFloat_ReturnValue_4) == 0x000318, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Divide_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000320, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue_3) == 0x000328, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue_2) == 0x000330, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x000360, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x000368, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000370, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Array_Length_ReturnValue) == 0x000380, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000384, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetActorOfClass_ReturnValue) == 0x000388, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array) == 0x000390, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_1) == 0x0003A0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_2) == 0x0003B0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_3) == 0x0003C0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_4) == 0x0003D0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_5) == 0x0003E0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_5' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_6) == 0x0003F0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_6' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_7) == 0x000400, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_7' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_8) == 0x000410, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_8' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, ___int_Array_Index_Variable_1) == 0x000420, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Array_Get_Item_1) == 0x000428, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_DynamicCast_AsHouse_Light_Interface) == 0x000430, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_DynamicCast_AsHouse_Light_Interface' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_DynamicCast_bSuccess_1) == 0x000440, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_9) == 0x000448, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_9' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_10) == 0x000458, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_10' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, K2Node_MakeArray_Array_11) == 0x000468, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::K2Node_MakeArray_Array_11' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeLiteralByte_ReturnValue_4) == 0x000478, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeLiteralByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue_3) == 0x000480, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_GetAllActorsOfClass_OutActors) == 0x0004B0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x0004C0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Array_Get_Item_2) == 0x0004C8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x0004D0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Array_Length_ReturnValue_1) == 0x0004D8, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_Less_IntInt_ReturnValue_1) == 0x0004DC, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue_4) == 0x0004E0, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_MakeTransform_ReturnValue_5) == 0x000510, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_MakeTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000540, "Member 'MistyQuest_BP_C_ExecuteUbergraph_MistyQuest_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
