#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MistyQuest_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FogScene_Enum_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MistyQuest_BP.MistyQuest_BP_C
// 0x0038 (0x0258 - 0x0220)
class AMistyQuest_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	EFogScene_Enum                                Quest;                                             // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           As_Player_BP;                                      // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQuestTips_UMG_C*                       任务提示_UMG; // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInGame_Umg_C*                          InGameUmg;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class URealtimeCoordinateTip_UMG_C*           RealtimeCoordinateTip_UMG;                         // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MistyQuest_BP(int32 EntryPoint);
	void 重新开始游戏();
	void 第一幕结束();
	void 寻找幸存者线索();
	void 前往新营地();
	void Boss出场动画结束();
	void 关闭警报声();
	void 开始寻找废铁();
	void 开始查看电表();
	void 完成电力系统恢复();
	void RefreshQuest();
	void 开始游戏();
	void 刷新任务();
	void ReceiveBeginPlay();
	void EndTalk();
	void OnLoaded_94B7837F440FF2858C8460BA7D741CA0(class UObject* Loaded);
	void 清空屏幕UI();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MistyQuest_BP_C">();
	}
	static class AMistyQuest_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMistyQuest_BP_C>();
	}
};
static_assert(alignof(AMistyQuest_BP_C) == 0x000008, "Wrong alignment on AMistyQuest_BP_C");
static_assert(sizeof(AMistyQuest_BP_C) == 0x000258, "Wrong size on AMistyQuest_BP_C");
static_assert(offsetof(AMistyQuest_BP_C, UberGraphFrame) == 0x000220, "Member 'AMistyQuest_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, DefaultSceneRoot) == 0x000228, "Member 'AMistyQuest_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, Quest) == 0x000230, "Member 'AMistyQuest_BP_C::Quest' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, As_Player_BP) == 0x000238, "Member 'AMistyQuest_BP_C::As_Player_BP' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, 任务提示_UMG) == 0x000240, "Member 'AMistyQuest_BP_C::任务提示_UMG' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, InGameUmg) == 0x000248, "Member 'AMistyQuest_BP_C::InGameUmg' has a wrong offset!");
static_assert(offsetof(AMistyQuest_BP_C, RealtimeCoordinateTip_UMG) == 0x000250, "Member 'AMistyQuest_BP_C::RealtimeCoordinateTip_UMG' has a wrong offset!");

}

