#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MistyZombieBuilder_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MistyZombieBuilder_BP.MistyZombieBuilder_BP_C.ExecuteUbergraph_MistyZombieBuilder_BP
// 0x0140 (0x0140 - 0x0000)
struct MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class AActor*                           K2Node_CustomEvent_Zombie;                         // 0x0038(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0058(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0068(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0090(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0xF];                                       // 0x00A1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x00B0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_BP_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Min;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Max;                            // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0128(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP) == 0x000010, "Wrong alignment on MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP");
static_assert(sizeof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP) == 0x000140, "Wrong size on MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, EntryPoint) == 0x000000, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, ___int_Array_Index_Variable) == 0x000004, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, ___bool_IsClosed_Variable) == 0x000008, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, ___bool_Has_Been_Initd_Variable) == 0x000009, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Array_Get_Item) == 0x000010, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_DynamicCast_AsZombie_BP) == 0x000020, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, ___int_Variable) == 0x00002C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::___int_Variable' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_CustomEvent_Zombie) == 0x000038, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_CustomEvent_Zombie' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000044, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000048, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00004C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000058, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000064, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000068, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_BreakVector_X) == 0x000078, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_BreakVector_Y) == 0x00007C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_BreakVector_Z) == 0x000080, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_MakeVector_ReturnValue) == 0x000084, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000090, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_VSize_ReturnValue) == 0x00009C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A0, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x0000B0, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000E0, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000E8, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_IsValid_ReturnValue_1) == 0x0000F0, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Array_Add_ReturnValue) == 0x0000F4, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000F8, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_DynamicCast_AsPlayer_BP) == 0x000100, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_CustomEvent_Min) == 0x00010C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_CustomEvent_Min' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, K2Node_CustomEvent_Max) == 0x000110, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::K2Node_CustomEvent_Max' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, ___int_Loop_Counter_Variable) == 0x000114, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000118, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_RandomFloatInRange_ReturnValue) == 0x000120, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Array_Length_ReturnValue_1) == 0x000124, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000128, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000130, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP, CallFunc_Array_RemoveItem_ReturnValue) == 0x000131, "Member 'MistyZombieBuilder_BP_C_ExecuteUbergraph_MistyZombieBuilder_BP::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function MistyZombieBuilder_BP.MistyZombieBuilder_BP_C.重新开始生成
// 0x0008 (0x0008 - 0x0000)
struct MistyZombieBuilder_BP_C_重新开始生成 final
{
public:
	float                                         Min_0;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max_0;                                             // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MistyZombieBuilder_BP_C_重新开始生成) == 0x000004, "Wrong alignment on MistyZombieBuilder_BP_C_重新开始生成");
static_assert(sizeof(MistyZombieBuilder_BP_C_重新开始生成) == 0x000008, "Wrong size on MistyZombieBuilder_BP_C_重新开始生成");
static_assert(offsetof(MistyZombieBuilder_BP_C_重新开始生成, Min_0) == 0x000000, "Member 'MistyZombieBuilder_BP_C_重新开始生成::Min_0' has a wrong offset!");
static_assert(offsetof(MistyZombieBuilder_BP_C_重新开始生成, Max_0) == 0x000004, "Member 'MistyZombieBuilder_BP_C_重新开始生成::Max_0' has a wrong offset!");

// Function MistyZombieBuilder_BP.MistyZombieBuilder_BP_C.再生成一波丧尸潮
// 0x0008 (0x0008 - 0x0000)
struct MistyZombieBuilder_BP_C_再生成一波丧尸潮 final
{
public:
	const class AActor*                           Zombie;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MistyZombieBuilder_BP_C_再生成一波丧尸潮) == 0x000008, "Wrong alignment on MistyZombieBuilder_BP_C_再生成一波丧尸潮");
static_assert(sizeof(MistyZombieBuilder_BP_C_再生成一波丧尸潮) == 0x000008, "Wrong size on MistyZombieBuilder_BP_C_再生成一波丧尸潮");
static_assert(offsetof(MistyZombieBuilder_BP_C_再生成一波丧尸潮, Zombie) == 0x000000, "Member 'MistyZombieBuilder_BP_C_再生成一波丧尸潮::Zombie' has a wrong offset!");

}

