#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MistyZombieBuilder_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MistyZombieBuilder_BP.MistyZombieBuilder_BP_C
// 0x0048 (0x0268 - 0x0220)
class AMistyZombieBuilder_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         生成的丧尸; // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         Index_0;                                           // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         生成多少个; // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           As_Player_BP;                                      // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Random_Location;                                   // 0x0250(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          中断生成; // 0x025C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Min;                                               // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Max;                                               // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MistyZombieBuilder_BP(int32 EntryPoint);
	void 重新开始生成(float Min_0, float Max_0);
	void 中断丧尸生成();
	void 再生成一波丧尸潮(const class AActor*& Zombie);
	void ReceiveBeginPlay();
	void 生成丧尸();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MistyZombieBuilder_BP_C">();
	}
	static class AMistyZombieBuilder_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMistyZombieBuilder_BP_C>();
	}
};
static_assert(alignof(AMistyZombieBuilder_BP_C) == 0x000008, "Wrong alignment on AMistyZombieBuilder_BP_C");
static_assert(sizeof(AMistyZombieBuilder_BP_C) == 0x000268, "Wrong size on AMistyZombieBuilder_BP_C");
static_assert(offsetof(AMistyZombieBuilder_BP_C, UberGraphFrame) == 0x000220, "Member 'AMistyZombieBuilder_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, DefaultSceneRoot) == 0x000228, "Member 'AMistyZombieBuilder_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, 生成的丧尸) == 0x000230, "Member 'AMistyZombieBuilder_BP_C::生成的丧尸' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, Index_0) == 0x000240, "Member 'AMistyZombieBuilder_BP_C::Index_0' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, 生成多少个) == 0x000244, "Member 'AMistyZombieBuilder_BP_C::生成多少个' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, As_Player_BP) == 0x000248, "Member 'AMistyZombieBuilder_BP_C::As_Player_BP' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, Random_Location) == 0x000250, "Member 'AMistyZombieBuilder_BP_C::Random_Location' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, 中断生成) == 0x00025C, "Member 'AMistyZombieBuilder_BP_C::中断生成' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, Min) == 0x000260, "Member 'AMistyZombieBuilder_BP_C::Min' has a wrong offset!");
static_assert(offsetof(AMistyZombieBuilder_BP_C, Max) == 0x000264, "Member 'AMistyZombieBuilder_BP_C::Max' has a wrong offset!");

}

