#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MyGameInstance

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function MyGameInstance.MyGameInstance_C.ExecuteUbergraph_MyGameInstance
// 0x04F0 (0x04F0 - 0x0000)
struct MyGameInstance_C_ExecuteUbergraph_MyGameInstance final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_Entity_Pawn_C*>              CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_4;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_4;                    // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Entity_Pawn_C*                      CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_1;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_2;            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue_3;            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_4;            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_5;            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_6;            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue_7;            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_8;            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue_9;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_10;           // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMistyZombieBuilder_BP_C*               CallFunc_GetActorOfClass_ReturnValue_11;           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x00E0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0110(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAlarmBell_BP_C*                        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMinimapPoint_C*                        CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0160(0x0030)(IsPlainOldData, NoDestructor)
	TArray<class AZombieBuilder_BP2_C*>           CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0190(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAlarmBell_BP_C*                        CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_5;                    // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C4[0x4];                                      // 0x01C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x01C8(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_1;    // 0x01D8(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHouseLight_Interface_C> K2Node_DynamicCast_AsHouse_Light_Interface;      // 0x01F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IHouseLight_Interface_C> K2Node_DynamicCast_AsHouse_Light_Interface_1;    // 0x0210(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x3];                                      // 0x0221(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0224(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x022C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x022D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22E[0x2];                                      // 0x022E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_2;    // 0x0230(0x0010)(ReferenceParm)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors_3;    // 0x0240(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_3;                         // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_4;                         // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IHouseLight_Interface_C> K2Node_DynamicCast_AsHouse_Light_Interface_2;    // 0x0260(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IHouseLight_Interface_C> K2Node_DynamicCast_AsHouse_Light_Interface_3;    // 0x0278(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x0295(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_296[0x2];                                      // 0x0296(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_5;                     // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ALocation_BP_C*                         CallFunc_GetActorOfClass_ReturnValue_12;           // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombieBuilder_BP2_C*                   CallFunc_Array_Get_Item_5;                         // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_______ReturnValue;                        // 0x02B0(0x0018)()
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class A第一道门_BP_C* CallFunc_GetActorOfClass_ReturnValue_13;           // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E8[0x8];                                      // 0x02E8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x02F0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0320(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4; // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABackroom警报声_BP_C*                CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0360(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmmoSpawner_C*                         CallFunc_FinishSpawningActor_ReturnValue_4;        // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAmmoSpawner_C*                         CallFunc_FinishSpawningActor_ReturnValue_5;        // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable;                                  // 0x0380(0x0018)(ConstParm)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_4;              // 0x03A0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABoundary_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_6;        // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_5;              // 0x03E0(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7; // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ___text_Variable_1;                                // 0x0418(0x0018)(ConstParm)
	class AAK74_PickUp_BP_C*                      CallFunc_FinishSpawningActor_ReturnValue_7;        // 0x0430(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQuestTipUI_BP_C*                       CallFunc_GetActorOfClass_ReturnValue_14;           // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABackroom_Quest_BP_C*                   CallFunc_GetActorOfClass_ReturnValue_15;           // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x0448(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0450(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x04D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x7];                                      // 0x04D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue_1;     // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance) == 0x000010, "Wrong alignment on MyGameInstance_C_ExecuteUbergraph_MyGameInstance");
static_assert(sizeof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance) == 0x0004F0, "Wrong size on MyGameInstance_C_ExecuteUbergraph_MyGameInstance");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, EntryPoint) == 0x000000, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::EntryPoint' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable) == 0x00001C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable) == 0x000020, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable_1) == 0x000028, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue_1) == 0x00002C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable_1) == 0x000030, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable_2) == 0x000034, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable_2) == 0x000038, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue_2) == 0x00003C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable_3) == 0x000040, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable_3) == 0x000044, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue_3) == 0x00004C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable_4) == 0x000050, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable_4) == 0x000054, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item) == 0x000058, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue_4) == 0x000064, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x000068, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue) == 0x000078, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_1) == 0x000080, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_2) == 0x000088, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_3) == 0x000090, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_4) == 0x000098, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_5) == 0x0000A0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_6) == 0x0000A8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_7) == 0x0000B0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_8) == 0x0000B8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_9) == 0x0000C0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_10) == 0x0000C8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_11) == 0x0000D0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue) == 0x0000E0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue_1) == 0x000110, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000140, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000148, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue) == 0x000150, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000158, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue_2) == 0x000160, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000190, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2) == 0x0001A0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue_1) == 0x0001A8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_2) == 0x0001B0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Loop_Counter_Variable_5) == 0x0001B8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001BC, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Add_IntInt_ReturnValue_5) == 0x0001C0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsWithInterface_OutActors) == 0x0001C8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsWithInterface_OutActors_1) == 0x0001D8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsWithInterface_OutActors_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item_1) == 0x0001E8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item_2) == 0x0001F0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_AsHouse_Light_Interface) == 0x0001F8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_AsHouse_Light_Interface' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_bSuccess) == 0x000208, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_AsHouse_Light_Interface_1) == 0x000210, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_AsHouse_Light_Interface_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_bSuccess_1) == 0x000220, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue_2) == 0x000224, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue_3) == 0x000228, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue_2) == 0x00022C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue_3) == 0x00022D, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsWithInterface_OutActors_2) == 0x000230, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsWithInterface_OutActors_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetAllActorsWithInterface_OutActors_3) == 0x000240, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetAllActorsWithInterface_OutActors_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item_3) == 0x000250, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item_4) == 0x000258, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_AsHouse_Light_Interface_2) == 0x000260, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_AsHouse_Light_Interface_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_bSuccess_2) == 0x000270, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_AsHouse_Light_Interface_3) == 0x000278, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_AsHouse_Light_Interface_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_bSuccess_3) == 0x000288, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue_4) == 0x00028C, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Length_ReturnValue_5) == 0x000290, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue_4) == 0x000294, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Less_IntInt_ReturnValue_5) == 0x000295, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___int_Array_Index_Variable_5) == 0x000298, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_12) == 0x0002A0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_12' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_Array_Get_Item_5) == 0x0002A8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_______ReturnValue) == 0x0002B0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_______ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetPlayerPawn_ReturnValue) == 0x0002C8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_AsPlayer_BP) == 0x0002D0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, K2Node_DynamicCast_bSuccess_4) == 0x0002D8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_13) == 0x0002E0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_13' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue_3) == 0x0002F0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetTransform_ReturnValue) == 0x000320, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3) == 0x000350, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4) == 0x000358, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_3) == 0x000360, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_4) == 0x000368, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5) == 0x000370, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_5) == 0x000378, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___text_Variable) == 0x000380, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___text_Variable' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue_4) == 0x0003A0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6) == 0x0003D0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_6) == 0x0003D8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_MakeTransform_ReturnValue_5) == 0x0003E0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_MakeTransform_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7) == 0x000410, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, ___text_Variable_1) == 0x000418, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::___text_Variable_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_FinishSpawningActor_ReturnValue_7) == 0x000430, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_FinishSpawningActor_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_14) == 0x000438, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_14' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetActorOfClass_ReturnValue_15) == 0x000440, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetActorOfClass_ReturnValue_15' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetPlayerPawn_ReturnValue_1) == 0x000448, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetPlayerPawn_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000450, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0004D8, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_ExecuteUbergraph_MyGameInstance, CallFunc_GetPlayerCameraManager_ReturnValue_1) == 0x0004E0, "Member 'MyGameInstance_C_ExecuteUbergraph_MyGameInstance::CallFunc_GetPlayerCameraManager_ReturnValue_1' has a wrong offset!");

// Function MyGameInstance.MyGameInstance_C.设置玩家位置和旋转
// 0x0118 (0x0118 - 0x0000)
struct MyGameInstance_C_设置玩家位置和旋转 final
{
public:
	float                                         New_Location_X;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Location_Y;                                    // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         New_Rotation_Z__Yaw_;                              // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x007C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0088(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MyGameInstance_C_设置玩家位置和旋转) == 0x000008, "Wrong alignment on MyGameInstance_C_设置玩家位置和旋转");
static_assert(sizeof(MyGameInstance_C_设置玩家位置和旋转) == 0x000118, "Wrong size on MyGameInstance_C_设置玩家位置和旋转");
static_assert(offsetof(MyGameInstance_C_设置玩家位置和旋转, New_Location_X) == 0x000000, "Member 'MyGameInstance_C_设置玩家位置和旋转::New_Location_X' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_设置玩家位置和旋转, New_Location_Y) == 0x000004, "Member 'MyGameInstance_C_设置玩家位置和旋转::New_Location_Y' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_设置玩家位置和旋转, New_Rotation_Z__Yaw_) == 0x000008, "Member 'MyGameInstance_C_设置玩家位置和旋转::New_Rotation_Z__Yaw_' has a wrong offset!");
static_assert(offsetof(MyGameInstance_C_设置玩家位置和旋转, CallFunc_GetPlayerPawn_ReturnValue) == 0x000010, "Member 'MyGameInstance_C_设置玩家位置和旋转::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
