#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenHit

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function OpenHit.OpenHit_C.Received_Notify
// 0x0040 (0x0040 - 0x0000)
struct OpenHit_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(OpenHit_C_Received_Notify) == 0x000008, "Wrong alignment on OpenHit_C_Received_Notify");
static_assert(sizeof(OpenHit_C_Received_Notify) == 0x000040, "Wrong size on OpenHit_C_Received_Notify");
static_assert(offsetof(OpenHit_C_Received_Notify, MeshComp) == 0x000000, "Member 'OpenHit_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, Animation) == 0x000008, "Member 'OpenHit_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, ReturnValue) == 0x000010, "Member 'OpenHit_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000014, "Member 'OpenHit_C_Received_Notify::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'OpenHit_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'OpenHit_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, K2Node_DynamicCast_AsPlayer_BP) == 0x000028, "Member 'OpenHit_C_Received_Notify::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'OpenHit_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(OpenHit_C_Received_Notify, CallFunc_K2_SetTimer_ReturnValue) == 0x000038, "Member 'OpenHit_C_Received_Notify::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");

}

