#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: P320_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function P320_Anim.P320_Anim_C.ExecuteUbergraph_P320_Anim
// 0x000C (0x000C - 0x0000)
struct P320_Anim_C_ExecuteUbergraph_P320_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(P320_Anim_C_ExecuteUbergraph_P320_Anim) == 0x000004, "Wrong alignment on P320_Anim_C_ExecuteUbergraph_P320_Anim");
static_assert(sizeof(P320_Anim_C_ExecuteUbergraph_P320_Anim) == 0x00000C, "Wrong size on P320_Anim_C_ExecuteUbergraph_P320_Anim");
static_assert(offsetof(P320_Anim_C_ExecuteUbergraph_P320_Anim, EntryPoint) == 0x000000, "Member 'P320_Anim_C_ExecuteUbergraph_P320_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(P320_Anim_C_ExecuteUbergraph_P320_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'P320_Anim_C_ExecuteUbergraph_P320_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(P320_Anim_C_ExecuteUbergraph_P320_Anim, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'P320_Anim_C_ExecuteUbergraph_P320_Anim::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");

// Function P320_Anim.P320_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct P320_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(P320_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on P320_Anim_C_AnimGraph");
static_assert(sizeof(P320_Anim_C_AnimGraph) == 0x000010, "Wrong size on P320_Anim_C_AnimGraph");
static_assert(offsetof(P320_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'P320_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

