#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Password_UMG

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Password_UMG.Password_UMG_C.ExecuteUbergraph_Password_UMG
// 0x0128 (0x0128 - 0x0000)
struct Password_UMG_C_ExecuteUbergraph_Password_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_GetCharacterArrayFromString_ReturnValue;  // 0x0008(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0018(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ___object_Variable;                                // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ___object_Variable_1;                              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ___object_Variable_2;                              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ___object_Variable_3;                              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutItem;                     // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Random_OutIndex;                    // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Variable_1;                                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class A键盘密码按钮_BP_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x00B8(0x0010)(ReferenceParm)
	int32                                         K2Node_CustomEvent______;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class A键盘密码按钮_BP_C* CallFunc_Array_Get_Item;                           // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x010C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10D[0x3];                                      // 0x010D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Password_UMG_C_ExecuteUbergraph_Password_UMG) == 0x000008, "Wrong alignment on Password_UMG_C_ExecuteUbergraph_Password_UMG");
static_assert(sizeof(Password_UMG_C_ExecuteUbergraph_Password_UMG) == 0x000128, "Wrong size on Password_UMG_C_ExecuteUbergraph_Password_UMG");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, EntryPoint) == 0x000000, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_GetCharacterArrayFromString_ReturnValue) == 0x000008, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_GetCharacterArrayFromString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Conv_StringToText_ReturnValue) == 0x000018, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___object_Variable) == 0x000038, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___object_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000040, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___object_Variable_1) == 0x000048, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___object_Variable_2) == 0x000050, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___object_Variable_2' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___object_Variable_3) == 0x000058, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___object_Variable_3' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___bool_Has_Been_Initd_Variable) == 0x000060, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___bool_IsClosed_Variable) == 0x000061, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___int_Loop_Counter_Variable) == 0x000064, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x000068, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___int_Array_Index_Variable) == 0x00006C, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___int_Variable) == 0x000070, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___int_Variable' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Random_OutItem) == 0x000074, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Random_OutItem' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Random_OutIndex) == 0x000078, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Random_OutIndex' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Conv_IntToString_ReturnValue) == 0x000080, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, ___int_Variable_1) == 0x000090, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::___int_Variable_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Concat_StrStr_ReturnValue) == 0x000098, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, K2Node_Select_Default) == 0x0000A8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_LessEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000B4, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000B8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, K2Node_CustomEvent______) == 0x0000C8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::K2Node_CustomEvent______' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Get_Item) == 0x0000D0, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Conv_IntToString_ReturnValue_1) == 0x0000D8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Length_ReturnValue_1) == 0x0000E8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_Get_Item_1) == 0x0000EC, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Less_IntInt_ReturnValue) == 0x0000F4, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Conv_NameToString_ReturnValue) == 0x0000F8, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Conv_StringToInt_ReturnValue) == 0x000108, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Conv_StringToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00010C, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000110, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000120, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_ExecuteUbergraph_Password_UMG, CallFunc_Array_RemoveItem_ReturnValue) == 0x000121, "Member 'Password_UMG_C_ExecuteUbergraph_Password_UMG::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function Password_UMG.Password_UMG_C.输入密码
// 0x0004 (0x0004 - 0x0000)
struct Password_UMG_C_输入密码 final
{
public:
	int32                                         输入的密码_0; // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Password_UMG_C_输入密码) == 0x000004, "Wrong alignment on Password_UMG_C_输入密码");
static_assert(sizeof(Password_UMG_C_输入密码) == 0x000004, "Wrong size on Password_UMG_C_输入密码");
static_assert(offsetof(Password_UMG_C_输入密码, 输入的密码_0) == 0x000000, "Member 'Password_UMG_C_输入密码::输入的密码_0' has a wrong offset!");

// Function Password_UMG.Password_UMG_C.GetColorAndOpacity_0
// 0x00F0 (0x00F0 - 0x0000)
struct Password_UMG_C_GetColorAndOpacity_0 final
{
public:
	struct FSlateColor                            ReturnValue;                                       // 0x0000(0x0028)(Parm, OutParm, ReturnParm)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0028(0x0028)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0050(0x0018)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_1;                    // 0x0068(0x0028)()
	struct FSlateColor                            K2Node_MakeStruct_SlateColor_2;                    // 0x0090(0x0028)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue_1;            // 0x00B8(0x0018)()
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x00D0(0x0018)()
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_TextText_ReturnValue_1;        // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Password_UMG_C_GetColorAndOpacity_0) == 0x000008, "Wrong alignment on Password_UMG_C_GetColorAndOpacity_0");
static_assert(sizeof(Password_UMG_C_GetColorAndOpacity_0) == 0x0000F0, "Wrong size on Password_UMG_C_GetColorAndOpacity_0");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, ReturnValue) == 0x000000, "Member 'Password_UMG_C_GetColorAndOpacity_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor) == 0x000028, "Member 'Password_UMG_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, CallFunc_MakeLiteralText_ReturnValue) == 0x000050, "Member 'Password_UMG_C_GetColorAndOpacity_0::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_1) == 0x000068, "Member 'Password_UMG_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, K2Node_MakeStruct_SlateColor_2) == 0x000090, "Member 'Password_UMG_C_GetColorAndOpacity_0::K2Node_MakeStruct_SlateColor_2' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, CallFunc_MakeLiteralText_ReturnValue_1) == 0x0000B8, "Member 'Password_UMG_C_GetColorAndOpacity_0::CallFunc_MakeLiteralText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, CallFunc_GetText_ReturnValue) == 0x0000D0, "Member 'Password_UMG_C_GetColorAndOpacity_0::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, CallFunc_EqualEqual_TextText_ReturnValue) == 0x0000E8, "Member 'Password_UMG_C_GetColorAndOpacity_0::CallFunc_EqualEqual_TextText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Password_UMG_C_GetColorAndOpacity_0, CallFunc_EqualEqual_TextText_ReturnValue_1) == 0x0000E9, "Member 'Password_UMG_C_GetColorAndOpacity_0::CallFunc_EqualEqual_TextText_ReturnValue_1' has a wrong offset!");

}

