#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pause_UMG

#include "Basic.hpp"


namespace SDK::Params
{

// Function Pause_UMG.Pause_UMG_C.ExecuteUbergraph_Pause_UMG
// 0x0088 (0x0088 - 0x0000)
struct Pause_UMG_C_ExecuteUbergraph_Pause_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SetGamePaused_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UExitgameConfirmation_UMG1_C*           CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG) == 0x000008, "Wrong alignment on Pause_UMG_C_ExecuteUbergraph_Pause_UMG");
static_assert(sizeof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG) == 0x000088, "Wrong size on Pause_UMG_C_ExecuteUbergraph_Pause_UMG");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, EntryPoint) == 0x000000, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_SetGamePaused_ReturnValue) == 0x000004, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_SetGamePaused_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_Create_ReturnValue) == 0x000028, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_CreateDelegate_OutputDelegate_2) == 0x000030, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_GetPlayerController_ReturnValue) == 0x000040, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000048, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x000050, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, CallFunc_GetPlayerPawn_ReturnValue) == 0x000070, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_DynamicCast_AsPlayer_BP) == 0x000078, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Pause_UMG_C_ExecuteUbergraph_Pause_UMG, K2Node_DynamicCast_bSuccess) == 0x000080, "Member 'Pause_UMG_C_ExecuteUbergraph_Pause_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

