#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Pause_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Pause_UMG.Pause_UMG_C
// 0x0050 (0x02B0 - 0x0260)
class UPause_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       One;                                               // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    CustomButton_UMG;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    CustomButton_UMG1;                                 // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG_C*                    CustomButton_UMG2;                                 // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Pause;                                             // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USettingUmg_C*                          SettingUmg;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_50;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class APlayer_BP_C*                           Player_;                                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Pause_UMG(int32 EntryPoint);
	void SettingReturn();
	void Setting();
	void Choose_Yes();
	void Choose_No();
	void Construct();
	void Close_all_UI_interactions();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Pause_UMG_C">();
	}
	static class UPause_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPause_UMG_C>();
	}
};
static_assert(alignof(UPause_UMG_C) == 0x000008, "Wrong alignment on UPause_UMG_C");
static_assert(sizeof(UPause_UMG_C) == 0x0002B0, "Wrong size on UPause_UMG_C");
static_assert(offsetof(UPause_UMG_C, UberGraphFrame) == 0x000260, "Member 'UPause_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, One) == 0x000268, "Member 'UPause_UMG_C::One' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, CustomButton_UMG) == 0x000270, "Member 'UPause_UMG_C::CustomButton_UMG' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, CustomButton_UMG1) == 0x000278, "Member 'UPause_UMG_C::CustomButton_UMG1' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, CustomButton_UMG2) == 0x000280, "Member 'UPause_UMG_C::CustomButton_UMG2' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, Pause) == 0x000288, "Member 'UPause_UMG_C::Pause' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, SettingUmg) == 0x000290, "Member 'UPause_UMG_C::SettingUmg' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, TextBlock) == 0x000298, "Member 'UPause_UMG_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, TextBlock_50) == 0x0002A0, "Member 'UPause_UMG_C::TextBlock_50' has a wrong offset!");
static_assert(offsetof(UPause_UMG_C, Player_) == 0x0002A8, "Member 'UPause_UMG_C::Player_' has a wrong offset!");

}

