#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickUpKeyboardTips

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PickUpKeyboardTips.PickUpKeyboardTips_C
// 0x0030 (0x0290 - 0x0260)
class UPickUpKeyboardTips_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Circle_1;                                          // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               keyboard;                                          // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             长按提示; // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_PickUpKeyboardTips(int32 EntryPoint);
	void 修改拾取图片(class UMaterialInterface* Texture);
	void 修改提示(ESlateVisibility Circle, ESlateVisibility keyboard_0);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickUpKeyboardTips_C">();
	}
	static class UPickUpKeyboardTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickUpKeyboardTips_C>();
	}
};
static_assert(alignof(UPickUpKeyboardTips_C) == 0x000008, "Wrong alignment on UPickUpKeyboardTips_C");
static_assert(sizeof(UPickUpKeyboardTips_C) == 0x000290, "Wrong size on UPickUpKeyboardTips_C");
static_assert(offsetof(UPickUpKeyboardTips_C, UberGraphFrame) == 0x000260, "Member 'UPickUpKeyboardTips_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UPickUpKeyboardTips_C, Circle_1) == 0x000268, "Member 'UPickUpKeyboardTips_C::Circle_1' has a wrong offset!");
static_assert(offsetof(UPickUpKeyboardTips_C, Image) == 0x000270, "Member 'UPickUpKeyboardTips_C::Image' has a wrong offset!");
static_assert(offsetof(UPickUpKeyboardTips_C, Image_1) == 0x000278, "Member 'UPickUpKeyboardTips_C::Image_1' has a wrong offset!");
static_assert(offsetof(UPickUpKeyboardTips_C, keyboard) == 0x000280, "Member 'UPickUpKeyboardTips_C::keyboard' has a wrong offset!");
static_assert(offsetof(UPickUpKeyboardTips_C, 长按提示) == 0x000288, "Member 'UPickUpKeyboardTips_C::长按提示' has a wrong offset!");

}

