#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PickUpTips

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass PickUpTips.PickUpTips_C
// 0x0018 (0x0278 - 0x0260)
class UPickUpTips_C final : public UUserWidget
{
public:
	class UImage*                                 Image;                                             // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PickUpTips_C">();
	}
	static class UPickUpTips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPickUpTips_C>();
	}
};
static_assert(alignof(UPickUpTips_C) == 0x000008, "Wrong alignment on UPickUpTips_C");
static_assert(sizeof(UPickUpTips_C) == 0x000278, "Wrong size on UPickUpTips_C");
static_assert(offsetof(UPickUpTips_C, Image) == 0x000260, "Member 'UPickUpTips_C::Image' has a wrong offset!");
static_assert(offsetof(UPickUpTips_C, Image_0) == 0x000268, "Member 'UPickUpTips_C::Image_0' has a wrong offset!");
static_assert(offsetof(UPickUpTips_C, Image_1) == 0x000270, "Member 'UPickUpTips_C::Image_1' has a wrong offset!");

}

