#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayerSpawnPoint_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlayerSpawnPoint_BP.PlayerSpawnPoint_BP_C.ExecuteUbergraph_PlayerSpawnPoint_BP
// 0x0188 (0x0188 - 0x0000)
struct PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_RandomRotator_ReturnValue;                // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetControlRotation_ReturnValue;           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetAllActorsWithTag_OutActors;            // 0x0090(0x0010)(ReferenceParm)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x00D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x3];                                       // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X_1;                          // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00FC(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP) == 0x000008, "Wrong alignment on PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP");
static_assert(sizeof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP) == 0x000188, "Wrong size on PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, EntryPoint) == 0x000000, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, K2Node_DynamicCast_AsMy_Game_Instance) == 0x000010, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::K2Node_DynamicCast_AsMy_Game_Instance' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_GetPlayerPawn_ReturnValue) == 0x000020, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, K2Node_DynamicCast_AsPlayer_BP) == 0x000028, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_RandomRotator_ReturnValue) == 0x000034, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_RandomRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Roll) == 0x00004C, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Pitch) == 0x000050, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Yaw) == 0x000054, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_X) == 0x000058, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_Y) == 0x00005C, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_Z) == 0x000060, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_MakeRotator_ReturnValue) == 0x000064, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_GetPlayerController_ReturnValue) == 0x000070, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_GetControlRotation_ReturnValue) == 0x000078, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_GetControlRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Roll_1) == 0x000084, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Pitch_1) == 0x000088, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakRotator_Yaw_1) == 0x00008C, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_GetAllActorsWithTag_OutActors) == 0x000090, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_GetAllActorsWithTag_OutActors' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_MakeRotator_ReturnValue_1) == 0x0000A0, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_Array_Length_ReturnValue) == 0x0000AC, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000B0, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_Subtract_IntInt_ReturnValue) == 0x0000B4, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0000B8, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_Array_Get_Item) == 0x0000C0, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000C8, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x0000D4, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x0000E0, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_X_1) == 0x0000E4, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_Y_1) == 0x0000E8, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_BreakVector_Z_1) == 0x0000EC, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_MakeVector_ReturnValue) == 0x0000F0, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000FC, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000184, "Member 'PlayerSpawnPoint_BP_C_ExecuteUbergraph_PlayerSpawnPoint_BP::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

}

