#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlotClue_Blueprint

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.ExecuteUbergraph_PlotClue_Blueprint
// 0x02A8 (0x02A8 - 0x0000)
struct PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMistyQuest_BP_C*                       CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_Player;                               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocationAndRotation_SweepHitResult; // 0x0024(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocationAndRotation_ReturnValue; // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_2;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_3;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class U剧情线索_UMG_C* CallFunc_Create_ReturnValue;                       // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_3;                  // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_On;                             // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Flashlight_Demo_C*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0110(0x0010)(ReferenceParm)
	class ABP_Flashlight_Demo_C*                  CallFunc_Array_Get_Item;                           // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_Flashlight_Demo_C*>          CallFunc_GetAllActorsOfClass_OutActors_1;          // 0x0128(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Flashlight_Demo_C*                  CallFunc_Array_Get_Item_1;                         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputActionEvent_Key;                       // 0x0150(0x0018)(HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_185[0x3];                                      // 0x0185(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0188(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0210(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0228(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_4;                  // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0238(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_239[0x7];                                      // 0x0239(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_5;                  // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_1;        // 0x0258(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips;        // 0x0260(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_1;      // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue_2;        // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPickUpKeyboardTips_C*                  K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_2;      // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_8;                     // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_As_____;                        // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_9;                     // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint) == 0x000008, "Wrong alignment on PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint");
static_assert(sizeof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint) == 0x0002A8, "Wrong size on PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, EntryPoint) == 0x000000, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::EntryPoint' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_Event_Player) == 0x000010, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP) == 0x000018, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_K2_SetActorLocationAndRotation_SweepHitResult) == 0x000024, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_K2_SetActorLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_K2_SetActorLocationAndRotation_ReturnValue) == 0x0000AC, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_K2_SetActorLocationAndRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetPlayerController_ReturnValue) == 0x0000B0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetPlayerController_ReturnValue_1) == 0x0000B8, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetPlayerController_ReturnValue_2) == 0x0000C0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetPlayerController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP_1) == 0x0000C8, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetPlayerController_ReturnValue_3) == 0x0000D8, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetPlayerController_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000E0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_Create_ReturnValue) == 0x0000E8, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP_2) == 0x0000F0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP_2' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_2) == 0x0000F8, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP_3) == 0x000100, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP_3' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_3) == 0x000108, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_CustomEvent_On) == 0x000109, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_CustomEvent_On' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00010C, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetAllActorsOfClass_OutActors) == 0x000110, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_Array_Get_Item) == 0x000120, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetAllActorsOfClass_OutActors_1) == 0x000128, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetAllActorsOfClass_OutActors_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_IsValid_ReturnValue) == 0x000138, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_Array_Get_Item_1) == 0x000140, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_IsValid_ReturnValue_1) == 0x000148, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_InputActionEvent_Key) == 0x000150, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_InputActionEvent_Key' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000168, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000170, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000178, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000180, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_bFromSweep) == 0x000184, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_SweepResult) == 0x000188, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000210, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherActor) == 0x000218, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherComp) == 0x000220, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000228, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP_4) == 0x000230, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP_4' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_4) == 0x000238, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPlayer_BP_5) == 0x000240, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPlayer_BP_5' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_5) == 0x000248, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000250, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetUserWidgetObject_ReturnValue_1) == 0x000258, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetUserWidgetObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips) == 0x000260, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_6) == 0x000268, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_1) == 0x000270, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_1' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_7) == 0x000278, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, CallFunc_GetUserWidgetObject_ReturnValue_2) == 0x000280, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::CallFunc_GetUserWidgetObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_2) == 0x000288, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_AsPick_Up_Keyboard_Tips_2' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_8) == 0x000290, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_8' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_As_____) == 0x000298, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint, K2Node_DynamicCast_bSuccess_9) == 0x0002A0, "Member 'PlotClue_Blueprint_C_ExecuteUbergraph_PlotClue_Blueprint::K2Node_DynamicCast_bSuccess_9' has a wrong offset!");

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00A8 (0x00A8 - 0x0000)
struct PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x0088)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000A8, "Wrong size on PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'PlotClue_Blueprint_C_BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.手电筒开关
// 0x0001 (0x0001 - 0x0000)
struct PlotClue_Blueprint_C_手电筒开关 final
{
public:
	bool                                          ON;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlotClue_Blueprint_C_手电筒开关) == 0x000001, "Wrong alignment on PlotClue_Blueprint_C_手电筒开关");
static_assert(sizeof(PlotClue_Blueprint_C_手电筒开关) == 0x000001, "Wrong size on PlotClue_Blueprint_C_手电筒开关");
static_assert(offsetof(PlotClue_Blueprint_C_手电筒开关, ON) == 0x000000, "Member 'PlotClue_Blueprint_C_手电筒开关::ON' has a wrong offset!");

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.PlayerInteration
// 0x0008 (0x0008 - 0x0000)
struct PlotClue_Blueprint_C_PlayerInteration final
{
public:
	class AActor*                                 Player_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(PlotClue_Blueprint_C_PlayerInteration) == 0x000008, "Wrong alignment on PlotClue_Blueprint_C_PlayerInteration");
static_assert(sizeof(PlotClue_Blueprint_C_PlayerInteration) == 0x000008, "Wrong size on PlotClue_Blueprint_C_PlayerInteration");
static_assert(offsetof(PlotClue_Blueprint_C_PlayerInteration, Player_0) == 0x000000, "Member 'PlotClue_Blueprint_C_PlayerInteration::Player_0' has a wrong offset!");

// Function PlotClue_Blueprint.PlotClue_Blueprint_C.InpActEvt_PlayerInteration_K2Node_InputActionEvent_0
// 0x0018 (0x0018 - 0x0000)
struct PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
static_assert(alignof(PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0) == 0x000008, "Wrong alignment on PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0");
static_assert(sizeof(PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0) == 0x000018, "Wrong size on PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0");
static_assert(offsetof(PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0, Key) == 0x000000, "Member 'PlotClue_Blueprint_C_InpActEvt_PlayerInteration_K2Node_InputActionEvent_0::Key' has a wrong offset!");

}

