#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlotClue_Blueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass PlotClue_Blueprint.PlotClue_Blueprint_C
// 0x0060 (0x0280 - 0x0220)
class APlotClue_Blueprint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere1;                                           // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       拾取提示; // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Paper_4_StaticMeshComponent0;                   // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCameraActor1_CameraComponent;                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CineCameraActor1_SceneComponent;                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SharedRoot;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AMistyQuest_BP_C*                       Quest_Ref;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSee_;                                            // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Player;                                            // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class U剧情线索_UMG_C* 剧情字幕线索UMG; // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Overlap_;                                          // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_PlotClue_Blueprint(int32 EntryPoint);
	void BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_cp02_Sphere1_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void 手电筒开关(bool ON);
	void BreakInteration();
	void RenderDeepClose();
	void RenderDeepOpen();
	void PlayerInteration(class AActor* Player_0);
	void ReceiveBeginPlay();
	void InpActEvt_PlayerInteration_K2Node_InputActionEvent_0(const struct FKey& Key);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"PlotClue_Blueprint_C">();
	}
	static class APlotClue_Blueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlotClue_Blueprint_C>();
	}
};
static_assert(alignof(APlotClue_Blueprint_C) == 0x000008, "Wrong alignment on APlotClue_Blueprint_C");
static_assert(sizeof(APlotClue_Blueprint_C) == 0x000280, "Wrong size on APlotClue_Blueprint_C");
static_assert(offsetof(APlotClue_Blueprint_C, UberGraphFrame) == 0x000220, "Member 'APlotClue_Blueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, Sphere1) == 0x000228, "Member 'APlotClue_Blueprint_C::Sphere1' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, 拾取提示) == 0x000230, "Member 'APlotClue_Blueprint_C::拾取提示' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, SM_Paper_4_StaticMeshComponent0) == 0x000238, "Member 'APlotClue_Blueprint_C::SM_Paper_4_StaticMeshComponent0' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, CineCameraActor1_CameraComponent) == 0x000240, "Member 'APlotClue_Blueprint_C::CineCameraActor1_CameraComponent' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, CineCameraActor1_SceneComponent) == 0x000248, "Member 'APlotClue_Blueprint_C::CineCameraActor1_SceneComponent' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, SharedRoot) == 0x000250, "Member 'APlotClue_Blueprint_C::SharedRoot' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, Quest_Ref) == 0x000258, "Member 'APlotClue_Blueprint_C::Quest_Ref' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, IsSee_) == 0x000260, "Member 'APlotClue_Blueprint_C::IsSee_' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, Player) == 0x000268, "Member 'APlotClue_Blueprint_C::Player' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, 剧情字幕线索UMG) == 0x000270, "Member 'APlotClue_Blueprint_C::剧情字幕线索UMG' has a wrong offset!");
static_assert(offsetof(APlotClue_Blueprint_C, Overlap_) == 0x000278, "Member 'APlotClue_Blueprint_C::Overlap_' has a wrong offset!");

}

