#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Producer_Umg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Producer_Umg.Producer_Umg_C
// 0x0048 (0x02A8 - 0x0260)
class UProducer_Umg_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Four;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Three;                                             // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_176;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock;                                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_140;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_516;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_735;                                     // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturnButton_UMG_C*                    返回按钮; // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Producer_Umg(int32 EntryPoint);
	void Construct();
	void BndEvt__Producer_Umg_返回按钮_K2Node_ComponentBoundEvent_0_Click__DelegateSignature();
	void BndEvt__Button_176_K2Node_ComponentBoundEvent_8_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_176_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__Button_176_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Producer_Umg_C">();
	}
	static class UProducer_Umg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProducer_Umg_C>();
	}
};
static_assert(alignof(UProducer_Umg_C) == 0x000008, "Wrong alignment on UProducer_Umg_C");
static_assert(sizeof(UProducer_Umg_C) == 0x0002A8, "Wrong size on UProducer_Umg_C");
static_assert(offsetof(UProducer_Umg_C, UberGraphFrame) == 0x000260, "Member 'UProducer_Umg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, Four) == 0x000268, "Member 'UProducer_Umg_C::Four' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, Three) == 0x000270, "Member 'UProducer_Umg_C::Three' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, Button_176) == 0x000278, "Member 'UProducer_Umg_C::Button_176' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, TextBlock) == 0x000280, "Member 'UProducer_Umg_C::TextBlock' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, TextBlock_140) == 0x000288, "Member 'UProducer_Umg_C::TextBlock_140' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, TextBlock_516) == 0x000290, "Member 'UProducer_Umg_C::TextBlock_516' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, TextBlock_735) == 0x000298, "Member 'UProducer_Umg_C::TextBlock_735' has a wrong offset!");
static_assert(offsetof(UProducer_Umg_C, 返回按钮) == 0x0002A0, "Member 'UProducer_Umg_C::返回按钮' has a wrong offset!");

}

