#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Producer_Umg

#include "Basic.hpp"


namespace SDK::Params
{

// Function Producer_Umg.Producer_Umg_C.ExecuteUbergraph_Producer_Umg
// 0x0038 (0x0038 - 0x0000)
struct Producer_Umg_C_ExecuteUbergraph_Producer_Umg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0008(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg) == 0x000008, "Wrong alignment on Producer_Umg_C_ExecuteUbergraph_Producer_Umg");
static_assert(sizeof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg) == 0x000038, "Wrong size on Producer_Umg_C_ExecuteUbergraph_Producer_Umg");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, EntryPoint) == 0x000000, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::EntryPoint' has a wrong offset!");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000008, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, CallFunc_Array_Get_Item) == 0x000018, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, CallFunc_PlayAnimation_ReturnValue_1) == 0x000028, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Producer_Umg_C_ExecuteUbergraph_Producer_Umg, CallFunc_PlayAnimation_ReturnValue_2) == 0x000030, "Member 'Producer_Umg_C_ExecuteUbergraph_Producer_Umg::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

}

