#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QTE_TIP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QTE_TIP.QTE_TIP_C
// 0x0018 (0x0278 - 0x0260)
class UQTE_TIP_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       tips;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QTE_TIP(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QTE_TIP_C">();
	}
	static class UQTE_TIP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQTE_TIP_C>();
	}
};
static_assert(alignof(UQTE_TIP_C) == 0x000008, "Wrong alignment on UQTE_TIP_C");
static_assert(sizeof(UQTE_TIP_C) == 0x000278, "Wrong size on UQTE_TIP_C");
static_assert(offsetof(UQTE_TIP_C, UberGraphFrame) == 0x000260, "Member 'UQTE_TIP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQTE_TIP_C, tips) == 0x000268, "Member 'UQTE_TIP_C::tips' has a wrong offset!");
static_assert(offsetof(UQTE_TIP_C, Image_0) == 0x000270, "Member 'UQTE_TIP_C::Image_0' has a wrong offset!");

}

