#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestTipUI_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function QuestTipUI_BP.QuestTipUI_BP_C.ExecuteUbergraph_QuestTipUI_BP
// 0x0050 (0x0050 - 0x0000)
struct QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent________;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_QuestSystem;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetUserWidgetObject_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBackroomQuestTips_UMG_C*               K2Node_DynamicCast_AsBackroom_Quest_Tips_UMG;      // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP) == 0x000008, "Wrong alignment on QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP");
static_assert(sizeof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP) == 0x000050, "Wrong size on QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, EntryPoint) == 0x000000, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_CustomEvent_InText) == 0x000008, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_CustomEvent_InText' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_CustomEvent_Texture) == 0x000020, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_CustomEvent________) == 0x000028, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_CustomEvent________' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_CustomEvent_QuestSystem) == 0x000030, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_CustomEvent_QuestSystem' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, CallFunc_GetUserWidgetObject_ReturnValue) == 0x000038, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::CallFunc_GetUserWidgetObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_DynamicCast_AsBackroom_Quest_Tips_UMG) == 0x000040, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_DynamicCast_AsBackroom_Quest_Tips_UMG' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'QuestTipUI_BP_C_ExecuteUbergraph_QuestTipUI_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function QuestTipUI_BP.QuestTipUI_BP_C.初始化计数任务
// 0x0010 (0x0010 - 0x0000)
struct QuestTipUI_BP_C_初始化计数任务 final
{
public:
	int32                                         总共要完成几个; // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 QuestSystem_0;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestTipUI_BP_C_初始化计数任务) == 0x000008, "Wrong alignment on QuestTipUI_BP_C_初始化计数任务");
static_assert(sizeof(QuestTipUI_BP_C_初始化计数任务) == 0x000010, "Wrong size on QuestTipUI_BP_C_初始化计数任务");
static_assert(offsetof(QuestTipUI_BP_C_初始化计数任务, 总共要完成几个) == 0x000000, "Member 'QuestTipUI_BP_C_初始化计数任务::总共要完成几个' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_初始化计数任务, QuestSystem_0) == 0x000008, "Member 'QuestTipUI_BP_C_初始化计数任务::QuestSystem_0' has a wrong offset!");

// Function QuestTipUI_BP.QuestTipUI_BP_C.刷新任务系统
// 0x0020 (0x0020 - 0x0000)
struct QuestTipUI_BP_C_刷新任务系统 final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             Texture;                                           // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestTipUI_BP_C_刷新任务系统) == 0x000008, "Wrong alignment on QuestTipUI_BP_C_刷新任务系统");
static_assert(sizeof(QuestTipUI_BP_C_刷新任务系统) == 0x000020, "Wrong size on QuestTipUI_BP_C_刷新任务系统");
static_assert(offsetof(QuestTipUI_BP_C_刷新任务系统, InText) == 0x000000, "Member 'QuestTipUI_BP_C_刷新任务系统::InText' has a wrong offset!");
static_assert(offsetof(QuestTipUI_BP_C_刷新任务系统, Texture) == 0x000018, "Member 'QuestTipUI_BP_C_刷新任务系统::Texture' has a wrong offset!");

}

