#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RealtimeCoordinateTip_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass RealtimeCoordinateTip_UMG.RealtimeCoordinateTip_UMG_C
// 0x0030 (0x0290 - 0x0260)
class URealtimeCoordinateTip_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_43;                                      // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   In_Text;                                           // 0x0278(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_RealtimeCoordinateTip_UMG(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"RealtimeCoordinateTip_UMG_C">();
	}
	static class URealtimeCoordinateTip_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URealtimeCoordinateTip_UMG_C>();
	}
};
static_assert(alignof(URealtimeCoordinateTip_UMG_C) == 0x000008, "Wrong alignment on URealtimeCoordinateTip_UMG_C");
static_assert(sizeof(URealtimeCoordinateTip_UMG_C) == 0x000290, "Wrong size on URealtimeCoordinateTip_UMG_C");
static_assert(offsetof(URealtimeCoordinateTip_UMG_C, UberGraphFrame) == 0x000260, "Member 'URealtimeCoordinateTip_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(URealtimeCoordinateTip_UMG_C, NewAnimation) == 0x000268, "Member 'URealtimeCoordinateTip_UMG_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(URealtimeCoordinateTip_UMG_C, TextBlock_43) == 0x000270, "Member 'URealtimeCoordinateTip_UMG_C::TextBlock_43' has a wrong offset!");
static_assert(offsetof(URealtimeCoordinateTip_UMG_C, In_Text) == 0x000278, "Member 'URealtimeCoordinateTip_UMG_C::In_Text' has a wrong offset!");

}

