#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Roller_door_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Roller_door_BP.Roller_door_BP_C.ExecuteUbergraph_Roller_door_BP
// 0x0040 (0x0040 - 0x0000)
struct Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USKM_Roller_door_Anim_C*                K2Node_DynamicCast_AsSKM_Roller_Door_Anim;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABackroom_Quest_BP_C*                   CallFunc_GetActorOfClass_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP) == 0x000008, "Wrong alignment on Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP");
static_assert(sizeof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP) == 0x000040, "Wrong size on Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, EntryPoint) == 0x000000, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, CallFunc_GetAnimInstance_ReturnValue) == 0x000008, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, K2Node_DynamicCast_AsSKM_Roller_Door_Anim) == 0x000010, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::K2Node_DynamicCast_AsSKM_Roller_Door_Anim' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00001C, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000028, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP, CallFunc_GetActorOfClass_ReturnValue) == 0x000038, "Member 'Roller_door_BP_C_ExecuteUbergraph_Roller_door_BP::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");

}

