#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScrappedCar_BP

#include "Basic.hpp"


namespace SDK::Params
{

// Function ScrappedCar_BP.ScrappedCar_BP_C.ExecuteUbergraph_ScrappedCar_BP
// 0x0038 (0x0038 - 0x0000)
struct ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ___object_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ___object_Variable_1;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ___object_Variable_2;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     ___object_Variable_3;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     K2Node_Select_Default;                             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP) == 0x000008, "Wrong alignment on ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP");
static_assert(sizeof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP) == 0x000038, "Wrong size on ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, EntryPoint) == 0x000000, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, CallFunc_RandomIntegerInRange_ReturnValue) == 0x000004, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, ___int_Variable) == 0x000008, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::___int_Variable' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, ___object_Variable) == 0x000010, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::___object_Variable' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, ___object_Variable_1) == 0x000018, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, ___object_Variable_2) == 0x000020, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::___object_Variable_2' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, ___object_Variable_3) == 0x000028, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::___object_Variable_3' has a wrong offset!");
static_assert(offsetof(ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP, K2Node_Select_Default) == 0x000030, "Member 'ScrappedCar_BP_C_ExecuteUbergraph_ScrappedCar_BP::K2Node_Select_Default' has a wrong offset!");

}

