#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ScreenDamage_Umg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass ScreenDamage_Umg.ScreenDamage_Umg_C
// 0x0020 (0x0280 - 0x0260)
class UScreenDamage_Umg_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Dead;                                              // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ScreenDamage;                                      // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_49;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ScreenDamage_Umg(int32 EntryPoint);
	void DamageEffect();
	void DeadScreen(EUMGSequencePlayMode PlayMode);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ScreenDamage_Umg_C">();
	}
	static class UScreenDamage_Umg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UScreenDamage_Umg_C>();
	}
};
static_assert(alignof(UScreenDamage_Umg_C) == 0x000008, "Wrong alignment on UScreenDamage_Umg_C");
static_assert(sizeof(UScreenDamage_Umg_C) == 0x000280, "Wrong size on UScreenDamage_Umg_C");
static_assert(offsetof(UScreenDamage_Umg_C, UberGraphFrame) == 0x000260, "Member 'UScreenDamage_Umg_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UScreenDamage_Umg_C, Dead) == 0x000268, "Member 'UScreenDamage_Umg_C::Dead' has a wrong offset!");
static_assert(offsetof(UScreenDamage_Umg_C, ScreenDamage) == 0x000270, "Member 'UScreenDamage_Umg_C::ScreenDamage' has a wrong offset!");
static_assert(offsetof(UScreenDamage_Umg_C, Image_49) == 0x000278, "Member 'UScreenDamage_Umg_C::Image_49' has a wrong offset!");

}

