#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SCUE4

#include "Basic.hpp"

#include "SCUE4_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeBool
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeBool) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeBool");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeBool) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeBool");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeBool, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeBool::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeBool, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeBool::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeByte
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeByte) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeByte");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeByte) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeByte");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeByte, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeByte::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeByte, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeByte::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeFloat
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeFloat) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeFloat");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeFloat) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeFloat");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeFloat, SF) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeFloat::SF' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeFloat, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeFloat::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeInt
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeInt) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeInt");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeInt) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeInt");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeInt, SI) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeInt::SI' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeInt, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeInt::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeName
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeName) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeName");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeName) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeName");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeName, SN) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeName::SN' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeName, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeName::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeString
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeString) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeString");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeString) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeString");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeString, SS) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeString::SS' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeString, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeString::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetRawSafeText
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetRawSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetRawSafeText) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetRawSafeText");
static_assert(sizeof(SCLibrary_SCL_Callable_GetRawSafeText) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetRawSafeText");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeText, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetRawSafeText::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetRawSafeText, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetRawSafeText::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeBool
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeBool) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeBool");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeBool) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_GetSafeBool");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeBool, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeBool::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeBool, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeBool::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeBoolWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeBoolWithKey final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeBoolWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeBoolWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeBoolWithKey) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeBoolWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeBoolWithKey, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeBoolWithKey::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeBoolWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeBoolWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeBoolWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeBoolWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeByte
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeByte) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeByte");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeByte) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_GetSafeByte");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeByte, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeByte::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeByte, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeByte::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeByteWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeByteWithKey final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeByteWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeByteWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeByteWithKey) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeByteWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeByteWithKey, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeByteWithKey::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeByteWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeByteWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeByteWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeByteWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeColor
// 0x00A8 (0x00A8 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeColor final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeColor) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeColor");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeColor) == 0x0000A8, "Wrong size on SCLibrary_SCL_Callable_GetSafeColor");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeColor, SC) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeColor::SC' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeColor, ReturnValue) == 0x000098, "Member 'SCLibrary_SCL_Callable_GetSafeColor::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeColorWithKey
// 0x00B8 (0x00B8 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeColorWithKey final
{
public:
	struct FSafeColor                             SC;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x00A8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeColorWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeColorWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeColorWithKey) == 0x0000B8, "Wrong size on SCLibrary_SCL_Callable_GetSafeColorWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeColorWithKey, SC) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeColorWithKey::SC' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeColorWithKey, Key) == 0x000098, "Member 'SCLibrary_SCL_Callable_GetSafeColorWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeColorWithKey, ReturnValue) == 0x0000A8, "Member 'SCLibrary_SCL_Callable_GetSafeColorWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeFloat
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeFloat) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeFloat");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeFloat) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_GetSafeFloat");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeFloat, SF) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeFloat::SF' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeFloat, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeFloat::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeFloatWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeFloatWithKey final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeFloatWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeFloatWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeFloatWithKey) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeFloatWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeFloatWithKey, SF) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeFloatWithKey::SF' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeFloatWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeFloatWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeFloatWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeFloatWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeInt
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeInt) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeInt");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeInt) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_GetSafeInt");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeInt, SI) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeInt::SI' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeInt, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeInt::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeIntWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeIntWithKey final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeIntWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeIntWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeIntWithKey) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeIntWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeIntWithKey, SI) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeIntWithKey::SI' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeIntWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeIntWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeIntWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeIntWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeName
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeName) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeName");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeName) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_GetSafeName");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeName, SN) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeName::SN' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeName, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeName::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeNameWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeNameWithKey final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeNameWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeNameWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeNameWithKey) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeNameWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeNameWithKey, SN) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeNameWithKey::SN' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeNameWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeNameWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeNameWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeNameWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeRotator
// 0x0088 (0x0088 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeRotator final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0078(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeRotator) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeRotator");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeRotator) == 0x000088, "Wrong size on SCLibrary_SCL_Callable_GetSafeRotator");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeRotator, SR) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeRotator::SR' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeRotator, ReturnValue) == 0x000078, "Member 'SCLibrary_SCL_Callable_GetSafeRotator::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeRotatorWithKey
// 0x0098 (0x0098 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeRotatorWithKey final
{
public:
	struct FSafeRotator                           SR;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               ReturnValue;                                       // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeRotatorWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeRotatorWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeRotatorWithKey) == 0x000098, "Wrong size on SCLibrary_SCL_Callable_GetSafeRotatorWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeRotatorWithKey, SR) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeRotatorWithKey::SR' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeRotatorWithKey, Key) == 0x000078, "Member 'SCLibrary_SCL_Callable_GetSafeRotatorWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeRotatorWithKey, ReturnValue) == 0x000088, "Member 'SCLibrary_SCL_Callable_GetSafeRotatorWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeString
// 0x0048 (0x0048 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeString) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeString");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeString) == 0x000048, "Wrong size on SCLibrary_SCL_Callable_GetSafeString");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeString, SS) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeString::SS' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeString, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeString::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeStringWithKey
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeStringWithKey final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeStringWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeStringWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeStringWithKey) == 0x000058, "Wrong size on SCLibrary_SCL_Callable_GetSafeStringWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeStringWithKey, SS) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeStringWithKey::SS' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeStringWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeStringWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeStringWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeStringWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeText
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0038(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeText) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeText");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeText) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_GetSafeText");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeText, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeText::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeText, ReturnValue) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeText::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTextWithKey
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTextWithKey final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeTextWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeTextWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeTextWithKey) == 0x000060, "Wrong size on SCLibrary_SCL_Callable_GetSafeTextWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTextWithKey, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeTextWithKey::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTextWithKey, Key) == 0x000038, "Member 'SCLibrary_SCL_Callable_GetSafeTextWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTextWithKey, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_GetSafeTextWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTransform
// 0x01A0 (0x01A0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTransform final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_168[0x8];                                      // 0x0168(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0170(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeTransform) == 0x000010, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeTransform");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeTransform) == 0x0001A0, "Wrong size on SCLibrary_SCL_Callable_GetSafeTransform");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTransform, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeTransform::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTransform, ReturnValue) == 0x000170, "Member 'SCLibrary_SCL_Callable_GetSafeTransform::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeTransformWithKey
// 0x01B0 (0x01B0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeTransformWithKey final
{
public:
	struct FSafeTransform                         ST;                                                // 0x0000(0x0168)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0168(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178[0x8];                                      // 0x0178(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ReturnValue;                                       // 0x0180(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeTransformWithKey) == 0x000010, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeTransformWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeTransformWithKey) == 0x0001B0, "Wrong size on SCLibrary_SCL_Callable_GetSafeTransformWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTransformWithKey, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeTransformWithKey::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTransformWithKey, Key) == 0x000168, "Member 'SCLibrary_SCL_Callable_GetSafeTransformWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeTransformWithKey, ReturnValue) == 0x000180, "Member 'SCLibrary_SCL_Callable_GetSafeTransformWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector2D
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector2D final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0058(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector2D) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector2D");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector2D) == 0x000060, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector2D");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector2D, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector2D::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector2D, ReturnValue) == 0x000058, "Member 'SCLibrary_SCL_Callable_GetSafeVector2D::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector2DWithKey
// 0x0070 (0x0070 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector2DWithKey final
{
public:
	struct FSafeVector2D                          SV;                                                // 0x0000(0x0058)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0058(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0068(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector2DWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector2DWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector2DWithKey) == 0x000070, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector2DWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector2DWithKey, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector2DWithKey::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector2DWithKey, Key) == 0x000058, "Member 'SCLibrary_SCL_Callable_GetSafeVector2DWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector2DWithKey, ReturnValue) == 0x000068, "Member 'SCLibrary_SCL_Callable_GetSafeVector2DWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector3D
// 0x0088 (0x0088 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector3D final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0078(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector3D) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector3D");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector3D) == 0x000088, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector3D");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector3D, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector3D::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector3D, ReturnValue) == 0x000078, "Member 'SCLibrary_SCL_Callable_GetSafeVector3D::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector3DWithKey
// 0x0098 (0x0098 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector3DWithKey final
{
public:
	struct FSafeVector3D                          SV;                                                // 0x0000(0x0078)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0078(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0088(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector3DWithKey) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector3DWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector3DWithKey) == 0x000098, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector3DWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector3DWithKey, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector3DWithKey::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector3DWithKey, Key) == 0x000078, "Member 'SCLibrary_SCL_Callable_GetSafeVector3DWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector3DWithKey, ReturnValue) == 0x000088, "Member 'SCLibrary_SCL_Callable_GetSafeVector3DWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector4D
// 0x00B0 (0x00B0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector4D final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x8];                                       // 0x0098(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x00A0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector4D) == 0x000010, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector4D");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector4D) == 0x0000B0, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector4D");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector4D, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector4D::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector4D, ReturnValue) == 0x0000A0, "Member 'SCLibrary_SCL_Callable_GetSafeVector4D::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_GetSafeVector4DWithKey
// 0x00C0 (0x00C0 - 0x0000)
struct SCLibrary_SCL_Callable_GetSafeVector4DWithKey final
{
public:
	struct FSafeVector4D                          SV;                                                // 0x0000(0x0098)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0098(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A8[0x8];                                       // 0x00A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x00B0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_GetSafeVector4DWithKey) == 0x000010, "Wrong alignment on SCLibrary_SCL_Callable_GetSafeVector4DWithKey");
static_assert(sizeof(SCLibrary_SCL_Callable_GetSafeVector4DWithKey) == 0x0000C0, "Wrong size on SCLibrary_SCL_Callable_GetSafeVector4DWithKey");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector4DWithKey, SV) == 0x000000, "Member 'SCLibrary_SCL_Callable_GetSafeVector4DWithKey::SV' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector4DWithKey, Key) == 0x000098, "Member 'SCLibrary_SCL_Callable_GetSafeVector4DWithKey::Key' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_GetSafeVector4DWithKey, ReturnValue) == 0x0000B0, "Member 'SCLibrary_SCL_Callable_GetSafeVector4DWithKey::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeBool
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeBool) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeBool");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeBool) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeBool");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeBool, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeBool::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeBool, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeBool::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeBool, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeBool::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeByte
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeByte final
{
public:
	struct FSafeByte                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeByte) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeByte");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeByte) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeByte");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeByte, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeByte::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeByte, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeByte::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeByte, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeByte::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeFloat
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeFloat final
{
public:
	struct FSafeFloat                             SF;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeFloat) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeFloat");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeFloat) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeFloat");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeFloat, SF) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeFloat::SF' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeFloat, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeFloat::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeFloat, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeFloat::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeInt
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeInt final
{
public:
	struct FSafeInt                               SI;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeInt) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeInt");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeInt) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeInt");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeInt, SI) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeInt::SI' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeInt, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeInt::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeInt, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeInt::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeName
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeName final
{
public:
	struct FSafeName                              SN;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0048(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeName) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeName");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeName) == 0x000050, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeName");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeName, SN) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeName::SN' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeName, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeName::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeName, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeName::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeString
// 0x0058 (0x0058 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeString final
{
public:
	struct FSafeString                            SS;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0048(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeString) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeString");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeString) == 0x000058, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeString");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeString, SS) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeString::SS' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeString, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeString::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeString, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeString::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetRawSafeText
// 0x0060 (0x0060 - 0x0000)
struct SCLibrary_SCL_Callable_SetRawSafeText final
{
public:
	struct FSafeText                              ST;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   ReturnValue;                                       // 0x0048(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(SCLibrary_SCL_Callable_SetRawSafeText) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetRawSafeText");
static_assert(sizeof(SCLibrary_SCL_Callable_SetRawSafeText) == 0x000060, "Wrong size on SCLibrary_SCL_Callable_SetRawSafeText");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeText, ST) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetRawSafeText::ST' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeText, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetRawSafeText::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetRawSafeText, ReturnValue) == 0x000048, "Member 'SCLibrary_SCL_Callable_SetRawSafeText::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeBool
// 0x0040 (0x0040 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeBool final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Value;                                             // 0x0038(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0039(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(SCLibrary_SCL_Callable_SetSafeBool) == 0x000008, "Wrong alignment on SCLibrary_SCL_Callable_SetSafeBool");
static_assert(sizeof(SCLibrary_SCL_Callable_SetSafeBool) == 0x000040, "Wrong size on SCLibrary_SCL_Callable_SetSafeBool");
static_assert(offsetof(SCLibrary_SCL_Callable_SetSafeBool, SB) == 0x000000, "Member 'SCLibrary_SCL_Callable_SetSafeBool::SB' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetSafeBool, Value) == 0x000038, "Member 'SCLibrary_SCL_Callable_SetSafeBool::Value' has a wrong offset!");
static_assert(offsetof(SCLibrary_SCL_Callable_SetSafeBool, ReturnValue) == 0x000039, "Member 'SCLibrary_SCL_Callable_SetSafeBool::ReturnValue' has a wrong offset!");

// Function SCUE4.SCLibrary.SCL_Callable_SetSafeBoolWithKey
// 0x0050 (0x0050 - 0x0000)
struct SCLibrary_SCL_Callable_SetSafeBoolWithKey final
{
public:
	struct FSafeBool                              SB;                                                // 0x0000(0x0038)(Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Key;                                               // 0x0038(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
