#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingUmg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "CustomMapping_Struct_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function SettingUmg.SettingUmg_C.ExecuteUbergraph_SettingUmg
// 0x0608 (0x0608 - 0x0000)
struct SettingUmg_C_ExecuteUbergraph_SettingUmg final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_1;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomMapping_Slot_C*                  CallFunc_Create_ReturnValue;                       // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable_1;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_True_if_break_was_hit_Variable_2;          // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3E[0x2];                                       // 0x003E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_3;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_4;                     // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_5;                     // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputActionKeyMapping                 K2Node_Event_InputAction;                          // 0x0060(0x0028)()
	struct FInputAxisKeyMapping                   K2Node_Event_InputAxis;                            // 0x0088(0x0028)()
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Clamp_ReturnValue;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_Conv_IntToByte_ReturnValue;               // 0x00BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD[0x3];                                       // 0x00BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event___;                                   // 0x00C8(0x0018)()
	class FText                                   K2Node_Event____1;                                 // 0x00E0(0x0018)()
	int32                                         ___int_Loop_Counter_Variable_4;                    // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_6;                     // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue;             // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomMapping_Struct                  CallFunc_Array_Get_Item;                           // 0x0118(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings;       // 0x0188(0x0010)(ReferenceParm)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings;         // 0x0198(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_1;                         // 0x01A8(0x0028)()
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0028)()
	bool                                          CallFunc_Key_IsMouseButton_ReturnValue;            // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0200(0x0020)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_1;                    // 0x0220(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue;            // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_FloatFloat_ReturnValue;        // 0x0241(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_242[0x6];                                      // 0x0242(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord_2;                    // 0x0248(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_Key_IsKeyboardKey_ReturnValue_1;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord_3;                    // 0x0270(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x3];                                      // 0x0291(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0294(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_299[0x3];                                      // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x029C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_5;                    // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x02A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x02A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2AC[0x4];                                      // 0x02AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCustomMapping_Struct                  K2Node_MakeStruct_CustomMapping_Struct;            // 0x02B0(0x0068)(HasGetValueTypeHash)
	struct FCustomMapping_Struct                  K2Node_MakeStruct_CustomMapping_Struct_1;          // 0x0318(0x0068)(HasGetValueTypeHash)
	struct FCustomMapping_Struct                  K2Node_MakeStruct_CustomMapping_Struct_2;          // 0x0380(0x0068)(HasGetValueTypeHash)
	struct FCustomMapping_Struct                  K2Node_MakeStruct_CustomMapping_Struct_3;          // 0x03E8(0x0068)(HasGetValueTypeHash)
	struct FKey                                   K2Node_CustomEvent_InputKey;                       // 0x0450(0x0018)(HasGetValueTypeHash)
	class UCustomMapping_Slot_C*                  K2Node_CustomEvent_Slot;                           // 0x0468(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCustomMapping_Struct                  CallFunc_Array_Get_Item_3;                         // 0x0470(0x0068)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x04D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x04DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x04DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4DE[0x2];                                      // 0x04DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_1;           // 0x04E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x04E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4EC[0x4];                                      // 0x04EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInputActionKeyMapping>         CallFunc_GetActionMappingByName_OutMappings_1;     // 0x04F0(0x0010)(ReferenceParm)
	struct FInputActionKeyMapping                 CallFunc_Array_Get_Item_4;                         // 0x0500(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x0528(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x052C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x052D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x052E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_2;                                // 0x052F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UInputSettings*                         CallFunc_GetInputSettings_ReturnValue_2;           // 0x0530(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>           CallFunc_GetAxisMappingByName_OutMappings_1;       // 0x0538(0x0010)(ReferenceParm)
	struct FInputAxisKeyMapping                   CallFunc_Array_Get_Item_5;                         // 0x0548(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x0570(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0574(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue_1;          // 0x0575(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0576(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_577[0x1];                                      // 0x0577(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_6;                    // 0x0578(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x057C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D[0x3];                                      // 0x057D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0580(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_584[0x4];                                      // 0x0584(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetAllActorsWithInterface_OutActors;      // 0x0588(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x0598(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x05A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A4[0x4];                                      // 0x05A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IUISettingApply_Interface_C> K2Node_DynamicCast_AsUISetting_Apply_Interface; // 0x05A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x05B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5BB[0x5];                                      // 0x05BB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x05C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item_7;                         // 0x05D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x05E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E1[0x7];                                      // 0x05E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x05E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x05F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F9[0x3];                                      // 0x05F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Select_Default;                             // 0x05FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default_1;                           // 0x0600(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SettingUmg_C_ExecuteUbergraph_SettingUmg) == 0x000008, "Wrong alignment on SettingUmg_C_ExecuteUbergraph_SettingUmg");
static_assert(sizeof(SettingUmg_C_ExecuteUbergraph_SettingUmg) == 0x000608, "Wrong size on SettingUmg_C_ExecuteUbergraph_SettingUmg");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, EntryPoint) == 0x000000, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::EntryPoint' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable) == 0x000004, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable) == 0x000008, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_True_if_break_was_hit_Variable) == 0x000010, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_1) == 0x000014, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Not_PreBool_ReturnValue) == 0x000018, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_1) == 0x00001C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_2) == 0x000020, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_1) == 0x000024, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Create_ReturnValue) == 0x000028, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_True_if_break_was_hit_Variable_1) == 0x000030, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_2) == 0x000034, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_2) == 0x000038, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_True_if_break_was_hit_Variable_2) == 0x00003D, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_True_if_break_was_hit_Variable_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_3) == 0x000040, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Not_PreBool_ReturnValue_2) == 0x000044, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_4) == 0x000048, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_3) == 0x00004C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_3) == 0x000050, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_5) == 0x000054, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_Variable) == 0x000058, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_Variable' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Event_InputAction) == 0x000060, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Event_InputAction' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Event_InputAxis) == 0x000088, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Event_InputAxis' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetGameUserSettings_ReturnValue) == 0x0000B0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Clamp_ReturnValue) == 0x0000B8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Clamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Conv_IntToByte_ReturnValue) == 0x0000BC, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Conv_IntToByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Conv_IntToFloat_ReturnValue) == 0x0000C0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_Variable_1) == 0x0000C4, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Event___) == 0x0000C8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Event___' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Event____1) == 0x0000E0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Event____1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_4) == 0x0000F8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000FC, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Array_Index_Variable_6) == 0x000100, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_AddChild_ReturnValue) == 0x000108, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetInputSettings_ReturnValue) == 0x000110, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetInputSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item) == 0x000118, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue) == 0x000180, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetActionMappingByName_OutMappings) == 0x000188, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetActionMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetAxisMappingByName_OutMappings) == 0x000198, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetAxisMappingByName_OutMappings' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_1) == 0x0001A8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Key_IsMouseButton_ReturnValue) == 0x0001F8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Key_IsMouseButton_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_InputChord) == 0x000200, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_InputChord' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_InputChord_1) == 0x000220, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_InputChord_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Key_IsKeyboardKey_ReturnValue) == 0x000240, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Key_IsKeyboardKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_EqualEqual_FloatFloat_ReturnValue) == 0x000241, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_EqualEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_InputChord_2) == 0x000248, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_InputChord_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Key_IsKeyboardKey_ReturnValue_1) == 0x000268, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Key_IsKeyboardKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_InputChord_3) == 0x000270, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_InputChord_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_BooleanOR_ReturnValue) == 0x000290, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_1) == 0x000294, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue) == 0x000298, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_2) == 0x00029C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_5) == 0x0002A0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_1) == 0x0002A4, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_5) == 0x0002A8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_CustomMapping_Struct) == 0x0002B0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_CustomMapping_Struct' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_CustomMapping_Struct_1) == 0x000318, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_CustomMapping_Struct_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_CustomMapping_Struct_2) == 0x000380, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_CustomMapping_Struct_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_MakeStruct_CustomMapping_Struct_3) == 0x0003E8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_MakeStruct_CustomMapping_Struct_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_CustomEvent_InputKey) == 0x000450, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_CustomEvent_InputKey' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_CustomEvent_Slot) == 0x000468, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_CustomEvent_Slot' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_3) == 0x000470, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_3) == 0x0004D8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_2) == 0x0004DC, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_BooleanAND_ReturnValue) == 0x0004DD, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetInputSettings_ReturnValue_1) == 0x0004E0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetInputSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Variable) == 0x0004E8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Variable' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetActionMappingByName_OutMappings_1) == 0x0004F0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetActionMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_4) == 0x000500, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_4) == 0x000528, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x00052C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_3) == 0x00052D, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_BooleanAND_ReturnValue_1) == 0x00052E, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___bool_Variable_2) == 0x00052F, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___bool_Variable_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetInputSettings_ReturnValue_2) == 0x000530, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetInputSettings_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetAxisMappingByName_OutMappings_1) == 0x000538, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetAxisMappingByName_OutMappings_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_5) == 0x000548, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_5) == 0x000570, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_4) == 0x000574, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_EqualEqual_KeyKey_ReturnValue_1) == 0x000575, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_EqualEqual_KeyKey_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_BooleanAND_ReturnValue_2) == 0x000576, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, ___int_Loop_Counter_Variable_6) == 0x000578, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::___int_Loop_Counter_Variable_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_5) == 0x00057C, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Add_IntInt_ReturnValue_6) == 0x000580, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Add_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetAllActorsWithInterface_OutActors) == 0x000588, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetAllActorsWithInterface_OutActors' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_6) == 0x000598, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Length_ReturnValue_6) == 0x0005A0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Length_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_DynamicCast_AsUISetting_Apply_Interface) == 0x0005A8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_DynamicCast_AsUISetting_Apply_Interface' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_DynamicCast_bSuccess) == 0x0005B8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Less_IntInt_ReturnValue_6) == 0x0005B9, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Less_IntInt_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_IsValid_ReturnValue) == 0x0005BA, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_PlayAnimation_ReturnValue) == 0x0005C0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0005C8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_Array_Get_Item_7) == 0x0005D8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_Array_Get_Item_7' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_IsValid_ReturnValue_1) == 0x0005E0, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_GetCurrentLevelName_ReturnValue) == 0x0005E8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x0005F8, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Select_Default) == 0x0005FC, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_ExecuteUbergraph_SettingUmg, K2Node_Select_Default_1) == 0x000600, "Member 'SettingUmg_C_ExecuteUbergraph_SettingUmg::K2Node_Select_Default_1' has a wrong offset!");

// Function SettingUmg.SettingUmg_C.查重
// 0x0020 (0x0020 - 0x0000)
struct SettingUmg_C_查重 final
{
public:
	struct FKey                                   InputKey;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class UCustomMapping_Slot_C*                  Slot_0;                                            // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SettingUmg_C_查重) == 0x000008, "Wrong alignment on SettingUmg_C_查重");
static_assert(sizeof(SettingUmg_C_查重) == 0x000020, "Wrong size on SettingUmg_C_查重");
static_assert(offsetof(SettingUmg_C_查重, InputKey) == 0x000000, "Member 'SettingUmg_C_查重::InputKey' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_查重, Slot_0) == 0x000018, "Member 'SettingUmg_C_查重::Slot_0' has a wrong offset!");

// Function SettingUmg.SettingUmg_C.SettingDetails
// 0x0030 (0x0030 - 0x0000)
struct SettingUmg_C_SettingDetails final
{
public:
	class FText                                   标题; // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   详情; // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SettingUmg_C_SettingDetails) == 0x000008, "Wrong alignment on SettingUmg_C_SettingDetails");
static_assert(sizeof(SettingUmg_C_SettingDetails) == 0x000030, "Wrong size on SettingUmg_C_SettingDetails");
static_assert(offsetof(SettingUmg_C_SettingDetails, 标题) == 0x000000, "Member 'SettingUmg_C_SettingDetails::标题' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_SettingDetails, 详情) == 0x000018, "Member 'SettingUmg_C_SettingDetails::详情' has a wrong offset!");

// Function SettingUmg.SettingUmg_C.CustomMappingCheck
// 0x0050 (0x0050 - 0x0000)
struct SettingUmg_C_CustomMappingCheck final
{
public:
	struct FInputActionKeyMapping                 InputAction;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FInputAxisKeyMapping                   InputAxis;                                         // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(SettingUmg_C_CustomMappingCheck) == 0x000008, "Wrong alignment on SettingUmg_C_CustomMappingCheck");
static_assert(sizeof(SettingUmg_C_CustomMappingCheck) == 0x000050, "Wrong size on SettingUmg_C_CustomMappingCheck");
static_assert(offsetof(SettingUmg_C_CustomMappingCheck, InputAction) == 0x000000, "Member 'SettingUmg_C_CustomMappingCheck::InputAction' has a wrong offset!");
static_assert(offsetof(SettingUmg_C_CustomMappingCheck, InputAxis) == 0x000028, "Member 'SettingUmg_C_CustomMappingCheck::InputAxis' has a wrong offset!");

}

