#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingSliderSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SettingEnum_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass SettingSliderSlot.SettingSliderSlot_C
// 0x0078 (0x02D8 - 0x0260)
class USettingSliderSlot_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                                Border_51;                                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressBar_101;                                   // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_100;                                        // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_90;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_211;                                     // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   SettingMode;                                       // 0x0290(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsClick;                                           // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         滑块数值; // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESettingEnum                                  SettingEnum;                                       // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerStateSetting_C*                  PlayerSetting;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Setting描述; // 0x02C0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)

public:
	void ExecuteUbergraph_SettingSliderSlot(int32 EntryPoint);
	void BndEvt__SettingSliderSlot_Slider_100_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Reset();
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void CustomMappingCheck(const struct FInputActionKeyMapping& InputAction, const struct FInputAxisKeyMapping& InputAxis);
	void initializeSetting();
	void SettingDetails(const class FText& 标题, const class FText& 详情);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	float GetPercent_0();
	class FText GetText_0();
	void 进入选中模式();
	void MouseXSave();
	void MouseYSave();
	void 背景音量Save();
	void 音效音量Save();
	void 屏幕百分比Save();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SettingSliderSlot_C">();
	}
	static class USettingSliderSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingSliderSlot_C>();
	}
};
static_assert(alignof(USettingSliderSlot_C) == 0x000008, "Wrong alignment on USettingSliderSlot_C");
static_assert(sizeof(USettingSliderSlot_C) == 0x0002D8, "Wrong size on USettingSliderSlot_C");
static_assert(offsetof(USettingSliderSlot_C, UberGraphFrame) == 0x000260, "Member 'USettingSliderSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, Border_51) == 0x000268, "Member 'USettingSliderSlot_C::Border_51' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, ProgressBar_101) == 0x000270, "Member 'USettingSliderSlot_C::ProgressBar_101' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, Slider_100) == 0x000278, "Member 'USettingSliderSlot_C::Slider_100' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, TextBlock_90) == 0x000280, "Member 'USettingSliderSlot_C::TextBlock_90' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, TextBlock_211) == 0x000288, "Member 'USettingSliderSlot_C::TextBlock_211' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, SettingMode) == 0x000290, "Member 'USettingSliderSlot_C::SettingMode' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, IsClick) == 0x0002A8, "Member 'USettingSliderSlot_C::IsClick' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, 滑块数值) == 0x0002AC, "Member 'USettingSliderSlot_C::滑块数值' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, SettingEnum) == 0x0002B0, "Member 'USettingSliderSlot_C::SettingEnum' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, PlayerSetting) == 0x0002B8, "Member 'USettingSliderSlot_C::PlayerSetting' has a wrong offset!");
static_assert(offsetof(USettingSliderSlot_C, Setting描述) == 0x0002C0, "Member 'USettingSliderSlot_C::Setting描述' has a wrong offset!");

}

