#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SKM_Roller_door_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function SKM_Roller_door_Anim.SKM_Roller_door_Anim_C.ExecuteUbergraph_SKM_Roller_door_Anim
// 0x0010 (0x0010 - 0x0000)
struct SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue_1;       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim) == 0x000004, "Wrong alignment on SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim");
static_assert(sizeof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim) == 0x000010, "Wrong size on SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim");
static_assert(offsetof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim, EntryPoint) == 0x000000, "Member 'SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x000008, "Member 'SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim, CallFunc_LessEqual_FloatFloat_ReturnValue_1) == 0x00000D, "Member 'SKM_Roller_door_Anim_C_ExecuteUbergraph_SKM_Roller_door_Anim::CallFunc_LessEqual_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function SKM_Roller_door_Anim.SKM_Roller_door_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SKM_Roller_door_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SKM_Roller_door_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on SKM_Roller_door_Anim_C_AnimGraph");
static_assert(sizeof(SKM_Roller_door_Anim_C_AnimGraph) == 0x000010, "Wrong size on SKM_Roller_door_Anim_C_AnimGraph");
static_assert(offsetof(SKM_Roller_door_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SKM_Roller_door_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

