#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpringArm_Anim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SpringArm_Anim.SpringArm_Anim_C.ExecuteUbergraph_SpringArm_Anim
// 0x0078 (0x0078 - 0x0000)
struct SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCrouching_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim) == 0x000008, "Wrong alignment on SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim");
static_assert(sizeof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim) == 0x000078, "Wrong size on SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, EntryPoint) == 0x000000, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::EntryPoint' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000004, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000005, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_BooleanOR_ReturnValue) == 0x000006, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, K2Node_Event_DeltaTimeX) == 0x000008, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000010, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_GetMovementComponent_ReturnValue) == 0x000020, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_IsCrouching_ReturnValue) == 0x000028, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_IsCrouching_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_GetVelocity_ReturnValue) == 0x000038, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, K2Node_DynamicCast_AsPlayer_BP) == 0x000048, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_BreakVector_X) == 0x000054, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_BreakVector_Y) == 0x000058, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_BreakVector_Z) == 0x00005C, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_CalculateDirection_ReturnValue) == 0x00006C, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim, CallFunc_VSize_ReturnValue) == 0x000070, "Member 'SpringArm_Anim_C_ExecuteUbergraph_SpringArm_Anim::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function SpringArm_Anim.SpringArm_Anim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct SpringArm_Anim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SpringArm_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on SpringArm_Anim_C_BlueprintUpdateAnimation");
static_assert(sizeof(SpringArm_Anim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on SpringArm_Anim_C_BlueprintUpdateAnimation");
static_assert(offsetof(SpringArm_Anim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'SpringArm_Anim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function SpringArm_Anim.SpringArm_Anim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct SpringArm_Anim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(SpringArm_Anim_C_AnimGraph) == 0x000008, "Wrong alignment on SpringArm_Anim_C_AnimGraph");
static_assert(sizeof(SpringArm_Anim_C_AnimGraph) == 0x000010, "Wrong size on SpringArm_Anim_C_AnimGraph");
static_assert(offsetof(SpringArm_Anim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'SpringArm_Anim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

