#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: thanksList_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "SlateCore_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass thanksList_UMG.thanksList_UMG_C
// 0x0080 (0x02E0 - 0x0260)
class UthanksList_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       按钮动态_0; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       按钮动态; // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0278(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button;                                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_107;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                       EditableTextBox_76;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_58;                                      // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton_UMG4_C*                   SearchButton;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_735;                                     // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UReturnButton_UMG_C*                    返回按钮; // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Text;                                              // 0x02B8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           感谢名单; // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_thanksList_UMG(int32 EntryPoint);
	void BndEvt__thanksList_UMG_SearchButton_K2Node_ComponentBoundEvent_9_Click__DelegateSignature();
	void BndEvt__thanksList_UMG_返回按钮_K2Node_ComponentBoundEvent_8_Click__DelegateSignature();
	void 重置名单();
	void BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature(const class FText& Text_0, ETextCommit CommitMethod);
	void BndEvt__鸣谢_Button_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__鸣谢_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__鸣谢_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__鸣谢_Button_107_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__鸣谢_Button_107_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__鸣谢_Button_107_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"thanksList_UMG_C">();
	}
	static class UthanksList_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UthanksList_UMG_C>();
	}
};
static_assert(alignof(UthanksList_UMG_C) == 0x000008, "Wrong alignment on UthanksList_UMG_C");
static_assert(sizeof(UthanksList_UMG_C) == 0x0002E0, "Wrong size on UthanksList_UMG_C");
static_assert(offsetof(UthanksList_UMG_C, UberGraphFrame) == 0x000260, "Member 'UthanksList_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, 按钮动态_0) == 0x000268, "Member 'UthanksList_UMG_C::按钮动态_0' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, 按钮动态) == 0x000270, "Member 'UthanksList_UMG_C::按钮动态' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, Appear) == 0x000278, "Member 'UthanksList_UMG_C::Appear' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, Button) == 0x000280, "Member 'UthanksList_UMG_C::Button' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, Button_107) == 0x000288, "Member 'UthanksList_UMG_C::Button_107' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, EditableTextBox_76) == 0x000290, "Member 'UthanksList_UMG_C::EditableTextBox_76' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, ScrollBox_58) == 0x000298, "Member 'UthanksList_UMG_C::ScrollBox_58' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, SearchButton) == 0x0002A0, "Member 'UthanksList_UMG_C::SearchButton' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, TextBlock_735) == 0x0002A8, "Member 'UthanksList_UMG_C::TextBlock_735' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, 返回按钮) == 0x0002B0, "Member 'UthanksList_UMG_C::返回按钮' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, Text) == 0x0002B8, "Member 'UthanksList_UMG_C::Text' has a wrong offset!");
static_assert(offsetof(UthanksList_UMG_C, 感谢名单) == 0x0002D0, "Member 'UthanksList_UMG_C::感谢名单' has a wrong offset!");

}

