#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: thanksList_UMG

#include "Basic.hpp"

#include "Support_Struct_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function thanksList_UMG.thanksList_UMG_C.ExecuteUbergraph_thanksList_UMG
// 0x0348 (0x0348 - 0x0000)
struct thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameInstance*                          CallFunc_GetGameInstance_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UList_UMG_C*                            CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMyGameInstance_C*                      K2Node_DynamicCast_AsMy_Game_Instance;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UList_UMG_C*                            CallFunc_Create_ReturnValue_1;                     // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USaveGame*                              CallFunc_LoadGameFromSlot_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSaveGameExist_ReturnValue;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayerStateSetting_C*                  K2Node_DynamicCast_AsPlayer_State_Setting;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_1;                     // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_2;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_3;                     // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_2;                    // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable_4;                     // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0080(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSupport_Struct                        CallFunc_GetDataTableRowFromName_OutRow;           // 0x00A0(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_ComponentBoundEvent_Text;                   // 0x00E0(0x0018)(ConstParm)
	ETextCommit                                   K2Node_ComponentBoundEvent_CommitMethod;           // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Array_Get_Item_1;                         // 0x0118(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0138(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x0148(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0170(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAnyChildren_ReturnValue;               // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0195(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_196[0x2];                                      // 0x0196(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class A主界面音效_C*> CallFunc_GetAllActorsOfClass_OutActors;            // 0x0198(0x0010)(ReferenceParm)
	class A主界面音效_C* CallFunc_Array_Get_Item_2;                         // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable_3;                    // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6[0x2];                                      // 0x01B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMainMenu_UMG_C*>                CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x01C0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UMainMenu_UMG_C*                        CallFunc_Array_Get_Item_3;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_1;       // 0x01D8(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item_4;                         // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSupport_Struct                        CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01F8(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x0210(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0211(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_212[0x2];                                      // 0x0212(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable_4;                    // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0218(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x021C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21D[0x3];                                      // 0x021D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x0220(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_224[0x4];                                      // 0x0224(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ___text_Variable;                                  // 0x0228(0x0018)(ConstParm)
	class FText                                   CallFunc_Array_Get_Item_5;                         // 0x0240(0x0018)()
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_3;          // 0x0258(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26D[0x3];                                      // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UList_UMG_C*                            CallFunc_Create_ReturnValue_2;                     // 0x0270(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_4;          // 0x0278(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_1;                   // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0290(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x02A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x02B0(0x0018)()
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue_2;                   // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDefaultLanguage_ReturnValue;           // 0x02E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x02F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames_2;       // 0x02F8(0x0010)(ReferenceParm)
	struct FLinearColor                           ___struct_Variable;                                // 0x0308(0x0010)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_6;                         // 0x0318(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSupport_Struct                        CallFunc_GetDataTableRowFromName_OutRow_2;         // 0x0320(0x0018)(HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_2;    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x3];                                      // 0x0341(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0344(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG) == 0x000008, "Wrong alignment on thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG");
static_assert(sizeof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG) == 0x000348, "Wrong size on thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, EntryPoint) == 0x000000, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetGameInstance_ReturnValue) == 0x000008, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetGameInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Create_ReturnValue) == 0x000010, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_DynamicCast_AsMy_Game_Instance) == 0x000018, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_DynamicCast_AsMy_Game_Instance' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Create_ReturnValue_1) == 0x000028, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Create_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_LoadGameFromSlot_ReturnValue) == 0x000030, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_LoadGameFromSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_DoesSaveGameExist_ReturnValue) == 0x000038, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_DoesSaveGameExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_DynamicCast_AsPlayer_State_Setting) == 0x000040, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_DynamicCast_AsPlayer_State_Setting' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Loop_Counter_Variable) == 0x00004C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_SwitchInteger_CmpSuccess) == 0x000050, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Array_Index_Variable) == 0x000058, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Array_Index_Variable_1) == 0x00005C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Loop_Counter_Variable_1) == 0x000060, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Add_IntInt_ReturnValue_1) == 0x000064, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Array_Index_Variable_2) == 0x000068, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Array_Index_Variable_3) == 0x00006C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Loop_Counter_Variable_2) == 0x000070, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Add_IntInt_ReturnValue_2) == 0x000074, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Array_Index_Variable_4) == 0x000078, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowNames_OutRowNames) == 0x000080, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowNames_OutRowNames' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item) == 0x000090, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_OutRow) == 0x0000A0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000B8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x0000C0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x0000C8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_PlayAnimation_ReturnValue_2) == 0x0000D0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_PlayAnimation_ReturnValue_3) == 0x0000D8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_ComponentBoundEvent_Text) == 0x0000E0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_ComponentBoundEvent_Text' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, K2Node_ComponentBoundEvent_CommitMethod) == 0x0000F8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::K2Node_ComponentBoundEvent_CommitMethod' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_TextToString_ReturnValue) == 0x000100, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Add_ReturnValue) == 0x000110, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_1) == 0x000118, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000138, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_TextToString_ReturnValue_2) == 0x000148, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Concat_StrStr_ReturnValue) == 0x000158, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Contains_ReturnValue) == 0x000168, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_StringToText_ReturnValue) == 0x000170, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_AddChild_ReturnValue) == 0x000188, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_AddChild_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetChildrenCount_ReturnValue) == 0x000190, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_HasAnyChildren_ReturnValue) == 0x000194, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_HasAnyChildren_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000195, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetAllActorsOfClass_OutActors) == 0x000198, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_2) == 0x0001A8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Loop_Counter_Variable_3) == 0x0001B0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_IsValid_ReturnValue) == 0x0001B4, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Less_IntInt_ReturnValue) == 0x0001B5, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Add_IntInt_ReturnValue_3) == 0x0001B8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x0001C0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_3) == 0x0001D0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowNames_OutRowNames_1) == 0x0001D8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowNames_OutRowNames_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_4) == 0x0001E8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Length_ReturnValue_2) == 0x0001F0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001F8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x000210, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Less_IntInt_ReturnValue_1) == 0x000211, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___int_Loop_Counter_Variable_4) == 0x000214, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Add_ReturnValue_1) == 0x000218, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Less_IntInt_ReturnValue_2) == 0x00021C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Add_IntInt_ReturnValue_4) == 0x000220, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___text_Variable) == 0x000228, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___text_Variable' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_5) == 0x000240, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_5' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_TextToString_ReturnValue_3) == 0x000258, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_TextToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Length_ReturnValue_3) == 0x000268, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Less_IntInt_ReturnValue_3) == 0x00026C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Create_ReturnValue_2) == 0x000270, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Create_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_TextToString_ReturnValue_4) == 0x000278, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_TextToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_AddChild_ReturnValue_1) == 0x000288, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_AddChild_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000290, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0002A0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Conv_StringToText_ReturnValue_1) == 0x0002B0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_AddChild_ReturnValue_2) == 0x0002C8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_AddChild_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_TextIsEmpty_ReturnValue) == 0x0002D0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_PlayAnimation_ReturnValue_4) == 0x0002D8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDefaultLanguage_ReturnValue) == 0x0002E0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDefaultLanguage_ReturnValue' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Contains_ReturnValue_1) == 0x0002F0, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowNames_OutRowNames_2) == 0x0002F8, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowNames_OutRowNames_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, ___struct_Variable) == 0x000308, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::___struct_Variable' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Get_Item_6) == 0x000318, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Get_Item_6' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_OutRow_2) == 0x000320, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_OutRow_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_GetDataTableRowFromName_ReturnValue_2) == 0x000338, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_GetDataTableRowFromName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Length_ReturnValue_4) == 0x00033C, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Less_IntInt_ReturnValue_4) == 0x000340, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG, CallFunc_Array_Add_ReturnValue_2) == 0x000344, "Member 'thanksList_UMG_C_ExecuteUbergraph_thanksList_UMG::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function thanksList_UMG.thanksList_UMG_C.BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct thanksList_UMG_C_BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature final
{
public:
	class FText                                   Text_0;                                            // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	ETextCommit                                   CommitMethod;                                      // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(thanksList_UMG_C_BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000008, "Wrong alignment on thanksList_UMG_C_BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature");
static_assert(sizeof(thanksList_UMG_C_BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature) == 0x000020, "Wrong size on thanksList_UMG_C_BndEvt__鸣谢_EditableTextBox_76_K2Node_ComponentBoundEvent_7_OnEditableTextBoxCommittedEvent__DelegateSignature");
