#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_CharacterMesh

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct UDS_CharacterMesh.UDS_CharacterMesh
// 0x00A0 (0x00A0 - 0x0000)
struct FUDS_CharacterMesh final
{
public:
	TArray<class USkeletalMesh*>                  ManState_66_E0041CB344E69B9E115AEB835BD1006B;      // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  FemaleState_67_2D436FE34F72CFF47A1380B93394E49A;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  BunnyGirlState_68_AEDAED5D44AC126BD3014B9B58826984; // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  MaidState_69_65B2AF7942598FCB2C16A88897DCD3D5;     // 0x0030(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  NewYearGirl_70_459E78314B3658D01B171883722D207C;   // 0x0040(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  Amaya_71_0FB1534E475403D688360B8E4190924E;         // 0x0050(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  SchoolGirl_72_9CDC706A47410B70609BB2B54F1E54A9;    // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  LadyBiker_76_AE4D78DB4A4E6E49F65E64ADAA1CFD8B;     // 0x0070(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  Soldier_80_05AA81FF4E0DDC1024FC689AFB995B9A;       // 0x0080(0x0010)(Edit, BlueprintVisible)
	TArray<class USkeletalMesh*>                  JuaLee_84_E770E0AA4D9A5DC41F306F920FE55DE9;        // 0x0090(0x0010)(Edit, BlueprintVisible)
};
static_assert(alignof(FUDS_CharacterMesh) == 0x000008, "Wrong alignment on FUDS_CharacterMesh");
static_assert(sizeof(FUDS_CharacterMesh) == 0x0000A0, "Wrong size on FUDS_CharacterMesh");
static_assert(offsetof(FUDS_CharacterMesh, ManState_66_E0041CB344E69B9E115AEB835BD1006B) == 0x000000, "Member 'FUDS_CharacterMesh::ManState_66_E0041CB344E69B9E115AEB835BD1006B' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, FemaleState_67_2D436FE34F72CFF47A1380B93394E49A) == 0x000010, "Member 'FUDS_CharacterMesh::FemaleState_67_2D436FE34F72CFF47A1380B93394E49A' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, BunnyGirlState_68_AEDAED5D44AC126BD3014B9B58826984) == 0x000020, "Member 'FUDS_CharacterMesh::BunnyGirlState_68_AEDAED5D44AC126BD3014B9B58826984' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, MaidState_69_65B2AF7942598FCB2C16A88897DCD3D5) == 0x000030, "Member 'FUDS_CharacterMesh::MaidState_69_65B2AF7942598FCB2C16A88897DCD3D5' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, NewYearGirl_70_459E78314B3658D01B171883722D207C) == 0x000040, "Member 'FUDS_CharacterMesh::NewYearGirl_70_459E78314B3658D01B171883722D207C' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, Amaya_71_0FB1534E475403D688360B8E4190924E) == 0x000050, "Member 'FUDS_CharacterMesh::Amaya_71_0FB1534E475403D688360B8E4190924E' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, SchoolGirl_72_9CDC706A47410B70609BB2B54F1E54A9) == 0x000060, "Member 'FUDS_CharacterMesh::SchoolGirl_72_9CDC706A47410B70609BB2B54F1E54A9' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, LadyBiker_76_AE4D78DB4A4E6E49F65E64ADAA1CFD8B) == 0x000070, "Member 'FUDS_CharacterMesh::LadyBiker_76_AE4D78DB4A4E6E49F65E64ADAA1CFD8B' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, Soldier_80_05AA81FF4E0DDC1024FC689AFB995B9A) == 0x000080, "Member 'FUDS_CharacterMesh::Soldier_80_05AA81FF4E0DDC1024FC689AFB995B9A' has a wrong offset!");
static_assert(offsetof(FUDS_CharacterMesh, JuaLee_84_E770E0AA4D9A5DC41F306F920FE55DE9) == 0x000090, "Member 'FUDS_CharacterMesh::JuaLee_84_E770E0AA4D9A5DC41F306F920FE55DE9' has a wrong offset!");

}

