#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UISettingInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UISettingInterface.UISettingInterface_C.SettingDetails
// 0x0030 (0x0030 - 0x0000)
struct UISettingInterface_C_SettingDetails final
{
public:
	class FText                                   标题; // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   详情; // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UISettingInterface_C_SettingDetails) == 0x000008, "Wrong alignment on UISettingInterface_C_SettingDetails");
static_assert(sizeof(UISettingInterface_C_SettingDetails) == 0x000030, "Wrong size on UISettingInterface_C_SettingDetails");
static_assert(offsetof(UISettingInterface_C_SettingDetails, 标题) == 0x000000, "Member 'UISettingInterface_C_SettingDetails::标题' has a wrong offset!");
static_assert(offsetof(UISettingInterface_C_SettingDetails, 详情) == 0x000018, "Member 'UISettingInterface_C_SettingDetails::详情' has a wrong offset!");

// Function UISettingInterface.UISettingInterface_C.CustomMappingCheck
// 0x0050 (0x0050 - 0x0000)
struct UISettingInterface_C_CustomMappingCheck final
{
public:
	struct FInputActionKeyMapping                 InputAction;                                       // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FInputAxisKeyMapping                   InputAxis;                                         // 0x0028(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(UISettingInterface_C_CustomMappingCheck) == 0x000008, "Wrong alignment on UISettingInterface_C_CustomMappingCheck");
static_assert(sizeof(UISettingInterface_C_CustomMappingCheck) == 0x000050, "Wrong size on UISettingInterface_C_CustomMappingCheck");
static_assert(offsetof(UISettingInterface_C_CustomMappingCheck, InputAction) == 0x000000, "Member 'UISettingInterface_C_CustomMappingCheck::InputAction' has a wrong offset!");
static_assert(offsetof(UISettingInterface_C_CustomMappingCheck, InputAxis) == 0x000028, "Member 'UISettingInterface_C_CustomMappingCheck::InputAxis' has a wrong offset!");

}

