#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UseMeshes

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UseMeshes.UseMeshes_C
// 0x0028 (0x0248 - 0x0220)
class AUseMeshes_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   DroppedMesh;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Prop;                                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           As_Player_BP;                                      // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UseMeshes(int32 EntryPoint);
	void ReceiveBeginPlay();
	void DestroyActor(float AnimationLenght, bool SimulatePhysics);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UseMeshes_C">();
	}
	static class AUseMeshes_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUseMeshes_C>();
	}
};
static_assert(alignof(AUseMeshes_C) == 0x000008, "Wrong alignment on AUseMeshes_C");
static_assert(sizeof(AUseMeshes_C) == 0x000248, "Wrong size on AUseMeshes_C");
static_assert(offsetof(AUseMeshes_C, UberGraphFrame) == 0x000220, "Member 'AUseMeshes_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUseMeshes_C, DroppedMesh) == 0x000228, "Member 'AUseMeshes_C::DroppedMesh' has a wrong offset!");
static_assert(offsetof(AUseMeshes_C, Prop) == 0x000230, "Member 'AUseMeshes_C::Prop' has a wrong offset!");
static_assert(offsetof(AUseMeshes_C, DefaultSceneRoot) == 0x000238, "Member 'AUseMeshes_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AUseMeshes_C, As_Player_BP) == 0x000240, "Member 'AUseMeshes_C::As_Player_BP' has a wrong offset!");

}

