#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VagranPistol_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VagranPistol_BP.VagranPistol_BP_C
// 0x0028 (0x0248 - 0x0220)
class AVagranPistol_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Muzzle;                                            // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Bullet_Eject;                                      // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VagranPistol_BP(int32 EntryPoint);
	void 开始射击();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VagranPistol_BP_C">();
	}
	static class AVagranPistol_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVagranPistol_BP_C>();
	}
};
static_assert(alignof(AVagranPistol_BP_C) == 0x000008, "Wrong alignment on AVagranPistol_BP_C");
static_assert(sizeof(AVagranPistol_BP_C) == 0x000248, "Wrong size on AVagranPistol_BP_C");
static_assert(offsetof(AVagranPistol_BP_C, UberGraphFrame) == 0x000220, "Member 'AVagranPistol_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AVagranPistol_BP_C, Muzzle) == 0x000228, "Member 'AVagranPistol_BP_C::Muzzle' has a wrong offset!");
static_assert(offsetof(AVagranPistol_BP_C, Bullet_Eject) == 0x000230, "Member 'AVagranPistol_BP_C::Bullet_Eject' has a wrong offset!");
static_assert(offsetof(AVagranPistol_BP_C, SkeletalMesh) == 0x000238, "Member 'AVagranPistol_BP_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AVagranPistol_BP_C, DefaultSceneRoot) == 0x000240, "Member 'AVagranPistol_BP_C::DefaultSceneRoot' has a wrong offset!");

}

