#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VagranPistol_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function VagranPistol_BP.VagranPistol_BP_C.ExecuteUbergraph_VagranPistol_BP
// 0x0180 (0x0180 - 0x0000)
struct VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0060(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AVagrantBullet_BP_C*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C8[0x8];                                       // 0x00C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x00D0(0x0030)(IsPlainOldData, NoDestructor)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AP320Case_BP_C*                         CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x0120(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x0150(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x015C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x0168(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP) == 0x000010, "Wrong alignment on VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP");
static_assert(sizeof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP) == 0x000180, "Wrong size on VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, EntryPoint) == 0x000000, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000010, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_GetSocketLocation_ReturnValue) == 0x00001C, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000060, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000090, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Location) == 0x000098, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Rotation) == 0x0000A4, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Scale) == 0x0000B0, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_MakeTransform_ReturnValue_1) == 0x0000D0, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000100, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000108, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000110, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x000120, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Location_1) == 0x000150, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Rotation_1) == 0x00015C, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_BreakTransform_Scale_1) == 0x000168, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000178, "Member 'VagranPistol_BP_C_ExecuteUbergraph_VagranPistol_BP::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");

}

