#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VagrantSeq_BP

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass VagrantSeq_BP.VagrantSeq_BP_C
// 0x0028 (0x02A8 - 0x0280)
class AVagrantSeq_BP_C final : public APawn
{
public:
	class UStaticMeshComponent*                   SM_MasterKey;                                      // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Googles_mesh;                                      // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Chinstrap_mesh;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 MedicalWorkerFem01_mesh;                           // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VagrantSeq_BP_C">();
	}
	static class AVagrantSeq_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AVagrantSeq_BP_C>();
	}
};
static_assert(alignof(AVagrantSeq_BP_C) == 0x000008, "Wrong alignment on AVagrantSeq_BP_C");
static_assert(sizeof(AVagrantSeq_BP_C) == 0x0002A8, "Wrong size on AVagrantSeq_BP_C");
static_assert(offsetof(AVagrantSeq_BP_C, SM_MasterKey) == 0x000280, "Member 'AVagrantSeq_BP_C::SM_MasterKey' has a wrong offset!");
static_assert(offsetof(AVagrantSeq_BP_C, Googles_mesh) == 0x000288, "Member 'AVagrantSeq_BP_C::Googles_mesh' has a wrong offset!");
static_assert(offsetof(AVagrantSeq_BP_C, Chinstrap_mesh) == 0x000290, "Member 'AVagrantSeq_BP_C::Chinstrap_mesh' has a wrong offset!");
static_assert(offsetof(AVagrantSeq_BP_C, MedicalWorkerFem01_mesh) == 0x000298, "Member 'AVagrantSeq_BP_C::MedicalWorkerFem01_mesh' has a wrong offset!");
static_assert(offsetof(AVagrantSeq_BP_C, DefaultSceneRoot) == 0x0002A0, "Member 'AVagrantSeq_BP_C::DefaultSceneRoot' has a wrong offset!");

}

