#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Vagrant_CBP

#include "Basic.hpp"


namespace SDK::Params
{

// Function Vagrant_CBP.Vagrant_CBP_C.ExecuteUbergraph_Vagrant_CBP
// 0x0010 (0x0010 - 0x0000)
struct Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP) == 0x000008, "Wrong alignment on Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP");
static_assert(sizeof(Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP) == 0x000010, "Wrong size on Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP");
static_assert(offsetof(Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP, EntryPoint) == 0x000000, "Member 'Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP, CallFunc_RunBehaviorTree_ReturnValue) == 0x000004, "Member 'Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP, K2Node_Event_PossessedPawn) == 0x000008, "Member 'Vagrant_CBP_C_ExecuteUbergraph_Vagrant_CBP::K2Node_Event_PossessedPawn' has a wrong offset!");

// Function Vagrant_CBP.Vagrant_CBP_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct Vagrant_CBP_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Vagrant_CBP_C_ReceivePossess) == 0x000008, "Wrong alignment on Vagrant_CBP_C_ReceivePossess");
static_assert(sizeof(Vagrant_CBP_C_ReceivePossess) == 0x000008, "Wrong size on Vagrant_CBP_C_ReceivePossess");
static_assert(offsetof(Vagrant_CBP_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'Vagrant_CBP_C_ReceivePossess::PossessedPawn' has a wrong offset!");

}

