#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VHS_Noise_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass VHS_Noise_UMG.VHS_Noise_UMG_C
// 0x0020 (0x0280 - 0x0260)
class UVHS_Noise_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_63;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_VHS_Noise_UMG(int32 EntryPoint);
	void Construct();
	void OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"VHS_Noise_UMG_C">();
	}
	static class UVHS_Noise_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UVHS_Noise_UMG_C>();
	}
};
static_assert(alignof(UVHS_Noise_UMG_C) == 0x000008, "Wrong alignment on UVHS_Noise_UMG_C");
static_assert(sizeof(UVHS_Noise_UMG_C) == 0x000280, "Wrong size on UVHS_Noise_UMG_C");
static_assert(offsetof(UVHS_Noise_UMG_C, UberGraphFrame) == 0x000260, "Member 'UVHS_Noise_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UVHS_Noise_UMG_C, NewAnimation) == 0x000268, "Member 'UVHS_Noise_UMG_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UVHS_Noise_UMG_C, Image_63) == 0x000270, "Member 'UVHS_Noise_UMG_C::Image_63' has a wrong offset!");
static_assert(offsetof(UVHS_Noise_UMG_C, MediaPlayer) == 0x000278, "Member 'UVHS_Noise_UMG_C::MediaPlayer' has a wrong offset!");

}

