#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VHS_Noise_UMG

#include "Basic.hpp"


namespace SDK::Params
{

// Function VHS_Noise_UMG.VHS_Noise_UMG_C.ExecuteUbergraph_VHS_Noise_UMG
// 0x0040 (0x0040 - 0x0000)
struct VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                ___object_Variable;                                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG) == 0x000008, "Wrong alignment on VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG");
static_assert(sizeof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG) == 0x000040, "Wrong size on VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, EntryPoint) == 0x000000, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::EntryPoint' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, K2Node_CustomEvent_Loaded) == 0x000008, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, ___object_Variable) == 0x000020, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::___object_Variable' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, CallFunc_OpenSource_ReturnValue) == 0x000028, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::CallFunc_OpenSource_ReturnValue' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'VHS_Noise_UMG_C_ExecuteUbergraph_VHS_Noise_UMG::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function VHS_Noise_UMG.VHS_Noise_UMG_C.OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9
// 0x0008 (0x0008 - 0x0000)
struct VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9) == 0x000008, "Wrong alignment on VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9");
static_assert(sizeof(VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9) == 0x000008, "Wrong size on VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9");
static_assert(offsetof(VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9, Loaded) == 0x000000, "Member 'VHS_Noise_UMG_C_OnLoaded_4F1AF7504CA53C54B5D286BF8D97B7E9::Loaded' has a wrong offset!");

}

