#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Backpack_Weapon

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "WeaponType_structs.hpp"


namespace SDK::Params
{

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.ExecuteUbergraph_WB_Backpack_Weapon
// 0x0220 (0x0220 - 0x0000)
struct WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   ___byte_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ___object_Variable;                                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ___object_Variable_1;                              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ___object_Variable_2;                              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ___object_Variable_3;                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ___object_Variable_4;                              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_PointerEvent_2;                       // 0x0038(0x0070)(ConstParm)
	class UDragDropOperation*                     K2Node_Event_Operation_2;                          // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeapon_Master_C*                       K2Node_CustomEvent_weapon;                         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00C8(0x0038)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_PointerEvent_1;                       // 0x0100(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation_1;                          // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_PointerEvent;                         // 0x0178(0x0070)()
	class UDragDropOperation*                     K2Node_Event_Operation;                            // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Backpack_Weapon_C*                  K2Node_DynamicCast_AsWB_Backpack_Weapon;           // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Backpack_Weapon_C*                  K2Node_DynamicCast_AsWB_Backpack_Weapon_1;         // 0x0200(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon");
static_assert(sizeof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon) == 0x000220, "Wrong size on WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, EntryPoint) == 0x000000, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___byte_Variable) == 0x000004, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___object_Variable) == 0x000008, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___object_Variable' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___object_Variable_1) == 0x000010, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___object_Variable_2) == 0x000018, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___object_Variable_2' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___object_Variable_3) == 0x000020, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___object_Variable_3' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, ___object_Variable_4) == 0x000028, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::___object_Variable_4' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_IsDesignTime) == 0x000030, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_PointerEvent_2) == 0x000038, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_PointerEvent_2' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_Operation_2) == 0x0000A8, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_Operation_2' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, CallFunc_IsValid_ReturnValue) == 0x0000B0, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_CustomEvent_weapon) == 0x0000B8, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_CustomEvent_weapon' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Select_Default) == 0x0000C0, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_MyGeometry) == 0x0000C8, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_PointerEvent_1) == 0x000100, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_PointerEvent_1' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_Operation_1) == 0x000170, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_Operation_1' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_PointerEvent) == 0x000178, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_Event_Operation) == 0x0001E8, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_Event_Operation' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_DynamicCast_AsWB_Backpack_Weapon) == 0x0001F0, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_DynamicCast_AsWB_Backpack_Weapon' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_DynamicCast_bSuccess) == 0x0001F8, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_DynamicCast_AsWB_Backpack_Weapon_1) == 0x000200, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_DynamicCast_AsWB_Backpack_Weapon_1' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, K2Node_DynamicCast_bSuccess_1) == 0x000208, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, CallFunc_PlayAnimation_ReturnValue) == 0x000210, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon, CallFunc_PlayAnimation_ReturnValue_1) == 0x000218, "Member 'WB_Backpack_Weapon_C_ExecuteUbergraph_WB_Backpack_Weapon::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnDragLeave
// 0x0078 (0x0078 - 0x0000)
struct WB_Backpack_Weapon_C_OnDragLeave final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Backpack_Weapon_C_OnDragLeave) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnDragLeave");
static_assert(sizeof(WB_Backpack_Weapon_C_OnDragLeave) == 0x000078, "Wrong size on WB_Backpack_Weapon_C_OnDragLeave");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragLeave, PointerEvent) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnDragLeave::PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragLeave, Operation) == 0x000070, "Member 'WB_Backpack_Weapon_C_OnDragLeave::Operation' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnDragEnter
// 0x00B0 (0x00B0 - 0x0000)
struct WB_Backpack_Weapon_C_OnDragEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Backpack_Weapon_C_OnDragEnter) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnDragEnter");
static_assert(sizeof(WB_Backpack_Weapon_C_OnDragEnter) == 0x0000B0, "Wrong size on WB_Backpack_Weapon_C_OnDragEnter");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragEnter, MyGeometry) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnDragEnter::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragEnter, PointerEvent) == 0x000038, "Member 'WB_Backpack_Weapon_C_OnDragEnter::PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragEnter, Operation) == 0x0000A8, "Member 'WB_Backpack_Weapon_C_OnDragEnter::Operation' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.刷新武器数据
// 0x0008 (0x0008 - 0x0000)
struct WB_Backpack_Weapon_C_刷新武器数据 final
{
public:
	class AWeapon_Master_C*                       weapon_0;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Backpack_Weapon_C_刷新武器数据) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_刷新武器数据");
static_assert(sizeof(WB_Backpack_Weapon_C_刷新武器数据) == 0x000008, "Wrong size on WB_Backpack_Weapon_C_刷新武器数据");
static_assert(offsetof(WB_Backpack_Weapon_C_刷新武器数据, weapon_0) == 0x000000, "Member 'WB_Backpack_Weapon_C_刷新武器数据::weapon_0' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnDragCancelled
// 0x0078 (0x0078 - 0x0000)
struct WB_Backpack_Weapon_C_OnDragCancelled final
{
public:
	struct FPointerEvent                          PointerEvent;                                      // 0x0000(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x0070(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Backpack_Weapon_C_OnDragCancelled) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnDragCancelled");
static_assert(sizeof(WB_Backpack_Weapon_C_OnDragCancelled) == 0x000078, "Wrong size on WB_Backpack_Weapon_C_OnDragCancelled");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragCancelled, PointerEvent) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnDragCancelled::PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragCancelled, Operation) == 0x000070, "Member 'WB_Backpack_Weapon_C_OnDragCancelled::Operation' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Backpack_Weapon_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Backpack_Weapon_C_PreConstruct) == 0x000001, "Wrong alignment on WB_Backpack_Weapon_C_PreConstruct");
static_assert(sizeof(WB_Backpack_Weapon_C_PreConstruct) == 0x000001, "Wrong size on WB_Backpack_Weapon_C_PreConstruct");
static_assert(offsetof(WB_Backpack_Weapon_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WB_Backpack_Weapon_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnDragDetected
// 0x00C0 (0x00C0 - 0x0000)
struct WB_Backpack_Weapon_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDragDropOperation*                     CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Backpack_Weapon_C_OnDragDetected) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnDragDetected");
static_assert(sizeof(WB_Backpack_Weapon_C_OnDragDetected) == 0x0000C0, "Wrong size on WB_Backpack_Weapon_C_OnDragDetected");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'WB_Backpack_Weapon_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragDetected, Operation) == 0x0000A8, "Member 'WB_Backpack_Weapon_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'WB_Backpack_Weapon_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WB_Backpack_Weapon_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnMouseButtonDown
// 0x0218 (0x0218 - 0x0000)
struct WB_Backpack_Weapon_C_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            CallFunc_DetectDragIfPressed_ReturnValue;          // 0x0160(0x00B8)()
};
static_assert(alignof(WB_Backpack_Weapon_C_OnMouseButtonDown) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnMouseButtonDown");
static_assert(sizeof(WB_Backpack_Weapon_C_OnMouseButtonDown) == 0x000218, "Wrong size on WB_Backpack_Weapon_C_OnMouseButtonDown");
static_assert(offsetof(WB_Backpack_Weapon_C_OnMouseButtonDown, MyGeometry) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnMouseButtonDown::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnMouseButtonDown, MouseEvent) == 0x000038, "Member 'WB_Backpack_Weapon_C_OnMouseButtonDown::MouseEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnMouseButtonDown, ReturnValue) == 0x0000A8, "Member 'WB_Backpack_Weapon_C_OnMouseButtonDown::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnMouseButtonDown, CallFunc_DetectDragIfPressed_ReturnValue) == 0x000160, "Member 'WB_Backpack_Weapon_C_OnMouseButtonDown::CallFunc_DetectDragIfPressed_ReturnValue' has a wrong offset!");

// Function WB_Backpack_Weapon.WB_Backpack_Weapon_C.OnDrop
// 0x00D8 (0x00D8 - 0x0000)
struct WB_Backpack_Weapon_C_OnDrop final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x00B0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Backpack_Weapon_C*                  K2Node_DynamicCast_AsWB_Backpack_Weapon;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Backpack_Weapon_C_OnDrop) == 0x000008, "Wrong alignment on WB_Backpack_Weapon_C_OnDrop");
static_assert(sizeof(WB_Backpack_Weapon_C_OnDrop) == 0x0000D8, "Wrong size on WB_Backpack_Weapon_C_OnDrop");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, MyGeometry) == 0x000000, "Member 'WB_Backpack_Weapon_C_OnDrop::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, PointerEvent) == 0x000038, "Member 'WB_Backpack_Weapon_C_OnDrop::PointerEvent' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, Operation) == 0x0000A8, "Member 'WB_Backpack_Weapon_C_OnDrop::Operation' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, ReturnValue) == 0x0000B0, "Member 'WB_Backpack_Weapon_C_OnDrop::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, K2Node_DynamicCast_AsWB_Backpack_Weapon) == 0x0000B8, "Member 'WB_Backpack_Weapon_C_OnDrop::K2Node_DynamicCast_AsWB_Backpack_Weapon' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'WB_Backpack_Weapon_C_OnDrop::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, CallFunc_PlayAnimation_ReturnValue) == 0x0000C8, "Member 'WB_Backpack_Weapon_C_OnDrop::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Backpack_Weapon_C_OnDrop, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'WB_Backpack_Weapon_C_OnDrop::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

