#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DebugAIOptimizer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "AIOptimizer_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DebugAIOptimizer.WB_DebugAIOptimizer_C
// 0x0060 (0x02C0 - 0x0260)
class UWB_DebugAIOptimizer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Text_Despawned_1;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_NotUpdated_1;                                 // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PendingDespawn_1;                             // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_PendingSpawn_1;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Spawned_1;                                    // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SpawnedClose_1;                               // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SpawnedFar_1;                                 // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_SpawnedMedium_1;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          DrawDistanceTexts;                                 // 0x02A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          DrawDebugLines;                                    // 0x02A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle_DrawDebug;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         UpdateInterval;                                    // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDespawnedSubjects;                             // 0x02BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          SubsystemEnabled;                                  // 0x02BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_DebugAIOptimizer(int32 EntryPoint);
	void OnSubsystemEnabledChanged_Event_0(bool bIsEnabled_0);
	void Destruct();
	void Construct();
	void DrawDebug();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_DebugAIOptimizer_C">();
	}
	static class UWB_DebugAIOptimizer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DebugAIOptimizer_C>();
	}
};
static_assert(alignof(UWB_DebugAIOptimizer_C) == 0x000008, "Wrong alignment on UWB_DebugAIOptimizer_C");
static_assert(sizeof(UWB_DebugAIOptimizer_C) == 0x0002C0, "Wrong size on UWB_DebugAIOptimizer_C");
static_assert(offsetof(UWB_DebugAIOptimizer_C, UberGraphFrame) == 0x000260, "Member 'UWB_DebugAIOptimizer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_Despawned_1) == 0x000268, "Member 'UWB_DebugAIOptimizer_C::Text_Despawned_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_NotUpdated_1) == 0x000270, "Member 'UWB_DebugAIOptimizer_C::Text_NotUpdated_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_PendingDespawn_1) == 0x000278, "Member 'UWB_DebugAIOptimizer_C::Text_PendingDespawn_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_PendingSpawn_1) == 0x000280, "Member 'UWB_DebugAIOptimizer_C::Text_PendingSpawn_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_Spawned_1) == 0x000288, "Member 'UWB_DebugAIOptimizer_C::Text_Spawned_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_SpawnedClose_1) == 0x000290, "Member 'UWB_DebugAIOptimizer_C::Text_SpawnedClose_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_SpawnedFar_1) == 0x000298, "Member 'UWB_DebugAIOptimizer_C::Text_SpawnedFar_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, Text_SpawnedMedium_1) == 0x0002A0, "Member 'UWB_DebugAIOptimizer_C::Text_SpawnedMedium_1' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, DrawDistanceTexts) == 0x0002A8, "Member 'UWB_DebugAIOptimizer_C::DrawDistanceTexts' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, DrawDebugLines) == 0x0002A9, "Member 'UWB_DebugAIOptimizer_C::DrawDebugLines' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, TimerHandle_DrawDebug) == 0x0002B0, "Member 'UWB_DebugAIOptimizer_C::TimerHandle_DrawDebug' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, UpdateInterval) == 0x0002B8, "Member 'UWB_DebugAIOptimizer_C::UpdateInterval' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, ShowDespawnedSubjects) == 0x0002BC, "Member 'UWB_DebugAIOptimizer_C::ShowDespawnedSubjects' has a wrong offset!");
static_assert(offsetof(UWB_DebugAIOptimizer_C, SubsystemEnabled) == 0x0002BD, "Member 'UWB_DebugAIOptimizer_C::SubsystemEnabled' has a wrong offset!");

}

