#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PointDetail

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_PointDetail.WB_PointDetail_C.ExecuteUbergraph_WB_PointDetail
// 0x0098 (0x0098 - 0x0000)
struct WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetMousePositionOnViewport_ReturnValue;   // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_Name;                           // 0x0060(0x0018)()
	class FText                                   K2Node_CustomEvent_Details;                        // 0x0078(0x0018)()
	class UTexture2D*                             K2Node_CustomEvent___;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail) == 0x000008, "Wrong alignment on WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail");
static_assert(sizeof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail) == 0x000098, "Wrong size on WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, EntryPoint) == 0x000000, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, K2Node_Event_MyGeometry) == 0x000004, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, CallFunc_PlayAnimation_ReturnValue) == 0x000040, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, CallFunc_GetMousePositionOnViewport_ReturnValue) == 0x000048, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::CallFunc_GetMousePositionOnViewport_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, CallFunc_BreakVector2D_X) == 0x000050, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, CallFunc_BreakVector2D_Y) == 0x000054, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, K2Node_CustomEvent_Name) == 0x000060, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::K2Node_CustomEvent_Name' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, K2Node_CustomEvent_Details) == 0x000078, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::K2Node_CustomEvent_Details' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail, K2Node_CustomEvent___) == 0x000090, "Member 'WB_PointDetail_C_ExecuteUbergraph_WB_PointDetail::K2Node_CustomEvent___' has a wrong offset!");

// Function WB_PointDetail.WB_PointDetail_C.设置详情
// 0x0038 (0x0038 - 0x0000)
struct WB_PointDetail_C_设置详情 final
{
public:
	class FText                                   Param_Name_0;                                      // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Details_0;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             图标; // 0x0030(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PointDetail_C_设置详情) == 0x000008, "Wrong alignment on WB_PointDetail_C_设置详情");
static_assert(sizeof(WB_PointDetail_C_设置详情) == 0x000038, "Wrong size on WB_PointDetail_C_设置详情");
static_assert(offsetof(WB_PointDetail_C_设置详情, Param_Name_0) == 0x000000, "Member 'WB_PointDetail_C_设置详情::Param_Name_0' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_设置详情, Details_0) == 0x000018, "Member 'WB_PointDetail_C_设置详情::Details_0' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_设置详情, 图标) == 0x000030, "Member 'WB_PointDetail_C_设置详情::图标' has a wrong offset!");

// Function WB_PointDetail.WB_PointDetail_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_PointDetail_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_PointDetail_C_Tick) == 0x000004, "Wrong alignment on WB_PointDetail_C_Tick");
static_assert(sizeof(WB_PointDetail_C_Tick) == 0x00003C, "Wrong size on WB_PointDetail_C_Tick");
static_assert(offsetof(WB_PointDetail_C_Tick, MyGeometry) == 0x000000, "Member 'WB_PointDetail_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_PointDetail_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_PointDetail_C_Tick::InDeltaTime' has a wrong offset!");

}

