#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_丢弃的范围

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_丢弃的范围.WB_丢弃的范围_C
// 0x0020 (0x0280 - 0x0260)
class UWB_丢弃的范围_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBackpack_UMG_C*                        BackpackUMG;                                       // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           As_Player_BP;                                      // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_丢弃的数量_C* 丢弃的数量umg; // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_丢弃的范围(int32 EntryPoint);
	void 丢弃();
	void OnDragLeave(const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void OnDragEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);
	void Construct();
	bool OnDrop(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation* Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_丢弃的范围_C">();
	}
	static class UWB_丢弃的范围_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_丢弃的范围_C>();
	}
};
static_assert(alignof(UWB_丢弃的范围_C) == 0x000008, "Wrong alignment on UWB_丢弃的范围_C");
static_assert(sizeof(UWB_丢弃的范围_C) == 0x000280, "Wrong size on UWB_丢弃的范围_C");
static_assert(offsetof(UWB_丢弃的范围_C, UberGraphFrame) == 0x000260, "Member 'UWB_丢弃的范围_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_丢弃的范围_C, BackpackUMG) == 0x000268, "Member 'UWB_丢弃的范围_C::BackpackUMG' has a wrong offset!");
static_assert(offsetof(UWB_丢弃的范围_C, As_Player_BP) == 0x000270, "Member 'UWB_丢弃的范围_C::As_Player_BP' has a wrong offset!");
static_assert(offsetof(UWB_丢弃的范围_C, 丢弃的数量umg) == 0x000278, "Member 'UWB_丢弃的范围_C::丢弃的数量umg' has a wrong offset!");

}

