#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HitCircle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HitCircle.WBP_HitCircle_C
// 0x0040 (0x02A0 - 0x0260)
class UWBP_HitCircle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EndAnim;                                           // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartAnim;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_0;                                          // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Materials;                                         // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Actor;                                             // 0x0288(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                HitLocation;                                       // 0x0290(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WBP_HitCircle(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WBP_HitCircle_C">();
	}
	static class UWBP_HitCircle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HitCircle_C>();
	}
};
static_assert(alignof(UWBP_HitCircle_C) == 0x000008, "Wrong alignment on UWBP_HitCircle_C");
static_assert(sizeof(UWBP_HitCircle_C) == 0x0002A0, "Wrong size on UWBP_HitCircle_C");
static_assert(offsetof(UWBP_HitCircle_C, UberGraphFrame) == 0x000260, "Member 'UWBP_HitCircle_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, EndAnim) == 0x000268, "Member 'UWBP_HitCircle_C::EndAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, StartAnim) == 0x000270, "Member 'UWBP_HitCircle_C::StartAnim' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, Border_0) == 0x000278, "Member 'UWBP_HitCircle_C::Border_0' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, Materials) == 0x000280, "Member 'UWBP_HitCircle_C::Materials' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, Actor) == 0x000288, "Member 'UWBP_HitCircle_C::Actor' has a wrong offset!");
static_assert(offsetof(UWBP_HitCircle_C, HitLocation) == 0x000290, "Member 'UWBP_HitCircle_C::HitLocation' has a wrong offset!");

}

