#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HitCircle

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_HitCircle.WBP_HitCircle_C.ExecuteUbergraph_WBP_HitCircle
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue;         // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_DegAtan2_ReturnValue;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MapRangeClamped_ReturnValue;              // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetEndTime_ReturnValue;                   // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationForward_ReturnValue_1;       // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle) == 0x000008, "Wrong alignment on WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle");
static_assert(sizeof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle) == 0x0000C0, "Wrong size on WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, EntryPoint) == 0x000000, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, K2Node_Event_MyGeometry) == 0x000004, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000040, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000048, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_GetActorForwardVector_ReturnValue) == 0x000054, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_X) == 0x000060, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_Y) == 0x000064, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_Z) == 0x000068, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00006C, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Normal_ReturnValue) == 0x000078, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_X_1) == 0x000084, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_Y_1) == 0x000088, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_BreakVector_Z_1) == 0x00008C, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_PlayAnimationForward_ReturnValue) == 0x000090, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_PlayAnimationForward_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000098, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00009C, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Dot_VectorVector_ReturnValue) == 0x0000A0, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0000A4, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_DegAtan2_ReturnValue) == 0x0000A8, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_DegAtan2_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_MapRangeClamped_ReturnValue) == 0x0000AC, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_GetEndTime_ReturnValue) == 0x0000B0, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_GetEndTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle, CallFunc_PlayAnimationForward_ReturnValue_1) == 0x0000B8, "Member 'WBP_HitCircle_C_ExecuteUbergraph_WBP_HitCircle::CallFunc_PlayAnimationForward_ReturnValue_1' has a wrong offset!");

// Function WBP_HitCircle.WBP_HitCircle_C.Tick
// 0x003C (0x003C - 0x0000)
struct WBP_HitCircle_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_HitCircle_C_Tick) == 0x000004, "Wrong alignment on WBP_HitCircle_C_Tick");
static_assert(sizeof(WBP_HitCircle_C_Tick) == 0x00003C, "Wrong size on WBP_HitCircle_C_Tick");
static_assert(offsetof(WBP_HitCircle_C_Tick, MyGeometry) == 0x000000, "Member 'WBP_HitCircle_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_HitCircle_C_Tick, InDeltaTime) == 0x000038, "Member 'WBP_HitCircle_C_Tick::InDeltaTime' has a wrong offset!");

}

