#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventoryData_Struct_structs.hpp"
#include "UMG_structs.hpp"
#include "Optics_Enum_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MuzzleType_structs.hpp"
#include "BulletType_Enum_structs.hpp"
#include "Weapon_StructURE_structs.hpp"


namespace SDK::Params
{

// Function Weapon_Master.Weapon_Master_C.ExecuteUbergraph_Weapon_Master
// 0x08E0 (0x08E0 - 0x0000)
struct Weapon_Master_C_ExecuteUbergraph_Weapon_Master final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMuzzleType                                   ___byte_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EBulletType_Enum                              ___byte_Variable_1;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EOptics_Enum                                  ___byte_Variable_2;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ___float_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_1;                               // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_2;                               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_3;                               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable_4;                               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class USkeletalMeshComponent*                 CallFunc_AddComponent_ReturnValue;                 // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_____;                                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8D[0x3];                                       // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0090(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0128(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_Player;                               // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0160(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x017C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_____;                           // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_CustomEvent_Key;                            // 0x0190(0x0018)(HasGetValueTypeHash)
	class APlayerCameraManager*                   CallFunc_GetPlayerCameraManager_ReturnValue;       // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x3];                                      // 0x01B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMuzzleType                                   ___byte_Variable_3;                                // 0x01C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C3[0x1];                                      // 0x01C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc________ReturnValue;                       // 0x01C4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc________ReturnValue1;                      // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DC[0x4];                                      // 0x01DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01E0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAngle_ReturnValue;                   // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInputKeyDown_ReturnValue;               // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_222[0xE];                                      // 0x0222(0x000E)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0230(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0260(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0278(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_284[0x4];                                      // 0x0284(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        K2Node_Select_Default;                             // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0290(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue_1;     // 0x02A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x02D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_1;                // 0x02DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_1;                // 0x02E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_1;                   // 0x02F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0300(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0308(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x030C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0314(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0320(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32C[0x4];                                      // 0x032C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0330(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x3];                                      // 0x0339(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x033C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_1;           // 0x0340(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_FloatToVector_ReturnValue;           // 0x0358(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default_1;                           // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0370(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x03B8(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x03C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x03C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0x03CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCameraShakeBase*                       CallFunc_StartCameraShake_ReturnValue;             // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x03D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D9[0x3];                                      // 0x03D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_SocketName_2;                   // 0x03DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_SocketName_1;                   // 0x03E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3ED[0x3];                                      // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AClip_Master_C*                         K2Node_DynamicCast_AsClip_Master;                  // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3FA[0x6];                                      // 0x03FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_2;              // 0x0400(0x0030)(IsPlainOldData, NoDestructor)
	int32                                         ___int_Variable_1;                                 // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0434(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AClip_Master_C*                         K2Node_DynamicCast_AsClip_Master_1;                // 0x0438(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0440(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_SocketName;                     // 0x0444(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x044C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_44D[0x3];                                      // 0x044D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AClip_Master_C*                         K2Node_DynamicCast_AsClip_Master_2;                // 0x0450(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0459(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x045A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x045B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x045C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x045D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_6;                    // 0x045E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_7;                    // 0x045F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_461[0x3];                                      // 0x0461(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue_1;                // 0x0464(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_5;          // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_2;           // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue_3;           // 0x046D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_46E[0x2];                                      // 0x046E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_2; // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_2;        // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default_2;                           // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_6;          // 0x0484(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_7;          // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_8;          // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0490(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x0498(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49C[0x4];                                      // 0x049C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x04A0(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_2;                // 0x04D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_2;                // 0x04DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_2;                   // 0x04E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F4[0xC];                                      // 0x04F4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0500(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_3;                // 0x0530(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_3;                // 0x053C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_3;                   // 0x0548(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue;                        // 0x0554(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0560(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0564(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565[0x3];                                      // 0x0565(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0568(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0574(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0580(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult; // 0x058C(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_614[0xC];                                      // 0x0614(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue_1;       // 0x0620(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue_1;         // 0x0650(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location_4;                // 0x0680(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_4;                // 0x068C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_4;                   // 0x0698(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location_5;                // 0x06A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation_5;                // 0x06B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale_5;                   // 0x06BC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RLerp_ReturnValue_1;                      // 0x06C8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x06D4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x06E0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x06EC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocationAndRotation_SweepHitResult_1; // 0x06F8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_Key_IsGamepadKey_ReturnValue;             // 0x0780(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_781[0x3];                                      // 0x0781(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0784(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0788(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x078C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x0790(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x0794(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x0798(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select_Default_3;                           // 0x079C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_2;                // 0x07A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_3;                // 0x07A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7A8[0x8];                                      // 0x07A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_3;              // 0x07B0(0x0030)(IsPlainOldData, NoDestructor)
	float                                         CallFunc_SelectFloat_ReturnValue_4;                // 0x07E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectFloat_ReturnValue_5;                // 0x07E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue_1;                       // 0x07E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x07EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x07F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7F4[0x4];                                      // 0x07F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue_1;              // 0x07F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_2;                  // 0x0800(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0808(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_8;                    // 0x0809(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue;                // 0x080A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SetStaticMesh_ReturnValue_1;              // 0x080B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_9;                    // 0x080C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_10;                   // 0x080D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_11;                   // 0x080E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x080F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_12;                   // 0x0810(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_811[0x7];                                      // 0x0811(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_GetDataTableRowNames_OutRowNames;         // 0x0818(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_3; // 0x0828(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_3;        // 0x0830(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0838(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGlobalTimeDilation_ReturnValue;        // 0x083C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0840(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_9;          // 0x0848(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84C[0x4];                                      // 0x084C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWeapon_Structure                      CallFunc_GetDataTableRowFromName_OutRow;           // 0x0850(0x0078)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x08C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_8C9[0x7];                                      // 0x08C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x08D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master) == 0x000010, "Wrong alignment on Weapon_Master_C_ExecuteUbergraph_Weapon_Master");
static_assert(sizeof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master) == 0x0008E0, "Wrong size on Weapon_Master_C_ExecuteUbergraph_Weapon_Master");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, EntryPoint) == 0x000000, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___byte_Variable) == 0x000004, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___byte_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___byte_Variable_1) == 0x000005, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___int_Variable) == 0x000008, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___int_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_SwitchEnum_CmpSuccess) == 0x00000C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___byte_Variable_2) == 0x00000D, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___byte_Variable_2' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___float_Variable) == 0x000010, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___float_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___float_Variable_1) == 0x000014, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___float_Variable_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___float_Variable_2) == 0x000018, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___float_Variable_2' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___float_Variable_3) == 0x00001C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___float_Variable_3' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___float_Variable_4) == 0x000020, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___float_Variable_4' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___struct_Variable) == 0x000030, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_AddComponent_ReturnValue) == 0x000060, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_Event_____) == 0x000068, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_Event_____' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000070, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000078, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000080, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000088, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_bFromSweep) == 0x00008C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_SweepResult) == 0x000090, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000118, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherActor) == 0x000120, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherComp) == 0x000128, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000130, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_DynamicCast_AsPlayer_BP) == 0x000138, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_DynamicCast_bSuccess) == 0x000140, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_DynamicCast_AsPlayer_BP_1) == 0x000148, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_DynamicCast_bSuccess_1) == 0x000150, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_Event_Player) == 0x000158, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000160, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakVector_X) == 0x00016C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakVector_Y) == 0x000170, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakVector_Z) == 0x000174, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Add_FloatFloat_ReturnValue) == 0x000178, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_MakeVector_ReturnValue) == 0x00017C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_CustomEvent_____) == 0x000188, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_CustomEvent_____' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_CustomEvent_Key) == 0x000190, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_CustomEvent_Key' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_GetPlayerCameraManager_ReturnValue) == 0x0001A8, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_GetPlayerCameraManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___bool_IsClosed_Variable) == 0x0001B0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001B4, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___bool_Has_Been_Initd_Variable) == 0x0001C0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, ___byte_Variable_3) == 0x0001C1, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::___byte_Variable_3' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_IsValid_ReturnValue) == 0x0001C2, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc________ReturnValue) == 0x0001C4, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc________ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc________ReturnValue1) == 0x0001D0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc________ReturnValue1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_MakeTransform_ReturnValue) == 0x0001E0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000210, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_ClampAngle_ReturnValue) == 0x000214, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_ClampAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_GetPlayerController_ReturnValue) == 0x000218, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_IsInputKeyDown_ReturnValue) == 0x000220, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_IsInputKeyDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_SwitchEnum_CmpSuccess_1) == 0x000221, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000230, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Location) == 0x000260, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Rotation) == 0x00026C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Scale) == 0x000278, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_Select_Default) == 0x000288, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000290, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetComponentToWorld_ReturnValue_1) == 0x0002A0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetComponentToWorld_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_SelectVector_ReturnValue) == 0x0002D0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_SelectVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Location_1) == 0x0002DC, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Location_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Rotation_1) == 0x0002E8, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Rotation_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BreakTransform_Scale_1) == 0x0002F4, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BreakTransform_Scale_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000300, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000308, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BooleanOR_ReturnValue) == 0x00030C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_SelectFloat_ReturnValue) == 0x000310, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000314, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000320, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_GetPlayerController_ReturnValue_1) == 0x000330, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000338, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Subtract_IntInt_ReturnValue) == 0x00033C, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_LessEqual_IntInt_ReturnValue_1) == 0x000340, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_LessEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000348, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_FinishSpawningActor_ReturnValue) == 0x000350, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Conv_FloatToVector_ReturnValue) == 0x000358, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Conv_FloatToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, K2Node_Select_Default_1) == 0x000368, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_MakeTransform_ReturnValue_1) == 0x000370, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0003A0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0003A8, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Divide_FloatFloat_ReturnValue) == 0x0003B0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_K2_SetTimer_ReturnValue) == 0x0003B8, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0003C0, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0003C4, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Weapon_Master_C_ExecuteUbergraph_Weapon_Master, CallFunc_Divide_FloatFloat_ReturnValue_3) == 0x0003C8, "Member 'Weapon_Master_C_ExecuteUbergraph_Weapon_Master::CallFunc_Divide_FloatFloat_ReturnValue_3' has a wrong offset!");
