#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WinNew

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WinNew.WinNew_C.ExecuteUbergraph_WinNew
// 0x0138 (0x0138 - 0x0000)
struct WinNew_C_ExecuteUbergraph_WinNew final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ULoading_UMG_C*                         CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameModeBase*                          CallFunc_GetGameMode_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AInGameGameMode_C*                      K2Node_DynamicCast_AsIn_Game_Game_Mode;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc__________;                                // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0070(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc___________1;                              // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x00E0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_FTrunc_ReturnValue;                       // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0108(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue_1;          // 0x0120(0x0018)()
};
static_assert(alignof(WinNew_C_ExecuteUbergraph_WinNew) == 0x000008, "Wrong alignment on WinNew_C_ExecuteUbergraph_WinNew");
static_assert(sizeof(WinNew_C_ExecuteUbergraph_WinNew) == 0x000138, "Wrong size on WinNew_C_ExecuteUbergraph_WinNew");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, EntryPoint) == 0x000000, "Member 'WinNew_C_ExecuteUbergraph_WinNew::EntryPoint' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Create_ReturnValue) == 0x000008, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_PlayAnimation_ReturnValue) == 0x000030, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_GetGameMode_ReturnValue) == 0x000038, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_GetGameMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_DynamicCast_AsIn_Game_Game_Mode) == 0x000040, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_DynamicCast_AsIn_Game_Game_Mode' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_GetPlayerPawn_ReturnValue) == 0x000050, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_DynamicCast_AsPlayer_BP) == 0x000058, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'WinNew_C_ExecuteUbergraph_WinNew::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000064, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc__________) == 0x000068, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc__________' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00006C, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_FloatToText_ReturnValue) == 0x000070, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_FloatToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000088, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_FloatToString_ReturnValue) == 0x000090, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc___________1) == 0x0000A0, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc___________1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Concat_StrStr_ReturnValue) == 0x0000A8, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x0000B8, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x0000D8, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x0000DC, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x0000E0, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_FTrunc_ReturnValue) == 0x0000F0, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_FTrunc_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000F8, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_IntToText_ReturnValue) == 0x000108, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_ExecuteUbergraph_WinNew, CallFunc_Conv_StringToText_ReturnValue_1) == 0x000120, "Member 'WinNew_C_ExecuteUbergraph_WinNew::CallFunc_Conv_StringToText_ReturnValue_1' has a wrong offset!");

// Function WinNew.WinNew_C.GetVisibility_0
// 0x0002 (0x0002 - 0x0000)
struct WinNew_C_GetVisibility_0 final
{
public:
	ESlateVisibility                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WinNew_C_GetVisibility_0) == 0x000001, "Wrong alignment on WinNew_C_GetVisibility_0");
static_assert(sizeof(WinNew_C_GetVisibility_0) == 0x000002, "Wrong size on WinNew_C_GetVisibility_0");
static_assert(offsetof(WinNew_C_GetVisibility_0, ReturnValue) == 0x000000, "Member 'WinNew_C_GetVisibility_0::ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_GetVisibility_0, CallFunc_IsAnimationPlaying_ReturnValue) == 0x000001, "Member 'WinNew_C_GetVisibility_0::CallFunc_IsAnimationPlaying_ReturnValue' has a wrong offset!");

// Function WinNew.WinNew_C.通关时间计算
// 0x0150 (0x0150 - 0x0000)
struct WinNew_C_通关时间计算 final
{
public:
	int32                                         Time;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_2;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_3;           // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_4;           // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_1;          // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_TextToString_ReturnValue_2;          // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_5;              // 0x00F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_6;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue;                 // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_SelectString_ReturnValue_1;               // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0138(0x0018)()
};
static_assert(alignof(WinNew_C_通关时间计算) == 0x000008, "Wrong alignment on WinNew_C_通关时间计算");
static_assert(sizeof(WinNew_C_通关时间计算) == 0x000150, "Wrong size on WinNew_C_通关时间计算");
static_assert(offsetof(WinNew_C_通关时间计算, Time) == 0x000000, "Member 'WinNew_C_通关时间计算::Time' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Percent_IntInt_ReturnValue) == 0x000004, "Member 'WinNew_C_通关时间计算::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_TextToString_ReturnValue) == 0x000008, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_IntToString_ReturnValue) == 0x000018, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000028, "Member 'WinNew_C_通关时间计算::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Divide_IntInt_ReturnValue) == 0x00002C, "Member 'WinNew_C_通关时间计算::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000030, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_IntToString_ReturnValue_2) == 0x000040, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_IntToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'WinNew_C_通关时间计算::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_IntToString_ReturnValue_3) == 0x000058, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_IntToString_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000068, "Member 'WinNew_C_通关时间计算::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_IntToString_ReturnValue_4) == 0x000080, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_IntToString_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000090, "Member 'WinNew_C_通关时间计算::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_TextToString_ReturnValue_1) == 0x000098, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_TextToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_TextToString_ReturnValue_2) == 0x0000A8, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_TextToString_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_1) == 0x0000B8, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_2) == 0x0000C8, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_3) == 0x0000D8, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_4) == 0x0000E8, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_5) == 0x0000F8, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Concat_StrStr_ReturnValue_6) == 0x000108, "Member 'WinNew_C_通关时间计算::CallFunc_Concat_StrStr_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_SelectString_ReturnValue) == 0x000118, "Member 'WinNew_C_通关时间计算::CallFunc_SelectString_ReturnValue' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_SelectString_ReturnValue_1) == 0x000128, "Member 'WinNew_C_通关时间计算::CallFunc_SelectString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WinNew_C_通关时间计算, CallFunc_Conv_StringToText_ReturnValue) == 0x000138, "Member 'WinNew_C_通关时间计算::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

