#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie_AIController

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Zombie_AIController.Zombie_AIController_C
// 0x0040 (0x0368 - 0x0328)
class AZombie_AIController_C final : public AAIController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIPerceptionComponent*                 AIPerception;                                      // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ZombieRef;                                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                最后看到玩家的位置; // 0x0340(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34C[0x4];                                      // 0x034C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_BP_C*                           PlayerRef;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Hear_Stimulus_Location;                            // 0x0358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Zombie_AIController(int32 EntryPoint);
	void ZombieDead();
	void ReceiveBeginPlay();
	void Reset();
	void ReceivePossess(class APawn* PossessedPawn);
	void BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Zombie_AIController_C">();
	}
	static class AZombie_AIController_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AZombie_AIController_C>();
	}
};
static_assert(alignof(AZombie_AIController_C) == 0x000008, "Wrong alignment on AZombie_AIController_C");
static_assert(sizeof(AZombie_AIController_C) == 0x000368, "Wrong size on AZombie_AIController_C");
static_assert(offsetof(AZombie_AIController_C, UberGraphFrame) == 0x000328, "Member 'AZombie_AIController_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AZombie_AIController_C, AIPerception) == 0x000330, "Member 'AZombie_AIController_C::AIPerception' has a wrong offset!");
static_assert(offsetof(AZombie_AIController_C, ZombieRef) == 0x000338, "Member 'AZombie_AIController_C::ZombieRef' has a wrong offset!");
static_assert(offsetof(AZombie_AIController_C, 最后看到玩家的位置) == 0x000340, "Member 'AZombie_AIController_C::最后看到玩家的位置' has a wrong offset!");
static_assert(offsetof(AZombie_AIController_C, PlayerRef) == 0x000350, "Member 'AZombie_AIController_C::PlayerRef' has a wrong offset!");
static_assert(offsetof(AZombie_AIController_C, Hear_Stimulus_Location) == 0x000358, "Member 'AZombie_AIController_C::Hear_Stimulus_Location' has a wrong offset!");

}

