#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie_Moveto

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Zombie_Moveto.Zombie_Moveto_C
// 0x0038 (0x00E0 - 0x00A8)
class UZombie_Moveto_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 RandomLoc;                                         // 0x00B0(0x0028)(Edit, BlueprintVisible)
	float                                         Acceptance_Radius;                                 // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Zombie_Moveto(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void OnSuccess_2BFCCD404763D3F5AA729698DDDE9597(EPathFollowingResult MovementResult);
	void OnFail_2BFCCD404763D3F5AA729698DDDE9597(EPathFollowingResult MovementResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Zombie_Moveto_C">();
	}
	static class UZombie_Moveto_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UZombie_Moveto_C>();
	}
};
static_assert(alignof(UZombie_Moveto_C) == 0x000008, "Wrong alignment on UZombie_Moveto_C");
static_assert(sizeof(UZombie_Moveto_C) == 0x0000E0, "Wrong size on UZombie_Moveto_C");
static_assert(offsetof(UZombie_Moveto_C, UberGraphFrame) == 0x0000A8, "Member 'UZombie_Moveto_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UZombie_Moveto_C, RandomLoc) == 0x0000B0, "Member 'UZombie_Moveto_C::RandomLoc' has a wrong offset!");
static_assert(offsetof(UZombie_Moveto_C, Acceptance_Radius) == 0x0000D8, "Member 'UZombie_Moveto_C::Acceptance_Radius' has a wrong offset!");

}

