#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieBuilder_BP2

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ZombieBuilder_BP2.ZombieBuilder_BP2_C.ExecuteUbergraph_ZombieBuilder_BP2
// 0x0210 (0x0210 - 0x0000)
struct ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ___object_Variable;                                // 0x0018(0x0010)(ConstParm, ReferenceParm)
	int32                                         ___int_Variable;                                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_SphereTraceSingle_OutHit;                 // 0x0038(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingle_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C3[0x1];                                       // 0x00C3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00CC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00D8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00E4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00F0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x012C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0138(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0144(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0165(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_166[0x2];                                      // 0x0166(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0174(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0180(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_BP_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C1[0x7];                                      // 0x01C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x3];                                      // 0x01E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x01E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x01E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation_1; // 0x01F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue_1; // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0201(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2) == 0x000010, "Wrong alignment on ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2");
static_assert(sizeof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2) == 0x000210, "Wrong size on ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, EntryPoint) == 0x000000, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, ___int_Loop_Counter_Variable) == 0x000008, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Add_IntInt_ReturnValue_1) == 0x00000C, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, ___int_Array_Index_Variable) == 0x000010, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, ___object_Variable) == 0x000018, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::___object_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, ___int_Variable) == 0x000028, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::___int_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Subtract_VectorVector_ReturnValue) == 0x00002C, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_SphereTraceSingle_OutHit) == 0x000038, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_SphereTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_SphereTraceSingle_ReturnValue) == 0x0000C0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_SphereTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_bBlockingHit) == 0x0000C1, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000C2, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_Time) == 0x0000C4, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_Distance) == 0x0000C8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_Location) == 0x0000CC, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_ImpactPoint) == 0x0000D8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_Normal) == 0x0000E4, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_ImpactNormal) == 0x0000F0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_PhysMat) == 0x000100, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_HitActor) == 0x000108, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_HitComponent) == 0x000110, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_HitBoneName) == 0x000118, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_HitItem) == 0x000120, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_ElementIndex) == 0x000124, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_FaceIndex) == 0x000128, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_TraceStart) == 0x00012C, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakHitResult_TraceEnd) == 0x000138, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000144, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Array_Get_Item) == 0x000150, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000158, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x000164, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000165, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakVector_X) == 0x000168, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakVector_Y) == 0x00016C, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BreakVector_Z) == 0x000170, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_MakeVector_ReturnValue) == 0x000174, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000180, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0001B0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_FinishSpawningActor_ReturnValue) == 0x0001B8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_IsValid_ReturnValue) == 0x0001C0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Array_Get_Item_1) == 0x0001C8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, K2Node_DynamicCast_AsZombie_BP) == 0x0001D0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, K2Node_DynamicCast_bSuccess) == 0x0001D8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Array_Length_ReturnValue) == 0x0001DC, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Less_IntInt_ReturnValue) == 0x0001E0, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_Array_Add_ReturnValue) == 0x0001E4, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0001E8, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation_1) == 0x0001F4, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue_1) == 0x000200, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000201, "Member 'ZombieBuilder_BP2_C_ExecuteUbergraph_ZombieBuilder_BP2::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");

}

