#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie_AIController

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Zombie_AIController.Zombie_AIController_C.ExecuteUbergraph_Zombie_AIController
// 0x00F8 (0x00F8 - 0x0000)
struct Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x0010(0x003C)(NoDestructor)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP;                    // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation; // 0x0074(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue; // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_82[0x2];                                       // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_Event_PossessedPawn;                        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x009C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_1;              // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_2;            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayer_BP_C*                           K2Node_DynamicCast_AsPlayer_BP_1;                  // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_2;              // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_3;            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlackboardComponent*                   CallFunc_GetBlackboard_ReturnValue_3;              // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue_1;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController) == 0x000008, "Wrong alignment on Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController");
static_assert(sizeof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController) == 0x0000F8, "Wrong size on Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, EntryPoint) == 0x000000, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_ComponentBoundEvent_Actor) == 0x000008, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_ComponentBoundEvent_Actor' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_ComponentBoundEvent_Stimulus) == 0x000010, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_ComponentBoundEvent_Stimulus' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_GetBlackboard_ReturnValue) == 0x000050, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_DynamicCast_AsPlayer_BP) == 0x000058, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_DynamicCast_AsPlayer_BP' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000064, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000070, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation) == 0x000074, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_K2_GetRandomReachablePointInRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue) == 0x000080, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_K2_GetRandomReachablePointInRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000081, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_MakeLiteralName_ReturnValue) == 0x000084, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_Event_PossessedPawn) == 0x000090, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_Event_PossessedPawn' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_RunBehaviorTree_ReturnValue) == 0x000098, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_RunBehaviorTree_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_MakeLiteralName_ReturnValue_1) == 0x00009C, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_GetBlackboard_ReturnValue_1) == 0x0000A8, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_GetBlackboard_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, ___bool_Has_Been_Initd_Variable) == 0x0000B0, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, ___bool_IsClosed_Variable) == 0x0000B1, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_GetPlayerPawn_ReturnValue) == 0x0000B8, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_GetPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_MakeLiteralName_ReturnValue_2) == 0x0000C0, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_MakeLiteralName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_DynamicCast_AsPlayer_BP_1) == 0x0000C8, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_DynamicCast_AsPlayer_BP_1' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, K2Node_DynamicCast_bSuccess_1) == 0x0000D0, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_GetBlackboard_ReturnValue_2) == 0x0000D8, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_GetBlackboard_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_MakeLiteralName_ReturnValue_3) == 0x0000E0, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_MakeLiteralName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_GetBlackboard_ReturnValue_3) == 0x0000E8, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_GetBlackboard_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController, CallFunc_RunBehaviorTree_ReturnValue_1) == 0x0000F0, "Member 'Zombie_AIController_C_ExecuteUbergraph_Zombie_AIController::CallFunc_RunBehaviorTree_ReturnValue_1' has a wrong offset!");

// Function Zombie_AIController.Zombie_AIController_C.ReceivePossess
// 0x0008 (0x0008 - 0x0000)
struct Zombie_AIController_C_ReceivePossess final
{
public:
	class APawn*                                  PossessedPawn;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_AIController_C_ReceivePossess) == 0x000008, "Wrong alignment on Zombie_AIController_C_ReceivePossess");
static_assert(sizeof(Zombie_AIController_C_ReceivePossess) == 0x000008, "Wrong size on Zombie_AIController_C_ReceivePossess");
static_assert(offsetof(Zombie_AIController_C_ReceivePossess, PossessedPawn) == 0x000000, "Member 'Zombie_AIController_C_ReceivePossess::PossessedPawn' has a wrong offset!");

// Function Zombie_AIController.Zombie_AIController_C.BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature
// 0x0048 (0x0048 - 0x0000)
struct Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x003C)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
static_assert(alignof(Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(sizeof(Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature) == 0x000048, "Wrong size on Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature");
static_assert(offsetof(Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature, Actor) == 0x000000, "Member 'Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature::Actor' has a wrong offset!");
static_assert(offsetof(Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature, Stimulus) == 0x000008, "Member 'Zombie_AIController_C_BndEvt__AIPerception_K2Node_ComponentBoundEvent_1_ActorPerceptionUpdatedDelegate__DelegateSignature::Stimulus' has a wrong offset!");

}

