#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Zombie_NewAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Zombie_NewAnim.Zombie_NewAnim_C.ExecuteUbergraph_Zombie_NewAnim
// 0x0068 (0x0068 - 0x0000)
struct Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1; // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Abs_ReturnValue;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B[0x1];                                       // 0x001B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_CalculateDirection_ReturnValue;           // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim) == 0x000008, "Wrong alignment on Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim");
static_assert(sizeof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim) == 0x000068, "Wrong size on Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, EntryPoint) == 0x000000, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue) == 0x000004, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_Less_FloatFloat_ReturnValue) == 0x000008, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1) == 0x00000C, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_GetRelevantAnimTimeRemaining_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_Abs_ReturnValue) == 0x000014, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x000018, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000019, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x00001A, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_RandomFloatInRange_ReturnValue) == 0x00001C, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000020, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_IsValid_ReturnValue_1) == 0x000029, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_K2_GetActorRotation_ReturnValue) == 0x00002C, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_GetVelocity_ReturnValue) == 0x000038, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, K2Node_DynamicCast_AsZombie_BP) == 0x000048, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_CalculateDirection_ReturnValue) == 0x000054, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_CalculateDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_VSize_ReturnValue) == 0x000058, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, CallFunc_IsValid_ReturnValue_2) == 0x00005C, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim, K2Node_Event_DeltaTimeX) == 0x000060, "Member 'Zombie_NewAnim_C_ExecuteUbergraph_Zombie_NewAnim::K2Node_Event_DeltaTimeX' has a wrong offset!");

// Function Zombie_NewAnim.Zombie_NewAnim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct Zombie_NewAnim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Zombie_NewAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on Zombie_NewAnim_C_BlueprintUpdateAnimation");
static_assert(sizeof(Zombie_NewAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on Zombie_NewAnim_C_BlueprintUpdateAnimation");
static_assert(offsetof(Zombie_NewAnim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'Zombie_NewAnim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function Zombie_NewAnim.Zombie_NewAnim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct Zombie_NewAnim_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(Zombie_NewAnim_C_AnimGraph) == 0x000008, "Wrong alignment on Zombie_NewAnim_C_AnimGraph");
static_assert(sizeof(Zombie_NewAnim_C_AnimGraph) == 0x000010, "Wrong size on Zombie_NewAnim_C_AnimGraph");
static_assert(offsetof(Zombie_NewAnim_C_AnimGraph, AnimGraph_0) == 0x000000, "Member 'Zombie_NewAnim_C_AnimGraph::AnimGraph_0' has a wrong offset!");

}

