#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ZombieBuilder_BP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ZombieBuilder_BP.ZombieBuilder_BP_C.ExecuteUbergraph_ZombieBuilder_BP
// 0x00B0 (0x00B0 - 0x0000)
struct ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Variable;                                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation; // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue; // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_Conv_VectorToTransform_ReturnValue;       // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AZombie_BP_C*                           CallFunc_FinishSpawningActor_ReturnValue;          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AZombie_BP_C*                           K2Node_DynamicCast_AsZombie_BP;                    // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP) == 0x000010, "Wrong alignment on ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP");
static_assert(sizeof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP) == 0x0000B0, "Wrong size on ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, EntryPoint) == 0x000000, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, ___int_Loop_Counter_Variable) == 0x000004, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, ___int_Array_Index_Variable) == 0x00000C, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000010, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, ___int_Variable) == 0x00001C, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::___int_Variable' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation) == 0x000020, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_K2_GetRandomPointInNavigableRadius_RandomLocation' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue) == 0x00002C, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_K2_GetRandomPointInNavigableRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Conv_VectorToTransform_ReturnValue) == 0x000030, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Conv_VectorToTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000060, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000068, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_FinishSpawningActor_ReturnValue) == 0x000070, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Add_IntInt_ReturnValue_1) == 0x000078, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Array_Add_ReturnValue) == 0x00007C, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Array_Length_ReturnValue) == 0x000080, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Array_Get_Item) == 0x000088, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_Less_IntInt_ReturnValue) == 0x000090, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, K2Node_DynamicCast_AsZombie_BP) == 0x000098, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::K2Node_DynamicCast_AsZombie_BP' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, K2Node_DynamicCast_bSuccess) == 0x0000A0, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP, CallFunc_IsValid_ReturnValue) == 0x0000A1, "Member 'ZombieBuilder_BP_C_ExecuteUbergraph_ZombieBuilder_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

