#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 剧情线索_UMG

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass 剧情线索_UMG.剧情线索_UMG_C
// 0x0020 (0x0280 - 0x0260)
class U剧情线索_UMG_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_76;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_289;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_剧情线索_UMG(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"剧情线索_UMG_C">();
	}
	static class U剧情线索_UMG_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<U剧情线索_UMG_C>();
	}
};
static_assert(alignof(U剧情线索_UMG_C) == 0x000008, "Wrong alignment on U剧情线索_UMG_C");
static_assert(sizeof(U剧情线索_UMG_C) == 0x000280, "Wrong size on U剧情线索_UMG_C");
static_assert(offsetof(U剧情线索_UMG_C, UberGraphFrame) == 0x000260, "Member 'U剧情线索_UMG_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(U剧情线索_UMG_C, NewAnimation) == 0x000268, "Member 'U剧情线索_UMG_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(U剧情线索_UMG_C, Image_76) == 0x000270, "Member 'U剧情线索_UMG_C::Image_76' has a wrong offset!");
static_assert(offsetof(U剧情线索_UMG_C, Image_289) == 0x000278, "Member 'U剧情线索_UMG_C::Image_289' has a wrong offset!");

}

