#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 取消攻击丧尸

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function 取消攻击丧尸.取消攻击丧尸_C.ExecuteUbergraph_取消攻击丧尸
// 0x0068 (0x0068 - 0x0000)
struct 取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class A丧尸波数生成器_BP_C* CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult_1;               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate;       // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          K2Node_CustomEvent_MovementResult;                 // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EPathFollowingResult MovementResult)> K2Node_CreateDelegate_OutputDelegate_1;     // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
	EPathFollowingResult                          ___byte_Variable;                                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAIAsyncTaskBlueprintProxy*             CallFunc_CreateMoveToProxyObject_ReturnValue;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AVagrant_BP_C*                          K2Node_DynamicCast_AsVagrant_BP;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸) == 0x000008, "Wrong alignment on 取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸");
static_assert(sizeof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸) == 0x000068, "Wrong size on 取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, EntryPoint) == 0x000000, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::EntryPoint' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_CustomEvent_MovementResult_1) == 0x000010, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_CustomEvent_MovementResult_1' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_CustomEvent_MovementResult) == 0x000024, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_CustomEvent_MovementResult' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_CreateDelegate_OutputDelegate_1) == 0x000028, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, ___byte_Variable) == 0x000038, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::___byte_Variable' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_Event_OwnerController) == 0x000040, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_Event_ControlledPawn) == 0x000048, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, CallFunc_CreateMoveToProxyObject_ReturnValue) == 0x000050, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::CallFunc_CreateMoveToProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_DynamicCast_AsVagrant_BP) == 0x000058, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_DynamicCast_AsVagrant_BP' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, K2Node_DynamicCast_bSuccess) == 0x000060, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000061, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸, CallFunc_IsValid_ReturnValue) == 0x000062, "Member '取消攻击丧尸_C_ExecuteUbergraph_取消攻击丧尸::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function 取消攻击丧尸.取消攻击丧尸_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct 取消攻击丧尸_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(取消攻击丧尸_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on 取消攻击丧尸_C_ReceiveExecuteAI");
static_assert(sizeof(取消攻击丧尸_C_ReceiveExecuteAI) == 0x000010, "Wrong size on 取消攻击丧尸_C_ReceiveExecuteAI");
static_assert(offsetof(取消攻击丧尸_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member '取消攻击丧尸_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(取消攻击丧尸_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member '取消攻击丧尸_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

// Function 取消攻击丧尸.取消攻击丧尸_C.OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5
// 0x0001 (0x0001 - 0x0000)
struct 取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5) == 0x000001, "Wrong alignment on 取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5");
static_assert(sizeof(取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5) == 0x000001, "Wrong size on 取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5");
static_assert(offsetof(取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5, MovementResult) == 0x000000, "Member '取消攻击丧尸_C_OnSuccess_93481AFC40CD5094BDD0E9BD9B3305B5::MovementResult' has a wrong offset!");

// Function 取消攻击丧尸.取消攻击丧尸_C.OnFail_93481AFC40CD5094BDD0E9BD9B3305B5
// 0x0001 (0x0001 - 0x0000)
struct 取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5 final
{
public:
	EPathFollowingResult                          MovementResult;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5) == 0x000001, "Wrong alignment on 取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5");
static_assert(sizeof(取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5) == 0x000001, "Wrong size on 取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5");
static_assert(offsetof(取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5, MovementResult) == 0x000000, "Member '取消攻击丧尸_C_OnFail_93481AFC40CD5094BDD0E9BD9B3305B5::MovementResult' has a wrong offset!");

}

