#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 第一道门_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 第一道门_BP.第一道门_BP_C
// 0x00E8 (0x0308 - 0x0220)
class A第一道门_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                       拾取提示1; // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Six;                                               // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One0;                                              // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One1;                                              // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Zero;                                              // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Nine;                                              // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Seven;                                             // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Eight;                                             // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Four;                                              // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Five;                                              // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Two;                                               // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   Three;                                             // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   One;                                               // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       拾取提示; // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       密码显示; // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Keypad;                                         // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_CableA;                                         // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_DoorJ;                                          // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_FrameJ;                                         // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_140FFB4B49F4EC67F80C9D952C5C3B8B;     // 0x02D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_140FFB4B49F4EC67F80C9D952C5C3B8B; // 0x02DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DD[0x3];                                      // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0; // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABackroom_Quest_BP_C*                   BackroomQuest;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PlayerRef;                                         // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    Hit_Component;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          是否解密成功; // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_第一道门_BP(int32 EntryPoint);
	void 直接打开门();
	void PlayerInteration(class AActor* Player);
	void RenderDeepClose();
	void RenderDeepOpen();
	void ReceiveBeginPlay();
	void CORRECT();
	void BreakInteration();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void 输入密码(int32 输入的密码);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"第一道门_BP_C">();
	}
	static class A第一道门_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<A第一道门_BP_C>();
	}
};
static_assert(alignof(A第一道门_BP_C) == 0x000008, "Wrong alignment on A第一道门_BP_C");
static_assert(sizeof(A第一道门_BP_C) == 0x000308, "Wrong size on A第一道门_BP_C");
static_assert(offsetof(A第一道门_BP_C, UberGraphFrame) == 0x000220, "Member 'A第一道门_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, 拾取提示1) == 0x000228, "Member 'A第一道门_BP_C::拾取提示1' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Arrow) == 0x000230, "Member 'A第一道门_BP_C::Arrow' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Six) == 0x000238, "Member 'A第一道门_BP_C::Six' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, One0) == 0x000240, "Member 'A第一道门_BP_C::One0' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, One1) == 0x000248, "Member 'A第一道门_BP_C::One1' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Zero) == 0x000250, "Member 'A第一道门_BP_C::Zero' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Nine) == 0x000258, "Member 'A第一道门_BP_C::Nine' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Seven) == 0x000260, "Member 'A第一道门_BP_C::Seven' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Eight) == 0x000268, "Member 'A第一道门_BP_C::Eight' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Four) == 0x000270, "Member 'A第一道门_BP_C::Four' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Five) == 0x000278, "Member 'A第一道门_BP_C::Five' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Two) == 0x000280, "Member 'A第一道门_BP_C::Two' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Three) == 0x000288, "Member 'A第一道门_BP_C::Three' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, One) == 0x000290, "Member 'A第一道门_BP_C::One' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, CineCamera) == 0x000298, "Member 'A第一道门_BP_C::CineCamera' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, 拾取提示) == 0x0002A0, "Member 'A第一道门_BP_C::拾取提示' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, 密码显示) == 0x0002A8, "Member 'A第一道门_BP_C::密码显示' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, SM_Keypad) == 0x0002B0, "Member 'A第一道门_BP_C::SM_Keypad' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, SM_CableA) == 0x0002B8, "Member 'A第一道门_BP_C::SM_CableA' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, SM_DoorJ) == 0x0002C0, "Member 'A第一道门_BP_C::SM_DoorJ' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, SM_FrameJ) == 0x0002C8, "Member 'A第一道门_BP_C::SM_FrameJ' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, DefaultSceneRoot) == 0x0002D0, "Member 'A第一道门_BP_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, ____0______0_140FFB4B49F4EC67F80C9D952C5C3B8B) == 0x0002D8, "Member 'A第一道门_BP_C::____0______0_140FFB4B49F4EC67F80C9D952C5C3B8B' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, ____0__Direction_140FFB4B49F4EC67F80C9D952C5C3B8B) == 0x0002DC, "Member 'A第一道门_BP_C::____0__Direction_140FFB4B49F4EC67F80C9D952C5C3B8B' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, 时间轴_0) == 0x0002E0, "Member 'A第一道门_BP_C::时间轴_0' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, BackroomQuest) == 0x0002E8, "Member 'A第一道门_BP_C::BackroomQuest' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, PlayerRef) == 0x0002F0, "Member 'A第一道门_BP_C::PlayerRef' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, Hit_Component) == 0x0002F8, "Member 'A第一道门_BP_C::Hit_Component' has a wrong offset!");
static_assert(offsetof(A第一道门_BP_C, 是否解密成功) == 0x000300, "Member 'A第一道门_BP_C::是否解密成功' has a wrong offset!");

}

