#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 选择自定义人物

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function 选择自定义人物.选择自定义人物_C.ExecuteUbergraph_选择自定义人物
// 0x0050 (0x0050 - 0x0000)
struct 选择自定义人物_C_ExecuteUbergraph_选择自定义人物 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACustomCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACustomCharacter_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UCustomCharacterUMG_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCustomCharacterUMG_C*                  CallFunc_Array_Get_Item_1;                         // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物) == 0x000008, "Wrong alignment on 选择自定义人物_C_ExecuteUbergraph_选择自定义人物");
static_assert(sizeof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物) == 0x000050, "Wrong size on 选择自定义人物_C_ExecuteUbergraph_选择自定义人物");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, EntryPoint) == 0x000000, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::EntryPoint' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, K2Node_Event_IsDesignTime) == 0x000028, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_Array_Get_Item) == 0x000030, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000038, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(选择自定义人物_C_ExecuteUbergraph_选择自定义人物, CallFunc_Array_Get_Item_1) == 0x000048, "Member '选择自定义人物_C_ExecuteUbergraph_选择自定义人物::CallFunc_Array_Get_Item_1' has a wrong offset!");

// Function 选择自定义人物.选择自定义人物_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct 选择自定义人物_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(选择自定义人物_C_PreConstruct) == 0x000001, "Wrong alignment on 选择自定义人物_C_PreConstruct");
static_assert(sizeof(选择自定义人物_C_PreConstruct) == 0x000001, "Wrong size on 选择自定义人物_C_PreConstruct");
static_assert(offsetof(选择自定义人物_C_PreConstruct, IsDesignTime) == 0x000000, "Member '选择自定义人物_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function 选择自定义人物.选择自定义人物_C.GetBrush_0
// 0x0088 (0x0088 - 0x0000)
struct 选择自定义人物_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(选择自定义人物_C_GetBrush_0) == 0x000008, "Wrong alignment on 选择自定义人物_C_GetBrush_0");
static_assert(sizeof(选择自定义人物_C_GetBrush_0) == 0x000088, "Wrong size on 选择自定义人物_C_GetBrush_0");
static_assert(offsetof(选择自定义人物_C_GetBrush_0, ReturnValue) == 0x000000, "Member '选择自定义人物_C_GetBrush_0::ReturnValue' has a wrong offset!");

}

