#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 选择自定义部位文字

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CustomCharacterEnum_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass 选择自定义部位文字.选择自定义部位文字_C
// 0x0058 (0x02B8 - 0x0260)
class U选择自定义部位文字_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       互动;                                            // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_66;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_73;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             部位文字; // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ECustomCharacterEnum                          CustomCharacterEnum;                               // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_289[0x7];                                      // 0x0289(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   按钮类别; // 0x0290(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCustomCharacterUMG_C*                  CustomCharacterUMG;                                // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Click_;                                            // 0x02B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_选择自定义部位文字(int32 EntryPoint);
	void SettingDetails(const class FText& 标题, const class FText& 详情);
	void Reset();
	void initializeSetting();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__选择自定义部位文字_Button_73_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void CustomMappingCheck(const struct FInputActionKeyMapping& InputAction, const struct FInputAxisKeyMapping& InputAxis);
	void Construct();
	void BndEvt__选择自定义部位_Button_73_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__选择自定义部位_Button_73_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void 选中状态();
	void 刷新部位名字();
	bool 单独视角设置(const class FText& Value);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"选择自定义部位文字_C">();
	}
	static class U选择自定义部位文字_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<U选择自定义部位文字_C>();
	}
};
static_assert(alignof(U选择自定义部位文字_C) == 0x000008, "Wrong alignment on U选择自定义部位文字_C");
static_assert(sizeof(U选择自定义部位文字_C) == 0x0002B8, "Wrong size on U选择自定义部位文字_C");
static_assert(offsetof(U选择自定义部位文字_C, UberGraphFrame) == 0x000260, "Member 'U选择自定义部位文字_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, 互动) == 0x000268, "Member 'U选择自定义部位文字_C::互动' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, Border_66) == 0x000270, "Member 'U选择自定义部位文字_C::Border_66' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, Button_73) == 0x000278, "Member 'U选择自定义部位文字_C::Button_73' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, 部位文字) == 0x000280, "Member 'U选择自定义部位文字_C::部位文字' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, CustomCharacterEnum) == 0x000288, "Member 'U选择自定义部位文字_C::CustomCharacterEnum' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, 按钮类别) == 0x000290, "Member 'U选择自定义部位文字_C::按钮类别' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, CustomCharacterUMG) == 0x0002A8, "Member 'U选择自定义部位文字_C::CustomCharacterUMG' has a wrong offset!");
static_assert(offsetof(U选择自定义部位文字_C, Click_) == 0x0002B0, "Member 'U选择自定义部位文字_C::Click_' has a wrong offset!");

}

