#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 选择自定义部位图片

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function 选择自定义部位图片.选择自定义部位图片_C.ExecuteUbergraph_选择自定义部位图片
// 0x00E8 (0x00E8 - 0x0000)
struct 选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ACustomCharacter_C*>             CallFunc_GetAllActorsOfClass_OutActors;            // 0x0018(0x0010)(ReferenceParm)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACustomCharacter_C*                     CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_1;                   // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UCustomCharacterUMG_C*>          CallFunc_GetAllWidgetsOfClass_FoundWidgets;        // 0x0068(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCustomCharacterUMG_C*                  CallFunc_Array_Get_Item_1;                         // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_5;                    // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_85[0x3];                                       // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_2;                   // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_3;             // 0x00A0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_3;                   // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_4;             // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_4;                   // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Contains_ReturnValue_5;                   // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_CA[0x6];                                       // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_5;             // 0x00D0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Contains_ReturnValue_6;                   // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片) == 0x000008, "Wrong alignment on 选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片");
static_assert(sizeof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片) == 0x0000E8, "Wrong size on 选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, EntryPoint) == 0x000000, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::EntryPoint' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetAllActorsOfClass_OutActors) == 0x000018, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess) == 0x000028, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Array_Get_Item) == 0x000030, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue) == 0x000038, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue) == 0x000048, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue_1) == 0x000050, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_1) == 0x000060, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_Event_IsDesignTime) == 0x000061, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetAllWidgetsOfClass_FoundWidgets) == 0x000068, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetAllWidgetsOfClass_FoundWidgets' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Array_Get_Item_1) == 0x000078, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess_1) == 0x000080, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess_2) == 0x000081, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess_3) == 0x000082, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess_4) == 0x000083, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, K2Node_SwitchEnum_CmpSuccess_5) == 0x000084, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::K2Node_SwitchEnum_CmpSuccess_5' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue_2) == 0x000088, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_2) == 0x000098, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue_3) == 0x0000A0, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_3) == 0x0000B0, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue_4) == 0x0000B8, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_4) == 0x0000C8, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_5) == 0x0000C9, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_GetDisplayName_ReturnValue_5) == 0x0000D0, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_GetDisplayName_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片, CallFunc_Contains_ReturnValue_6) == 0x0000E0, "Member '选择自定义部位图片_C_ExecuteUbergraph_选择自定义部位图片::CallFunc_Contains_ReturnValue_6' has a wrong offset!");

// Function 选择自定义部位图片.选择自定义部位图片_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct 选择自定义部位图片_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(选择自定义部位图片_C_PreConstruct) == 0x000001, "Wrong alignment on 选择自定义部位图片_C_PreConstruct");
static_assert(sizeof(选择自定义部位图片_C_PreConstruct) == 0x000001, "Wrong size on 选择自定义部位图片_C_PreConstruct");
static_assert(offsetof(选择自定义部位图片_C_PreConstruct, IsDesignTime) == 0x000000, "Member '选择自定义部位图片_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function 选择自定义部位图片.选择自定义部位图片_C.GetBrush_0
// 0x0088 (0x0088 - 0x0000)
struct 选择自定义部位图片_C_GetBrush_0 final
{
public:
	struct FSlateBrush                            ReturnValue;                                       // 0x0000(0x0088)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(选择自定义部位图片_C_GetBrush_0) == 0x000008, "Wrong alignment on 选择自定义部位图片_C_GetBrush_0");
static_assert(sizeof(选择自定义部位图片_C_GetBrush_0) == 0x000088, "Wrong size on 选择自定义部位图片_C_GetBrush_0");
static_assert(offsetof(选择自定义部位图片_C_GetBrush_0, ReturnValue) == 0x000000, "Member '选择自定义部位图片_C_GetBrush_0::ReturnValue' has a wrong offset!");

}

