#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 选择自定义部位图片

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CustomCharacterEnum_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass 选择自定义部位图片.选择自定义部位图片_C
// 0x00D8 (0x0338 - 0x0260)
class U选择自定义部位图片_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       交互; // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UButton*                                Button_48;                                         // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_105;                                         // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateBrush                            Image;                                             // 0x0280(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	ECustomCharacterEnum                          CustomCharacterEnum;                               // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACustomCharacter_C*                     CustomCharacterRef;                                // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          New_Mesh;                                          // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTexture2D*                             Texture;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCustomCharacterState_BP_C*             As_Custom_Character_State_BP;                      // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UCustomCharacterUMG_C*                  CustomCharacterUMG;                                // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_选择自定义部位图片(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__选择自定义部位图片_Button_48_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__选择自定义部位图片_Button_48_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__选择自定义部位图片_Button_48_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();
	void Construct();
	struct FSlateBrush GetBrush_0();
	void 切换服装前需要关闭的();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"选择自定义部位图片_C">();
	}
	static class U选择自定义部位图片_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<U选择自定义部位图片_C>();
	}
};
static_assert(alignof(U选择自定义部位图片_C) == 0x000008, "Wrong alignment on U选择自定义部位图片_C");
static_assert(sizeof(U选择自定义部位图片_C) == 0x000338, "Wrong size on U选择自定义部位图片_C");
static_assert(offsetof(U选择自定义部位图片_C, UberGraphFrame) == 0x000260, "Member 'U选择自定义部位图片_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, 交互) == 0x000268, "Member 'U选择自定义部位图片_C::交互' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, Button_48) == 0x000270, "Member 'U选择自定义部位图片_C::Button_48' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, Image_105) == 0x000278, "Member 'U选择自定义部位图片_C::Image_105' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, Image) == 0x000280, "Member 'U选择自定义部位图片_C::Image' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, CustomCharacterEnum) == 0x000308, "Member 'U选择自定义部位图片_C::CustomCharacterEnum' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, CustomCharacterRef) == 0x000310, "Member 'U选择自定义部位图片_C::CustomCharacterRef' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, New_Mesh) == 0x000318, "Member 'U选择自定义部位图片_C::New_Mesh' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, Texture) == 0x000320, "Member 'U选择自定义部位图片_C::Texture' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, As_Custom_Character_State_BP) == 0x000328, "Member 'U选择自定义部位图片_C::As_Custom_Character_State_BP' has a wrong offset!");
static_assert(offsetof(U选择自定义部位图片_C, CustomCharacterUMG) == 0x000330, "Member 'U选择自定义部位图片_C::CustomCharacterUMG' has a wrong offset!");

}

