#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: 键盘密码按钮_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 键盘密码按钮_BP.键盘密码按钮_BP_C
// 0x0040 (0x0260 - 0x0220)
class A键盘密码按钮_BP_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDecalComponent*                        Decal;                                             // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Button1;                                        // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Scene;                                             // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         ____0______0_413F1D66432576EEF16C1D8229640DAF;     // 0x0240(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ____0__Direction_413F1D66432576EEF16C1D8229640DAF; // 0x0244(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     时间轴_0; // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMesh*                            New_Mesh;                                          // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class A第一道门_BP_C* DoorRef;                                           // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_键盘密码按钮_BP(int32 EntryPoint);
	void BndEvt__键盘密码按钮_BP_SM_Button1_K2Node_ComponentBoundEvent_2_ComponentOnClickedSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent, const struct FKey& ButtonPressed);
	void BndEvt__键盘密码按钮_BP_SM_Button1_K2Node_ComponentBoundEvent_1_ComponentEndCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void BndEvt__键盘密码按钮_BP_SM_Button1_K2Node_ComponentBoundEvent_0_ComponentBeginCursorOverSignature__DelegateSignature(class UPrimitiveComponent* TouchedComponent);
	void ReceiveBeginPlay();
	void 时间轴_0__UpdateFunc();
	void 时间轴_0__FinishedFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"键盘密码按钮_BP_C">();
	}
	static class A键盘密码按钮_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<A键盘密码按钮_BP_C>();
	}
};
static_assert(alignof(A键盘密码按钮_BP_C) == 0x000008, "Wrong alignment on A键盘密码按钮_BP_C");
static_assert(sizeof(A键盘密码按钮_BP_C) == 0x000260, "Wrong size on A键盘密码按钮_BP_C");
static_assert(offsetof(A键盘密码按钮_BP_C, UberGraphFrame) == 0x000220, "Member 'A键盘密码按钮_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, Decal) == 0x000228, "Member 'A键盘密码按钮_BP_C::Decal' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, SM_Button1) == 0x000230, "Member 'A键盘密码按钮_BP_C::SM_Button1' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, Scene) == 0x000238, "Member 'A键盘密码按钮_BP_C::Scene' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, ____0______0_413F1D66432576EEF16C1D8229640DAF) == 0x000240, "Member 'A键盘密码按钮_BP_C::____0______0_413F1D66432576EEF16C1D8229640DAF' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, ____0__Direction_413F1D66432576EEF16C1D8229640DAF) == 0x000244, "Member 'A键盘密码按钮_BP_C::____0__Direction_413F1D66432576EEF16C1D8229640DAF' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, 时间轴_0) == 0x000248, "Member 'A键盘密码按钮_BP_C::时间轴_0' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, New_Mesh) == 0x000250, "Member 'A键盘密码按钮_BP_C::New_Mesh' has a wrong offset!");
static_assert(offsetof(A键盘密码按钮_BP_C, DoorRef) == 0x000258, "Member 'A键盘密码按钮_BP_C::DoorRef' has a wrong offset!");

}

